[{"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/189477/california-roll-sushi/", "name": "California Roll Sushi", "summary": "\nCalifornia Roll - it's really good. Serve with soy sauce and wasabi. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4564632.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 rolls"]], "ingredients": ["1 cup uncooked short-grain white rice", "1 cup water", "¼ cup rice vinegar", "1 tablespoon white sugar", "½ cup imitation crabmeat, finely chopped", "¼ cup mayonnaise", "8 sheets nori (dry seaweed)", "2 ½ tablespoons sesame seeds", "1  cucumber, cut into thin spears", "2  avocados - pitted, peeled, and sliced the long way"], "direction": ["Wash the rice in several changes of water until the rinse water is no longer cloudy, drain well, and place in a covered pan or rice cooker with 1 cup water. Bring to a boil, reduce heat to a simmer, and cover the pan. Allow the rice to simmer until the top looks dry, about 15 minutes. Turn off the heat, and let stand for 10 minutes to absorb the rest of the water.", "Mix the rice vinegar and sugar in a small bowl until the sugar has dissolved, and stir the mixture into the cooked rice until well combined. Allow the rice to cool, and set aside.", "Mix the imitation crabmeat with mayonnaise in a bowl, and set aside. To roll the sushi, cover a bamboo rolling mat with plastic wrap. Lay a sheet of nori, shiny side down, on the plastic wrap. With wet fingers, firmly pat a thin, even layer of prepared rice over the nori, leaving 1/4 inch uncovered at the bottom edge of the sheet. Sprinkle the rice with about 1/2 teaspoon of sesame seeds, and gently press them into the rice. Carefully flip the nori sheet over so the seaweed side is up.", "Place 2 or 3 long cucumber spears, 2 or 3 slices of avocado, and about 1 tablespoon of imitation crab mixture in a line across the nori sheet, about 1/4 from the uncovered edge. Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a cylinder about 1 1/2 inch in diameter. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly.", "Cut each roll into 1 inch pieces with a very sharp knife dipped in water."], "facts": "232 calories; protein 3.9g 8% DV; carbohydrates 23.7g 8% DV; fat 14.4g 22% DV; cholesterol 4.7mg 2% DV; sodium 135mg 5% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/246250/kima/", "name": "Kima", "summary": "\nThis was a family-favorite as I was growing up. It's fast and easy. Serve on a bed of rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3349573.jpg", "meta": [["prep:", "10 mins"], ["cook:", "28 mins"], ["total:", "38 mins"], ["Servings:", "4"], ["Yield:", "1 /2-cup servings"]], "ingredients": ["3 tablespoons butter", "1 cup chopped onion", "1 clove garlic, minced", "1 pound ground beef", "2  tomatoes, chopped", "1 cup frozen peas", "1 tablespoon Masala curry powder", "1 ½ teaspoons salt", "1 teaspoon paprika", "½ teaspoon chili powder", "1 dash ground black pepper", "¼ cup flaked coconut, or to taste"], "direction": ["Melt butter in a skillet over medium heat. stir in onion and garlic; cook until onion is translucent, 3 to 5 minutes.", "Stir beef into onion mixture; cook until crumbly and no longer pink, 5 to 10 minutes. Drain excess fat from beef mixture.", "Stir tomatoes, peas, curry powder, salt, paprika, chili powder, and black pepper into beef mixture; cook until thickened, about 20 minutes. Garnish with coconut."], "facts": "420 calories; protein 22.6g 45% DV; carbohydrates 14.5g 5% DV; fat 30.7g 47% DV; cholesterol 92.5mg 31% DV; sodium 1052.9mg 42% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/245993/soba-noodle-salad-with-chicken-and-sesame/", "name": "Soba Noodle Salad with Chicken and Sesame", "summary": "\nThis tasty salad with Japanese buckwheat noodles is both quick and healthy; great for lunch or dinner. Most larger supermarkets have buckwheat soba noodles in the Asian food section. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3332559.jpg", "meta": [["prep:", "20 mins"], ["cook:", "7 mins"], ["total:", "27 mins"], ["Servings:", "3"], ["Yield:", "3 cups"]], "ingredients": ["2 tablespoons rice vinegar", "1 tablespoon vegetable oil", "1 tablespoon sesame oil", "1 tablespoon brown sugar", "1 tablespoon soy sauce", "2 teaspoons minced fresh ginger root", "4 ounces buckwheat soba noodles", "2 teaspoons vegetable oil", "1  boneless skinless chicken breast, cut into thin bite-size strips", "1 teaspoon chopped garlic", "salt and ground black pepper to taste", "1 rib celery, sliced  (Optional)", "1  carrot, sliced", "½  red bell pepper, chopped", "¼ cup chopped fresh cilantro", "2 tablespoons chopped green onion", "1 tablespoon sesame seeds"], "direction": ["Whisk rice vinegar, 1 tablespoon vegetable oil, sesame oil, brown sugar, soy sauce, and ginger together in a large bowl until dressing is combined.", "Bring water to a boil in a large pot. Add soba noodles, stir, and return water to a boil. Boil noodles until tender, 4 to 5 minutes. Drain noodles in a colander under cold running water until cool, about 1 minute.", "Heat 2 teaspoons vegetable oil in a skillet over medium heat. Cook chicken breast pieces until no longer pink in the center and the juices run clear, 2 to 4 minutes. Add garlic, salt, and pepper; stir until fragrant, about 1 minute more.", "Toss soba noodles, chicken, celery, carrot, red pepper, cilantro, green onion, and sesame seeds together with dressing in large bowl."], "facts": "340 calories; protein 15.5g 31% DV; carbohydrates 38.3g 12% DV; fat 15.2g 23% DV; cholesterol 23.1mg 8% DV; sodium 704.2mg 28% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/241806/spicy-baked-tofu/", "name": "Spicy Baked Tofu", "summary": "\nThis healthy, protein-packed tofu dish is filled with flavor. This is a spicy dish. I don't find it overly spicy but I like heat in my faux-meat! I served this with wilted garlic spinach and a fresh salad on the side. Remember that tofu is a concentrated protein, so you don't need as much tofu as you would meat. This dish is great reheated! If you want to be really creative, try grilling your tofu for an even more delicious result! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2258469.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["additional:", "1 hr 5 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  serving cooking spray", "1 (12 ounce) package tofu", "2 tablespoons Japanese low-sodium soy sauce", "2 tablespoons Asian chili sauce", "2 tablespoons minced fresh ginger root", "1 ½ tablespoons hoisin sauce"], "direction": ["Lay the tofu on a plate lined with a couple sheets of paper towel. Layer more paper towel atop tofu and place another plate atop the stack to press water from the tofu. Let sit at least 5 minutes.", "Cut tofu into 1/2-inch strips and put into a large, sealable plastic bag; add soy sauce, chili sauce, ginger, and hoisin sauce. Squeeze bag to remove excess air and seal. Marinate tofu in the refrigerator for at least 1 hour.", "Preheat oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.", "Remove tofu from the marinade, shake to remove excess moisture, and arrange onto the prepared baking sheet. Discard the remaining marinade.", "Bake in preheated oven for 15 minutes, flip, and continue baking until firm, 15 to 20 minutes more."], "facts": "88 calories; protein 7.4g 15% DV; carbohydrates 6.1g 2% DV; fat 4.3g 7% DV; cholesterol 0.2mg; sodium 686.2mg 27% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/239818/iranian-persian-salad-shirazi/", "name": "Iranian / Persian Salad Shirazi", "summary": "\nAn excellent light side salad to accompany a heavy Persian meal or any meal really. Sumac is the red bitter spice usually served for sprinkling on kebab. It's available at most Middle Eastern stores, but if you can't find it just leave it out. I like to dice the veggies very small about 1/4-inch. Serve with fresh lemon wedges. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2282013.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  ripe tomatoes, seeded and diced", "1  red onion, diced", "2 small English cucumbers, peeled and diced", "3 tablespoons olive oil", "lemon, juiced", "1 tablespoon dried mint", "1 teaspoon dried dill", "1 teaspoon ground sumac", "salt and ground black pepper to taste"], "direction": ["Mix tomatoes, red onion, cucumbers, olive oil, lemon juice, mint, dill, sumac, salt, and pepper together in a bowl."], "facts": "145 calories; protein 2.6g 5% DV; carbohydrates 13.8g 5% DV; fat 10.7g 17% DV; cholesterol 0mg; sodium 51.9mg 2% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/238977/lamb-korma/", "name": "Lamb Korma", "summary": "\nOriginated in Persia, brought to India during Akbar period, and modified in Kashmir. \nThe recipe varies from region to region and restaurant to restaurant. North Indian Korma is pale yellow in color from saffron and cooked without any tomatoes or turmeric. This recipe version will be the closest to the traditional Kashmiri Korma. Kashmir Pandits substitute onion and garlic with asafoetida. Serve with jasmine rice and mango chutney. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4469168.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 ¼ pounds cubed lamb meat", "4 teaspoons olive oil, divided", "1  brown onion, chopped", "1  red potato, peeled and cubed", "½ cup curry powder", "½ cup water", "⅓ cup coconut milk", "⅓ cup drained canned chickpeas (garbanzo beans)"], "direction": ["Place lamb in a bowl and drizzle 2 teaspoons olive oil over lamb; stir until coated.", "Heat remaining 2 teaspoons olive oil in a saucepan over low heat; cook and stir onion until softened, 10 to 15 minutes. Remove saucepan from heat and add potato to onion.", "Heat a large skillet over medium heat; cook and stir lamb, working in small batches, until browned, about 5 minutes per batch. Transfer browned lamb to onion mixture.", "Stir curry into lamb-onion mixture and cook over medium heat for 1 minute. Add water to lamb-onion mixture and bring to a boil. Reduce heat to low, cover saucepan, and simmer until lamb is cooked through and potatoes are tender, about 45 minutes.", "Mix coconut milk and chickpeas into lamb-onion mixture and simmer until heated through, about 5 minutes."], "facts": "302 calories; protein 28.1g 56% DV; carbohydrates 17.4g 6% DV; fat 13.8g 21% DV; cholesterol 80.3mg 27% DV; sodium 102.2mg 4% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/230330/nuoc-cham-vietnamese-spicy-dipping-sauce/", "name": "Nuoc Cham (Vietnamese Spicy Dipping Sauce)", "summary": "\nThis sauce can be used for dipping veggies, meats, or egg rolls. It's also great spooned over a bowl of steaming hot pho or other rice noodle soup. For me this sauce IS the flavor of Vietnamese cooking. Enjoy! This can be stored in the fridge for up to two weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3913338.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["3 ½ fluid ounces water", "6  spicy red chile peppers, seeded and minced", "6 cloves garlic, minced", "¼ cup fish sauce", "¼ cup rice vinegar", "¼ cup white sugar", "¼ cup lemon juice"], "direction": ["Stir water, chile peppers, garlic, fish sauce, rice vinegar, and sugar together in a saucepan over medium-low heat until sugar dissolves into the liquid; remove from heat and set aside to cool completely, about 1 hour.", "Stir lemon juice into the cooled liquid."], "facts": "36 calories; protein 0.9g 2% DV; carbohydrates 8.7g 3% DV; fat 0.1g; cholesterol 0mg; sodium 440.8mg 18% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228240/bibimbap-korean-rice-with-mixed-vegetables/", "name": "Bibimbap (Korean Rice With Mixed Vegetables)", "summary": "\nAlong with kimchi, bibimbap takes its place among the favored foods in Korean cuisine. Literally meaning 'mixed rice,' it's a popular meal consisting of white rice topped with vegetables, beef, a whole egg, and gochujang (red chili pepper paste). For those who cannot handle the spiciness (like our children), you can substitute with soy sauce or Sriracha (rooster sauce) in place of it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3961066.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  English cucumber, cut into matchsticks", "¼ cup gochujang (Korean hot pepper paste)  (Optional)", "1 bunch fresh spinach, cut into thin strips", "1 tablespoon soy sauce", "1 teaspoon olive oil", "2  carrots, cut into matchsticks", "1 clove garlic, minced", "1 pinch red pepper flakes", "1 pound thinly-sliced beef top round steak", "1 teaspoon olive oil", "4  large eggs", "4 cups cooked white rice", "4 teaspoons toasted sesame oil, divided", "1 teaspoon sesame seeds", "2 teaspoons gochujang (Korean hot pepper paste), divided  (Optional)"], "direction": ["Stir cucumber pieces with 1/4 cup gochujang paste in a bowl; set aside.", "Bring about 2 cups of water to a boil in a large nonstick skillet and stir in spinach; cook until spinach is bright green and wilted, 2 to 3 minutes. Drain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir soy sauce into spinach.", "Heat 1 teaspoon olive oil in large nonstick skillet and cook and stir carrots until softened, about 3 minutes; stir in garlic and cook just until fragrant, about 1 more minute. Stir in cucumber pieces with gochujang paste; sprinkle with red pepper flakes, and set the mixture aside in a bowl.", "Brown beef in a clean nonstick skillet over medium heat, about 5 minutes per side, and set aside. In a separate nonstick skillet, heat 1 more teaspoon olive oil over medium-low heat and fry the eggs just on one side until yolks are runny but whites are firm, 2 to 4 minutes each.", "To assemble the dish, divide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon of sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired."], "facts": "569 calories; protein 34.9g 70% DV; carbohydrates 63g 20% DV; fat 19.3g 30% DV; cholesterol 242.9mg 81% DV; sodium 573.9mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/79543/fried-rice-restaurant-style/", "name": "Fried Rice Restaurant Style", "summary": "\nA quick fried rice like you get at your favorite Chinese restaurant. A couple of eggs, baby carrots, peas and soy sauce is all you need. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3770230.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups enriched white rice", "4 cups water", "⅔ cup chopped baby carrots", "½ cup frozen green peas", "2 tablespoons vegetable oil", "2  eggs", "soy sauce to taste", "2 tablespoons sesame oil, to taste"], "direction": ["In a saucepan, combine rice and water. Bring to a boil. Reduce heat, cover, and simmer for 20 minutes.", "In a small saucepan, boil carrots in water about 3 to 5 minutes. Drop peas into boiling water, and drain.", "Heat wok over high heat. Pour in oil, then stir in carrots and peas; cook about 30 seconds. Crack in eggs, stirring quickly to scramble eggs with vegetables. Stir in cooked rice. Shake in soy sauce, and toss rice to coat. Drizzle with sesame oil, and toss again."], "facts": "261 calories; protein 5.8g 12% DV; carbohydrates 39.7g 13% DV; fat 8.4g 13% DV; cholesterol 46.5mg 16% DV; sodium 380.9mg 15% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/259887/simple-teriyaki-sauce/", "name": "Simple Teriyaki Sauce", "summary": "\nThis simple but amazing teriyaki sauce will take your chicken and rice to the next level! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4553894.jpg", "meta": [["prep:", "5 mins"], ["cook:", "6 mins"], ["total:", "11 mins"], ["Servings:", "12"], ["Yield:", "cups"]], "ingredients": ["1 cup water", "¼ cup soy sauce", "5 teaspoons packed brown sugar", "1 tablespoon honey, or more to taste", "½ teaspoon ground ginger", "¼ teaspoon garlic powder", "2 tablespoons cornstarch", "¼ cup cold water"], "direction": ["Combine 1 cup water, soy sauce, brown sugar, honey, ginger, and garlic powder in a saucepan over medium heat. Cook until nearly heated through, about 1 minute.", "Mix cornstarch and 1/4 cold water together in a cup; stir until dissolved. Add to the saucepan. Cook and stir sauce until thickened, 5 to 7 minutes."], "facts": "21 calories; protein 0.4g 1% DV; carbohydrates 5g 2% DV; fat 0g; cholesterol 0mg; sodium 302.1mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/99211/perfect-sushi-rice/", "name": "Perfect Sushi Rice", "summary": "\nHere is my recipe for the perfect sushi rice. You can eat this alone or roll into your favorite sushi roll with ingredients of choice. I use strips of carrots, cucumbers and slices of avocado. You can adjust the amount of vinegar in this recipe to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5646437.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "15"], ["Yield:", "5 cups"]], "ingredients": ["2 cups uncooked glutinous white rice (sushi rice)", "3 cups water", "½ cup rice vinegar", "1 tablespoon vegetable oil", "¼ cup white sugar", "1 teaspoon salt"], "direction": ["Rinse the rice in a strainer or colander until the water runs clear. Combine with water in a medium saucepan. Bring to a boil, then reduce the heat to low, cover and cook for 20 minutes. Rice should be tender and water should be absorbed. Cool until cool enough to handle.", "In a small saucepan, combine the rice vinegar, oil, sugar and salt. Cook over medium heat until the sugar dissolves. Cool, then stir into the cooked rice. When you pour this in to the rice it will seem very wet. Keep stirring and the rice will dry as it cools."], "facts": "112 calories; protein 1.7g 3% DV; carbohydrates 23.5g 8% DV; fat 1g 2% DV; cholesterol 0mg; sodium 158.2mg 6% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/212721/indian-chicken-curry-murgh-kari/", "name": "Indian Chicken Curry (Murgh Kari)", "summary": "\nThis is a really good recipe for spicy Indian chicken curry. It's pretty easy to make and tastes really good! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465974.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 pounds skinless, boneless chicken breast halves", "2 teaspoons salt", "½ cup cooking oil", "1 ½ cups chopped onion", "1 tablespoon minced garlic", "1 ½ teaspoons minced fresh ginger root", "1 tablespoon curry powder", "1 teaspoon ground cumin", "1 teaspoon ground turmeric", "1 teaspoon ground coriander", "1 teaspoon cayenne pepper", "1 tablespoon water", "1 (15 ounce) can crushed tomatoes", "1 cup plain yogurt", "1 tablespoon chopped fresh cilantro", "1 teaspoon salt", "½ cup water", "1 teaspoon garam masala", "1 tablespoon chopped fresh cilantro", "1 tablespoon fresh lemon juice"], "direction": ["Sprinkle the chicken breasts with 2 teaspoons salt.", "Heat the oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned. Transfer the browned chicken breasts to a plate and set aside.", "Reduce the heat under the skillet to medium-high; add the onion, garlic, and ginger to the oil remaining in the skillet and cook and stir until the onion turns translucent, about 8 minutes. Stir the curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. Mix the tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt into the mixture. Return the chicken breast to the skillet along with any juices on the plate. Pour 1/2 cup water into the mixture; bring to a boil, turning the chicken to coat with the sauce. Sprinkle the garam masala and 1 tablespoon cilantro over the chicken.", "Cover the skillet and simmer until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).  Sprinkle with lemon juice to serve."], "facts": "427 calories; protein 38.1g 76% DV; carbohydrates 14.7g 5% DV; fat 24.3g 37% DV; cholesterol 94.7mg 32% DV; sodium 1370.4mg 55% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/35151/traditional-filipino-lumpia/", "name": "Traditional Filipino Lumpia", "summary": "\nThis is a traditional Filipino dish. It is the Filipino version of the egg rolls. It can be served as a side dish or as an appetizer. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6244851.jpg", "meta": [["prep:", "45 mins"], ["cook:", "25 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "15"], ["Yield:", "30 lumpia"]], "ingredients": ["1 tablespoon vegetable oil", "1 pound ground pork", "2 cloves garlic, crushed", "½ cup chopped onion", "½ cup minced carrots", "½ cup chopped green onions", "½ cup thinly sliced green cabbage", "1 teaspoon ground black pepper", "1 teaspoon salt", "1 teaspoon garlic powder", "1 teaspoon soy sauce", "30  lumpia wrappers", "2 cups vegetable oil for frying"], "direction": ["Place a wok or large skillet over high heat, and pour in 1 tablespoon vegetable oil. Cook pork, stirring frequently, until no pink is showing. Remove pork from pan and set aside. Drain grease from pan, leaving a thin coating. Cook garlic and onion in the same pan for 2 minutes. Stir in the cooked pork, carrots, green onions, and cabbage. Season with pepper, salt, garlic powder, and soy sauce. Remove from heat, and set aside until cool enough to handle.", "Place three heaping tablespoons of the filling diagonally near one corner of each wrapper, leaving a 1 1/2 inch space at both ends. Fold the side along the length of the filling over the filling, tuck in both ends, and roll neatly. Keep the roll tight as you assemble. Moisten the other side of the wrapper with water to seal the edge. Cover the rolls with plastic wrap to retain moisture.", "Heat a heavy skillet over medium heat, add oil to 1/2 inch depth, and heat for 5 minutes. Slide 3 or 4 lumpia into the oil. Fry the rolls for 1 to 2 minutes, until all sides are golden brown. Drain on paper towels. Serve immediately."], "facts": "168 calories; protein 7g 14% DV; carbohydrates 11g 4% DV; fat 10.5g 16% DV; cholesterol 23.2mg 8% DV; sodium 287.8mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/100606/beef-bulgogi/", "name": "Beef Bulgogi", "summary": "\nJust like my Korean mom makes it!  It's delicious! Even better if rolled up in red leaf lettuce with rice and hot pepper paste. If you want to spice it up just add red pepper powder to your marinade. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1254483.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound flank steak, thinly sliced", "5 tablespoons soy sauce", "2 ½ tablespoons white sugar", "¼ cup chopped green onion", "2 tablespoons minced garlic", "2 tablespoons sesame seeds", "2 tablespoons sesame oil", "½ teaspoon ground black pepper"], "direction": ["Place the beef in a shallow dish.  Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl.  Pour over beef.  Cover and refrigerate for at least 1 hour or overnight.", "Preheat an outdoor grill for high heat, and lightly oil the grate.", "Quickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side."], "facts": "232 calories; protein 16.2g 33% DV; carbohydrates 12.4g 4% DV; fat 13.2g 20% DV; cholesterol 27.2mg 9% DV; sodium 1157.4mg 46% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/232681/char-siu-chinese-bbq-pork/", "name": "Char Siu (Chinese BBQ Pork)", "summary": "\n\"Char siu\" literally means \"fork roast\" - \"char\" being \"fork\" (both noun and verb) and \"siu\" being \"roast\" - after the traditional cooking method for the dish: long strips of seasoned boneless pork are skewered with long forks and placed in a covered oven or over a fire. This is best cooked over charcoal, but it's important to cook with indirect heat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060446.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 25 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2  pork tenderloins", "½ cup soy sauce", "⅓ cup honey", "⅓ cup ketchup", "⅓ cup brown sugar", "¼ cup Chinese rice wine", "2 tablespoons hoisin sauce", "½ teaspoon red food coloring  (Optional)", "1 teaspoon Chinese five-spice powder  (Optional)"], "direction": ["Cut pork with the grain into strips 1 1/2- to 2-inches long; put into a large resealable plastic bag.", "Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red food coloring or red bean curd (see Cook's Note), and Chinese five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes. Pour the marinade into the bag with the pork, squeeze air from the bag, and seal. Turn bag a few times to coat all pork pieces in marinade.", "Marinate pork in refrigerator, 2 hours to overnight.", "Preheat an outdoor grill for medium-high heat and lightly oil the grate.", "Remove pork from marinade and shake to remove excess liquid. Discard remaining marinade.", "Cook pork on preheated grill for 20 minutes. Put a small container of water onto the grill and continue cooking, turning the pork regularly, until cooked through, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."], "facts": "483 calories; protein 43.8g 88% DV; carbohydrates 53.5g 17% DV; fat 8.9g 14% DV; cholesterol 126.7mg 42% DV; sodium 2249.8mg 90% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/56059/asian-coconut-rice/", "name": "Asian Coconut Rice", "summary": "\nI tried so many different ways to duplicate my favorite restaurant's coconut rice after they went out of business. This one is perfect! Garnish with toasted coconut and chopped cilantro if you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2232157.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (14 ounce) can coconut milk", "1 ¼ cups water", "1 teaspoon sugar", "1 pinch salt", "1 ½ cups uncooked jasmine rice"], "direction": ["In a saucepan, combine coconut milk, water, sugar, and salt. Stir until sugar is dissolved. Stir in rice. Bring to a boil over medium heat. Cover, reduce heat, and simmer 18 to 20 minutes, until rice is tender."], "facts": "453 calories; protein 6.8g 14% DV; carbohydrates 61.4g 20% DV; fat 20.9g 32% DV; cholesterol 0mg; sodium 53.7mg 2% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/71722/asian-lettuce-wraps/", "name": "Asian Lettuce Wraps", "summary": "\nDelicious and bursting with flavor, Asian lettuce wraps are a great idea for entertaining or a family style meal. Each person can build their own fresh, delicious wrap. Just be sure to have plates or napkins available since the mixture can sometimes drip a little. To serve, allow each person to spoon a portion of the meat into a lettuce leaf. Wrap the lettuce around the meat like a burrito and enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2630776.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["16  Boston Bibb or butter lettuce leaves", "1 pound lean ground beef", "1 tablespoon cooking oil", "1 large onion, chopped", "¼ cup hoisin sauce", "2 cloves fresh garlic, minced", "1 tablespoon soy sauce", "1 tablespoon rice wine vinegar", "2 teaspoons minced pickled ginger", "1 dash Asian chile pepper sauce, or to taste  (Optional)", "1 (8 ounce) can water chestnuts, drained and finely chopped", "1 bunch green onions, chopped", "2 teaspoons Asian (dark) sesame oil"], "direction": ["Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside.", "Heat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes.", "Arrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center."], "facts": "388 calories; protein 23.4g 47% DV; carbohydrates 24.3g 8% DV; fat 22.3g 34% DV; cholesterol 68.9mg 23% DV; sodium 579.6mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/14704/best-egg-rolls/", "name": "Best Egg Rolls", "summary": "\nThese are fabulous as a side dish with stir-fry dishes. Serve warm with egg roll sauce or soy sauce if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5174296.jpg", "meta": [["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground pork", "1 teaspoon ground ginger", "1 teaspoon garlic powder", "1 quart peanut oil for frying", "2 tablespoons all-purpose flour", "2 tablespoons water", "2 cups shredded cabbage", "2 ounces shredded carrots", "8 (7 inch square) egg roll wrappers", "2 tablespoons sesame seeds  (Optional)"], "direction": ["Season pork with ginger and garlic powder and mix thoroughly. Heat mixture in a medium skillet, stirring, until pork is cooked through and no longer pink. Set aside.", "In another large skillet heat oil to about 375 degrees F (190 degrees C) or medium high heat. While oil is heating, combine flour and water in a bowl until they form a paste. In a separate bowl combine the cabbage, carrots and reserved pork mixture. Mix all together.", "Lay out one egg roll skin with a corner pointed toward you. Place  about a 1/4 to 1/3 cup of the cabbage, carrot and pork mixture on  egg roll paper and fold corner up over the mixture. Fold left and right corners toward the center and continue to roll. Brush a bit of the flour paste on the final corner to help seal the egg roll.", "Place egg rolls into heated oil and fry, turning occasionally, until golden brown. Remove from oil and drain on paper towels or rack. Put on serving plate and top with sesame seeds if desired."], "facts": "334 calories; protein 14.2g 28% DV; carbohydrates 22.6g 7% DV; fat 20.5g 32% DV; cholesterol 39.7mg 13% DV; sodium 220.2mg 9% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/24239/vietnamese-fresh-spring-rolls/", "name": "Vietnamese Fresh Spring Rolls", "summary": "\nThese spring rolls are a refreshing change from the usual fried variety, and have become a family favorite.  They are great as a cool summertime appetizer, and are delicious dipped in one or both of the sauces. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5265636.jpg", "meta": [["prep:", "45 mins"], ["cook:", "5 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 spring rolls"]], "ingredients": ["2 ounces rice vermicelli", "8  rice wrappers (8.5 inch diameter)", "8 large cooked shrimp - peeled, deveined and cut in half", "1 ⅓ tablespoons chopped fresh Thai basil", "3 tablespoons chopped fresh mint leaves", "3 tablespoons chopped fresh cilantro", "2 leaves lettuce, chopped", "4 teaspoons fish sauce", "¼ cup water", "2 tablespoons fresh lime juice", "1 clove garlic, minced", "2 tablespoons white sugar", "½ teaspoon garlic chili sauce", "3 tablespoons hoisin sauce", "1 teaspoon finely chopped peanuts"], "direction": ["Bring a medium saucepan of water to boil. Boil rice vermicelli 3 to 5 minutes, or until al dente, and drain.", "Fill a large bowl with warm water. Dip one wrapper into the hot water for 1 second to soften. Lay wrapper flat. In a row across the center, place 2 shrimp halves, a handful of vermicelli, basil, mint, cilantro and lettuce, leaving about 2 inches uncovered on each side. Fold uncovered sides inward, then tightly roll the wrapper, beginning at the end with the lettuce. Repeat with remaining ingredients.", "In a small bowl, mix the fish sauce, water, lime juice, garlic, sugar and chili sauce.", "In another small bowl, mix the hoisin sauce and peanuts.", "Serve rolled spring rolls with the fish sauce and hoisin sauce mixtures."], "facts": "82 calories; protein 3.3g 7% DV; carbohydrates 15.8g 5% DV; fat 0.7g 1% DV; cholesterol 10.8mg 4% DV; sodium 305.4mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/13107/miso-soup/", "name": "Miso Soup", "summary": "\nDashi is a basic stock used in Japanese cooking which is made by boiling dried kelp (seaweed) and dried bonito (fish). Instant dashi granules are sold in conveniently-sized jars or packets and vary in strength. Add more dashi to your soup if you want a stronger stock. You can use yellow, white or red miso paste for this soup. Yellow miso is sweet and creamy, red miso is stronger and saltier. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F365400.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons dashi granules", "4 cups water", "3 tablespoons miso paste", "1 (8 ounce) package silken tofu, diced", "2  green onions, sliced diagonally into 1/2 inch pieces"], "direction": ["In a medium saucepan over medium-high heat, combine dashi granules and water; bring to a boil. Reduce heat to medium, and whisk in the miso paste. Stir in tofu. Separate the layers of the green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving."], "facts": "63 calories; protein 5.5g 11% DV; carbohydrates 5.3g 2% DV; fat 2.3g 4% DV; cholesterol 0mg; sodium 513.1mg 21% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/142967/easy-garam-masala/", "name": "Easy Garam Masala", "summary": "\nThis is a quick Garam Masala (Indian spice) mix. Garam Masala is better when made with whole spices that have been roasted and ground, but this is a quick and easy substitute that's pretty good. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F399841.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "12"], ["Yield:", "1 /4 cup"]], "ingredients": ["1 tablespoon ground cumin", "1 ½ teaspoons ground coriander", "1 ½ teaspoons ground cardamom", "1 ½ teaspoons ground black pepper", "1 teaspoon ground cinnamon", "½ teaspoon ground cloves", "½ teaspoon ground nutmeg"], "direction": ["Mix cumin, coriander, cardamom, pepper, cinnamon, cloves, and nutmeg in a bowl. Place mix in an airtight container, and store in a cool, dry place."], "facts": "6 calories; protein 0.2g; carbohydrates 1g; fat 0.2g; cholesterol 0mg; sodium 1.3mg."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/", "name": "Quick Beef Stir-Fry", "summary": "\nQuick and easy. I make this on my busiest weeknights. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6263320.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 pound beef sirloin, cut into 2-inch strips", "1 ½ cups fresh broccoli florets", "1  red bell pepper, cut into matchsticks", "2  carrots, thinly sliced", "1  green onion, chopped", "1 teaspoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons sesame seeds, toasted"], "direction": ["Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.", "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes."], "facts": "268 calories; protein 22.6g 45% DV; carbohydrates 9.1g 3% DV; fat 15.8g 24% DV; cholesterol 48.9mg 16% DV; sodium 526.2mg 21% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/257938/spicy-thai-basil-chicken-pad-krapow-gai/", "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)", "summary": "\nMy version of this classic Thai dish has spectacular taste even with regular basil instead of Thai or holy basil. The sauce actually acts like a glaze as the chicken mixture cooks over high heat. The recipe works best if you chop or grind your own chicken and have all ingredients prepped before you start cooking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4507925.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["⅓ cup chicken broth", "1 tablespoon oyster sauce", "1 tablespoon soy sauce, or as needed", "2 teaspoons fish sauce", "1 teaspoon white sugar", "1 teaspoon brown sugar", "2 tablespoons vegetable oil", "1 pound skinless, boneless chicken thighs, coarsely chopped", "¼ cup sliced shallots", "4 cloves garlic, minced", "2 tablespoons minced Thai chilies, Serrano, or other hot pepper", "1 cup very thinly sliced fresh basil leaves", "2 cups hot cooked rice"], "direction": ["Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended.", "Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute.", "Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat.", "Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice."], "facts": "715 calories; protein 49.8g 100% DV; carbohydrates 58.6g 19% DV; fat 30g 46% DV; cholesterol 155.9mg 52% DV; sodium 1181.9mg 47% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/", "name": "The Best Thai Coconut Soup", "summary": "\nAuthentic, bold, and delicious Thai flavors make this soup irresistible! This is the best Thai coconut soup I've had. You won't be disappointed with this one! Serve over steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2319909.jpg", "meta": [["prep:", "35 mins"], ["cook:", "30 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon vegetable oil", "2 tablespoons grated fresh ginger", "1 stalk lemon grass, minced", "2 teaspoons red curry paste", "4 cups chicken broth", "3 tablespoons fish sauce", "1 tablespoon light brown sugar", "3 (13.5 ounce) cans coconut milk", "½ pound fresh shiitake mushrooms, sliced", "1 pound medium shrimp - peeled and deveined", "2 tablespoons fresh lime juice", "salt to taste", "¼ cup chopped fresh cilantro"], "direction": ["Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro."], "facts": "368 calories; protein 13.2g 26% DV; carbohydrates 8.9g 3% DV; fat 32.9g 51% DV; cholesterol 86.3mg 29% DV; sodium 579.4mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/223382/chicken-stir-fry/", "name": "Chicken Stir-Fry", "summary": "\nA quick and easy dish to prepare, this chicken stir-fry is packed with veggies. Try adding bean sprouts, bamboo shoots, snap peas, or any of your favorite vegetables. Serve it with white or brown rice, or noodles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F973101.jpg", "meta": [["prep:", "30 mins"], ["cook:", "35 mins"], ["additional:", "15 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 cups white rice", "4 cups water", "⅔ cup soy sauce", "¼ cup brown sugar", "1 tablespoon cornstarch", "1 tablespoon minced fresh ginger", "1 tablespoon minced garlic", "¼ teaspoon red pepper flakes", "3  skinless, boneless chicken breast halves, thinly sliced", "1 tablespoon sesame oil", "1  green bell pepper, cut into matchsticks", "1 (8 ounce) can sliced water chestnuts, drained", "1 head broccoli, broken into florets", "1 cup sliced carrots", "1  onion, cut into large chunks", "1 tablespoon sesame oil"], "direction": ["Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes.", "Combine soy sauce, brown sugar, and corn starch in a small bowl; stir until smooth. Mix ginger, garlic, and red pepper into sauce; coat chicken with marinade and refrigerate for at least 15 minutes.", "Heat 1 tablespoon sesame oil in a large skillet over medium-high heat. Cook and stir bell pepper, water chestnuts, broccoli, carrots, and onion until just tender, about 5 minutes. Remove vegetables from skillet and keep warm.", "Remove chicken from marinade, reserving liquid. Heat 1 tablespoon sesame oil in skillet over medium-high heat. Cook and stir chicken until slightly pink on the inside, about 2 minutes per side; return vegetables and reserved marinade to skillet. Bring to a boil; cook and stir until chicken is no longer pink in the middle and vegetables are tender, 5 to 7 minutes. Serve over rice."], "facts": "700 calories; protein 67.7g 135% DV; carbohydrates 76.7g 25% DV; fat 12.1g 19% DV; cholesterol 161.4mg 54% DV; sodium 1790.4mg 72% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/72068/chicken-katsu/", "name": "Chicken Katsu", "summary": "\nThis is my family recipe for Chicken Katsu - Japanese style fried chicken. Can also be used to make Tonkatsu, just use pork cutlets instead of chicken. Serve with white rice and tonkatsu sauce. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5816671.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves - pounded to 1/2 inch thickness", "salt and pepper to taste", "2 tablespoons all-purpose flour", "1  egg, beaten", "1 cup panko bread crumbs", "1 cup oil for frying, or as needed"], "direction": ["Season the chicken breasts on both sides with salt and pepper. Place the flour, egg and panko crumbs into separate shallow dishes. Coat the chicken breasts in flour, shaking off any excess. Dip them into the egg, and then press into the panko crumbs until well coated on both sides.", "Heat 1/4 inch of oil in a large skillet over medium-high heat. Place chicken in the hot oil, and cook 3 or 4 minutes per side, or until golden brown."], "facts": "297 calories; protein 31.2g 62% DV; carbohydrates 22.2g 7% DV; fat 11.4g 18% DV; cholesterol 118.4mg 40% DV; sodium 250.7mg 10% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/115965/egg-drop-soup-better-than-restaurant-quality/", "name": "Egg Drop Soup (Better than Restaurant Quality!)", "summary": "\nAfter many many trips to different Chinese restaurants looking for a good bowl of egg drop soup, I decided to take it upon myself to create what I feel is the ultimate in egg drop soup. I hope you enjoy it as much as I do! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F972459.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "1"], ["Yield:", "1 cup"]], "ingredients": ["1 cup chicken broth", "¼ teaspoon soy sauce", "¼ teaspoon sesame oil", "1 teaspoon cornstarch  (Optional)", "2 teaspoons water  (Optional)", "1  egg, beaten", "1 drop yellow food coloring  (Optional)", "1 teaspoon chopped fresh chives", "⅛ teaspoon salt  (Optional)", "½ teaspoon ground white pepper  (Optional)"], "direction": ["In a small saucepan, combine the chicken broth, soy sauce and sesame oil. Bring to a boil. Stir together the cornstarch and water to dissolve cornstarch; pour into the boiling broth. Stir gently while you pour in the egg and yellow food coloring if using. Season with chives, salt and pepper before serving."], "facts": "112 calories; protein 7.5g 15% DV; carbohydrates 4.8g 2% DV; fat 6.7g 10% DV; cholesterol 191mg 64% DV; sodium 1395.7mg 56% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/", "name": "Black Pepper Beef and Cabbage Stir Fry", "summary": "\nA very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8279013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "4 cloves garlic, chopped", "½ pound ground beef", "½ small head cabbage, shredded", "1  red bell pepper, cut into strips", "2 tablespoons soy sauce", "1 teaspoon cornstarch", "½ cup cold water", "1 teaspoon ground black pepper, or to taste", "1 pinch salt, to taste"], "direction": ["Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.", "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened."], "facts": "280 calories; protein 11.6g 23% DV; carbohydrates 9.5g 3% DV; fat 22.1g 34% DV; cholesterol 48.2mg 16% DV; sodium 547.3mg 22% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228443/authentic-pho/", "name": "Authentic Pho", "summary": "\nThis authentic pho isn't quick, but it is delicious. The key is in the broth, which gets simmered for at least 6 hours. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1120315.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 hrs"], ["additional:", "1 hr"], ["total:", "9 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 pounds beef soup bones", "1  onion, unpeeled and cut in half", "5 slices fresh ginger", "1 tablespoon salt", "2 pods star anise", "2 ½ tablespoons fish sauce", "4 quarts water", "1 (8 ounce) package dried rice noodles", "1 ½ pounds beef top sirloin, thinly sliced", "½ cup chopped cilantro", "1 tablespoon chopped green onion", "1 ½ cups bean sprouts", "1 bunch Thai basil", "1  lime, cut into 4 wedges", "¼ cup hoisin sauce  (Optional)", "¼ cup chile-garlic sauce (such as Sriracha®)  (Optional)"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour.", "Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes.", "Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside.", "Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer.", "Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side."], "facts": "509 calories; protein 34.9g 70% DV; carbohydrates 65.6g 21% DV; fat 11g 17% DV; cholesterol 74mg 25% DV; sodium 3519.3mg 141% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/14565/naan/", "name": "Naan", "summary": "\nThis recipe makes the best naan I have tasted outside of an Indian restaurant. I can't make enough of it for my family. I serve it with shish kabobs, but I think they would eat it plain. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1016308.jpg", "meta": [["prep:", "30 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs 23 mins"], ["total:", "3 hrs"], ["Servings:", "14"], ["Yield:", "14 servings"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water", "¼ cup white sugar", "3 tablespoons milk", "1  egg, beaten", "2 teaspoons salt", "4 ½ cups bread flour", "2 teaspoons minced garlic  (Optional)", "¼ cup butter, melted"], "direction": ["In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume.", "Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes.", "During the second rising, preheat grill to high heat.", "At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared."], "facts": "52 calories; protein 0.8g 2% DV; carbohydrates 4.1g 1% DV; fat 3.7g 6% DV; cholesterol 22.3mg 7% DV; sodium 362.7mg 15% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/61024/asian-orange-chicken/", "name": "Asian Orange Chicken", "summary": "\nA delicious citrus chicken recipe with flavors reminiscent of the orange chicken from a popular restaurant in the mall. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3864686.jpg", "meta": [["prep:", "40 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ½ cups water", "2 tablespoons orange juice", "¼ cup lemon juice", "⅓ cup rice vinegar", "2 ½ tablespoons soy sauce", "1 tablespoon grated orange zest", "1 cup packed brown sugar", "½ teaspoon minced fresh ginger root", "½ teaspoon minced garlic", "2 tablespoons chopped green onion", "¼ teaspoon red pepper flakes", "3 tablespoons cornstarch", "2 tablespoons water"], "direction": ["Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes.", "Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours.", "In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat.", "Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil.", "Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally."], "facts": "445 calories; protein 17.8g 36% DV; carbohydrates 68.7g 22% DV; fat 11.2g 17% DV; cholesterol 34.2mg 11% DV; sodium 762.8mg 31% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/268091/easy-korean-ground-beef-bowl/", "name": "Easy Korean Ground Beef Bowl", "summary": "\nKorean beef bowls are quick and easy to make. The ingredients can easily be adjusted to suit your taste. Serve over warm rice or spiralized vegetables. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5759837.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 bowls"]], "ingredients": ["1 pound lean ground beef", "5 cloves garlic, crushed", "1 tablespoon freshly grated ginger", "2 teaspoons toasted sesame oil", "½ cup reduced-sodium soy sauce", "⅓ cup light brown sugar", "¼ teaspoon crushed red pepper", "6  green onions, chopped, divided", "4 cups hot cooked brown rice", "1 tablespoon toasted sesame seeds"], "direction": ["Heat a large skillet over medium-high heat. Add beef and cook, stirring and crumbling into small pieces until browned, 5 to 7 minutes. Drain excess grease.", "Add garlic, ginger, and sesame oil, stirring until fragrant, about 2 minutes. Stir in soy sauce, brown sugar, and red pepper. Cook until some of the sauce absorbs into the beef, about 7 minutes. Add 1/2 of the chopped green onions.", "Serve beef over hot cooked rice; garnished with sesame seeds and remaining green onions."], "facts": "574 calories; protein 28.8g 58% DV; carbohydrates 70.3g 23% DV; fat 19.1g 29% DV; cholesterol 74.3mg 25% DV; sodium 1142.2mg 46% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/47015/quick-and-easy-pancit/", "name": "Quick and Easy Pancit", "summary": "\nQuick, Easy and delicious! Will remind you of Island Fiestas! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5886739.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 Servings"]], "ingredients": ["1 (12 ounce) package dried rice noodles", "1 teaspoon vegetable oil", "1  onion, finely diced", "3 cloves garlic, minced", "2 cups diced cooked chicken breast meat", "1 small head cabbage, thinly sliced", "4  carrot, thinly sliced", "¼ cup soy sauce", "2  lemons - cut into wedges, for garnish"], "direction": ["Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside.", "Heat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons."], "facts": "369 calories; protein 18.1g 36% DV; carbohydrates 65.1g 21% DV; fat 4.9g 8% DV; cholesterol 35mg 12% DV; sodium 788.6mg 32% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/19670/sweet-and-sour-sauce-i/", "name": "Sweet and Sour Sauce I", "summary": "\nAn excellent, traditional sweet and sour sauce. It is great served with meatballs, with tempura, or even over rice! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1029629.jpg", "meta": [["prep:", "2 mins"], ["cook:", "10 mins"], ["total:", "12 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["¾ cup white sugar", "⅓ cup white vinegar", "⅔ cup water", "¼ cup soy sauce", "1 tablespoon ketchup", "2 tablespoons cornstarch"], "direction": ["Place the sugar, vinegar, water, soy sauce, ketchup and cornstarch in a medium saucepan, and bring to a boil. Stir continuously until the mixture has thickened."], "facts": "43 calories; protein 0.3g 1% DV; carbohydrates 10.8g 4% DV; fat 0g; cholesterol 0mg; sodium 236.3mg 10% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/212940/chicken-arroz-caldo-chicken-rice-porridge/", "name": "Chicken Arroz Caldo (Chicken Rice Porridge)", "summary": "\nThis is a soupy dish that is served mainly for a snack. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6512910.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 tablespoons olive oil", "1  onion, diced", "2 cloves garlic, crushed", "1 (2 inch) piece fresh ginger, peeled and thinly sliced", "2 ¼ pounds chicken wings, split and tips discarded", "1 tablespoon fish sauce  (Optional)", "5 ¼ cups chicken broth", "1 cup glutinous sweet rice", "salt and pepper to taste", "1  green onion, chopped", "1  lemon, sliced  (Optional)", "1 teaspoon fish sauce for sprinkling, if desired  (Optional)"], "direction": ["Heat the olive oil in a large pot over medium heat; cook and stir the onion, garlic, and ginger in the hot oil until fragrant, about 5 minutes. Add the chicken wings; cook and stir together for 1 minute. Stir the fish sauce into the pot, cover, and cook another 2 minutes.", "Pour the chicken broth into the pot. Add the sweet rice and stir. Bring the mixture to a boil; cover and cook for 10 minutes, stirring occasionally to assure the rice is not sticking to the bottom of the pot. Season with salt and pepper. Garnish with the green onion, and serve with lemon slices and additional fish sauce, if desired."], "facts": "294 calories; protein 15.5g 31% DV; carbohydrates 24.6g 8% DV; fat 14.9g 23% DV; cholesterol 42.1mg 14% DV; sodium 1586.1mg 63% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/191156/restaurant-style-beef-and-broccoli/", "name": "Restaurant Style Beef and Broccoli", "summary": "\nThis is my go-to recipe when I want Chinese food without having to go out. Very easy and delicious. Substituting chicken for the beef works great too. Serve over rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F516732.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["⅓ cup oyster sauce", "2 teaspoons Asian (toasted) sesame oil", "⅓ cup sherry", "1 teaspoon soy sauce", "1 teaspoon white sugar", "1 teaspoon cornstarch", "¾ pound beef round steak, cut into 1/8-inch thick strips", "3 tablespoons vegetable oil, plus more if needed", "1  thin slice of fresh ginger root", "1 clove garlic, peeled and smashed", "1 pound broccoli, cut into florets"], "direction": ["Whisk together the oyster sauce, sesame oil, sherry, soy sauce, sugar, and cornstarch in a bowl, and stir until the sugar has dissolved. Place the steak pieces into a shallow bowl, pour the oyster sauce mixture over the meat, stir to coat well, and marinate for at least 30 minutes in refrigerator.", "Heat vegetable oil in a wok or large skillet over medium-high heat, and stir in the ginger and garlic. Let them sizzle in the hot oil for about 1 minute to flavor the oil, then remove and discard. Stir in the broccoli, and toss and stir in the hot oil until bright green and almost tender, 5 to 7 minutes. Remove the broccoli from the wok, and set aside.", "Pour a little more oil into the wok, if needed, and stir and toss the beef with the marinade until the sauce forms a glaze on the beef, and the meat is no longer pink, about 5 minutes. Return the cooked broccoli to the wok, and stir until the meat and broccoli are heated through, about 3 minutes."], "facts": "331 calories; protein 21.7g 43% DV; carbohydrates 13.3g 4% DV; fat 21.1g 33% DV; cholesterol 51.9mg 17% DV; sodium 419.2mg 17% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/9027/kung-pao-chicken/", "name": "Kung Pao Chicken", "summary": "\nSpicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F290890.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound skinless, boneless chicken breast halves - cut into chunks", "2 tablespoons white wine", "2 tablespoons soy sauce", "2 tablespoons sesame oil, divided", "2 tablespoons cornstarch, dissolved in 2 tablespoons water", "1 ounce hot chile paste", "1 teaspoon distilled white vinegar", "2 teaspoons brown sugar", "4  green onions, chopped", "1 tablespoon chopped garlic", "1 (8 ounce) can water chestnuts", "4 ounces chopped peanuts"], "direction": ["To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes.", "To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic.", "Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens."], "facts": "437 calories; protein 34.4g 69% DV; carbohydrates 25.3g 8% DV; fat 23.3g 36% DV; cholesterol 65.9mg 22% DV; sodium 595.6mg 24% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/31144/sweet-and-sour-pork-iii/", "name": "Sweet and Sour Pork III", "summary": "\nMy husband's grandmother was Chinese. She taught me this one. This is the way Gramma made Sweet and Sour all her life (she died 6 years ago at age 94). The secret is apple cider vinegar. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F265130.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound pork butt, cut into 1 inch cubes", "1 teaspoon salt", "¼ teaspoon white sugar", "1 teaspoon soy sauce", "1  egg white", "2  green onions, chopped", "1 quart vegetable oil for frying", "½ cup cornstarch", "1 tablespoon vegetable oil", "3 stalks celery, cut into 1/2 inch pieces", "1 medium green bell pepper, cut into 1 inch pieces", "1  medium onion, cut into wedges", "white sugar to taste", "salt to taste", "1 cup water", "¼ teaspoon salt", "¾ cup white sugar", "⅓ cup apple cider vinegar", "¼ cup ketchup", "½ teaspoon soy sauce", "1 (8 ounce) can pineapple chunks, undrained", "2 tablespoons cornstarch", "¼ cup water"], "direction": ["Place cubed pork in a medium bowl, and season with 1 teaspoon salt, 1/4 teaspoon sugar, and 1 teaspoon soy sauce. Mix in the egg white and green onions. Cover, and place in the refrigerator at least 1 hour.", "Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer.", "Coat the pork with 1/2 cup cornstarch, and fry in the heated oil about 10 minutes, until evenly browned. Drain on paper towels.", "Heat 1 tablespoon oil in a wok over medium heat. Stir in the celery, green bell pepper, and onion, and cook until tender. Season with salt and sugar. Remove from heat, and set aside.", "In a large saucepan, mix 1 cup water, 1/4 teaspoon salt, 3/4 cup sugar, apple cider vinegar, ketchup, and 1/2 teaspoon soy sauce. Bring to a boil, and stir in the cooked pork, celery mixture, and the pineapple chunks with juice. Return to boil, and mix in 2 tablespoons cornstarch and 1/4 cup water to thicken. Cook until well blended."], "facts": "663 calories; protein 13.9g 28% DV; carbohydrates 74.7g 24% DV; fat 35g 54% DV; cholesterol 42.6mg 14% DV; sodium 1085.4mg 43% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/193307/easy-mochi/", "name": "Easy Mochi", "summary": "\nA lovely Chinese New Year's snack; soft, slightly sweet, and chewy, this is a wonderful traditional dessert. Ready in only minutes. Serve with steaming hot tea! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6894718.jpg", "meta": [["prep:", "30 mins"], ["cook:", "5 mins"], ["additional:", "3 hrs"], ["total:", "3 hrs 35 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 cup sweetened red bean paste", "1 cup sweet rice flour (mochiko)", "1 teaspoon green tea powder (matcha)", "1 cup water", "¼ cup white sugar", "½ cup cornstarch, for rolling out the dough"], "direction": ["Wrap red bean paste in aluminum foil and place in the freezer for at least 3 hours. Mix sweet rice flour and green tea powder thoroughly in a microwave-safe glass or ceramic bowl. Stir in water, then sugar. Mix until smooth. Cover bowl with plastic wrap.", "Cook the rice flour mixture in the microwave for 3 minutes and 30 seconds. Meanwhile, remove red bean paste from the freezer and divide paste into 8 equal balls. Set aside. Stir rice flour mixture and heat for another 15 to 30 seconds.", "Dust work surface with cornstarch. While the mochi is still hot from the microwave, begin rolling balls the size of about 2 tablespoons. Flatten the mochi ball and place 1 frozen red bean paste ball in the center. Pinch the mochi over the red bean paste until the paste is completely covered. Sprinkle with additional cornstarch and place mochi seam side down in a paper muffin liner to prevent sticking. Repeat until all the mochi and red bean paste is used."], "facts": "213 calories; protein 2.8g 6% DV; carbohydrates 49.8g 16% DV; fat 0.2g; cholesterol 0mg; sodium 82.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/16641/red-lentil-curry/", "name": "Red Lentil Curry", "summary": "\nThis is a rich and hearty lentil curry, great as a main meal rather than as a side dish like the more traditional Indian dhal. Don't let the ingredient list faze you, this really is an easy dish to make. This dish is great served with basmati rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8133071.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups red lentils", "1 large onion, diced", "1 tablespoon vegetable oil", "2 tablespoons curry paste", "1 tablespoon curry powder", "1 teaspoon ground turmeric", "1 teaspoon ground cumin", "1 teaspoon chili powder", "1 teaspoon salt", "1 teaspoon white sugar", "1 teaspoon minced garlic", "1 teaspoon minced fresh ginger", "1 (14.25 ounce) can tomato puree"], "direction": ["Wash the lentils in cold water until the water runs clear. Put lentils in a pot with enough water to cover; bring to a boil, place a cover on the pot, reduce heat to medium-low, and simmer, adding water during cooking as needed to keep covered, until tender, 15 to 20 minutes. Drain.", "Heat vegetable oil in a large skillet over medium heat; cook and stir onions in hot oil until caramelized, about 20 minutes.", "Mix curry paste, curry powder, turmeric, cumin, chili powder, salt, sugar, garlic, and ginger together in a large bowl; stir into the onions. Increase heat to high and cook, stirring constantly, until fragrant, 1 to 2 minutes.", "Stir in the tomato puree, remove from heat and stir into the lentils."], "facts": "192 calories; protein 12.1g 24% DV; carbohydrates 32.5g 11% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 571.9mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/141169/easy-indian-butter-chicken/", "name": "Easy Indian Butter Chicken", "summary": "\nThis is a recipe I have perfected over the years and passed onto many others.  The sauce is perfect when creamy and not too thick or too thin.  The level of salt and spices can be suited to your taste.  Garam and tandoori masala can be found in the ethnic aisle of your grocery store. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2180712.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup butter, divided", "1  onion, minced", "1 tablespoon minced garlic", "1 (15 ounce) can tomato sauce", "3 cups heavy cream", "2 teaspoons salt", "1 teaspoon cayenne pepper", "1 teaspoon garam masala", "1 ½ pounds skinless, boneless chicken breast, cut into bite-sized chunks", "2 tablespoons vegetable oil", "2 tablespoons tandoori masala"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "Melt a few tablespoons of butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes.", "Meanwhile melt the remaining butter in a saucepan over medium-high heat along with the tomato sauce, heavy cream, salt, cayenne pepper, and garam masala. Bring to a simmer, then reduce heat to medium-low; cover, and simmer for 30 minutes, stirring occasionally. Then stir in caramelized onions.", "While the sauce is simmering, toss cubed chicken breast with vegetable oil until coated, then season with tandoori masala and spread out onto a baking sheet.", "Bake chicken in preheated oven until no longer pink in the center, about 12 minutes. Once done, add the chicken to the sauce and simmer for 5 minutes before serving."], "facts": "880 calories; protein 26.4g 53% DV; carbohydrates 12.8g 4% DV; fat 82.3g 127% DV; cholesterol 302.9mg 101% DV; sodium 1461mg 58% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/46822/indian-chicken-curry-ii/", "name": "Indian Chicken Curry II", "summary": "\nThis is an adaptation of yellow chicken curry from India. The aromas and flavors are a delight to the senses! It is best served with fresh Naan bread and Jasmine or Basmati rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1053643.jpg", "meta": [["prep:", "20 mins"], ["cook:", "25 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 to 6 servings"]], "ingredients": ["3 tablespoons olive oil", "1 small onion, chopped", "2 cloves garlic, minced", "3 tablespoons curry powder", "1 teaspoon ground cinnamon", "1 teaspoon paprika", "1  bay leaf", "½ teaspoon grated fresh ginger root", "½ teaspoon white sugar", "salt to taste", "2  skinless, boneless chicken breast halves - cut into bite-size pieces", "1 tablespoon tomato paste", "1 cup plain yogurt", "¾ cup coconut milk", "½  lemon, juiced", "½ teaspoon cayenne pepper"], "direction": ["Heat olive oil in a skillet over medium heat. Saute onion until lightly browned. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar and salt. Continue stirring for 2 minutes. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes.", "Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes."], "facts": "313 calories; protein 19.1g 38% DV; carbohydrates 14g 5% DV; fat 21.7g 33% DV; cholesterol 37.9mg 13% DV; sodium 268.3mg 11% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/189477/california-roll-sushi/", "name": "California Roll Sushi", "summary": "\nCalifornia Roll - it's really good. Serve with soy sauce and wasabi. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4564632.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 rolls"]], "ingredients": ["1 cup uncooked short-grain white rice", "1 cup water", "¼ cup rice vinegar", "1 tablespoon white sugar", "½ cup imitation crabmeat, finely chopped", "¼ cup mayonnaise", "8 sheets nori (dry seaweed)", "2 ½ tablespoons sesame seeds", "1  cucumber, cut into thin spears", "2  avocados - pitted, peeled, and sliced the long way"], "direction": ["Wash the rice in several changes of water until the rinse water is no longer cloudy, drain well, and place in a covered pan or rice cooker with 1 cup water. Bring to a boil, reduce heat to a simmer, and cover the pan. Allow the rice to simmer until the top looks dry, about 15 minutes. Turn off the heat, and let stand for 10 minutes to absorb the rest of the water.", "Mix the rice vinegar and sugar in a small bowl until the sugar has dissolved, and stir the mixture into the cooked rice until well combined. Allow the rice to cool, and set aside.", "Mix the imitation crabmeat with mayonnaise in a bowl, and set aside. To roll the sushi, cover a bamboo rolling mat with plastic wrap. Lay a sheet of nori, shiny side down, on the plastic wrap. With wet fingers, firmly pat a thin, even layer of prepared rice over the nori, leaving 1/4 inch uncovered at the bottom edge of the sheet. Sprinkle the rice with about 1/2 teaspoon of sesame seeds, and gently press them into the rice. Carefully flip the nori sheet over so the seaweed side is up.", "Place 2 or 3 long cucumber spears, 2 or 3 slices of avocado, and about 1 tablespoon of imitation crab mixture in a line across the nori sheet, about 1/4 from the uncovered edge. Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a cylinder about 1 1/2 inch in diameter. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly.", "Cut each roll into 1 inch pieces with a very sharp knife dipped in water."], "facts": "232 calories; protein 3.9g 8% DV; carbohydrates 23.7g 8% DV; fat 14.4g 22% DV; cholesterol 4.7mg 2% DV; sodium 135mg 5% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/246250/kima/", "name": "Kima", "summary": "\nThis was a family-favorite as I was growing up. It's fast and easy. Serve on a bed of rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3349573.jpg", "meta": [["prep:", "10 mins"], ["cook:", "28 mins"], ["total:", "38 mins"], ["Servings:", "4"], ["Yield:", "1 /2-cup servings"]], "ingredients": ["3 tablespoons butter", "1 cup chopped onion", "1 clove garlic, minced", "1 pound ground beef", "2  tomatoes, chopped", "1 cup frozen peas", "1 tablespoon Masala curry powder", "1 ½ teaspoons salt", "1 teaspoon paprika", "½ teaspoon chili powder", "1 dash ground black pepper", "¼ cup flaked coconut, or to taste"], "direction": ["Melt butter in a skillet over medium heat. stir in onion and garlic; cook until onion is translucent, 3 to 5 minutes.", "Stir beef into onion mixture; cook until crumbly and no longer pink, 5 to 10 minutes. Drain excess fat from beef mixture.", "Stir tomatoes, peas, curry powder, salt, paprika, chili powder, and black pepper into beef mixture; cook until thickened, about 20 minutes. Garnish with coconut."], "facts": "420 calories; protein 22.6g 45% DV; carbohydrates 14.5g 5% DV; fat 30.7g 47% DV; cholesterol 92.5mg 31% DV; sodium 1052.9mg 42% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/245993/soba-noodle-salad-with-chicken-and-sesame/", "name": "Soba Noodle Salad with Chicken and Sesame", "summary": "\nThis tasty salad with Japanese buckwheat noodles is both quick and healthy; great for lunch or dinner. Most larger supermarkets have buckwheat soba noodles in the Asian food section. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3332559.jpg", "meta": [["prep:", "20 mins"], ["cook:", "7 mins"], ["total:", "27 mins"], ["Servings:", "3"], ["Yield:", "3 cups"]], "ingredients": ["2 tablespoons rice vinegar", "1 tablespoon vegetable oil", "1 tablespoon sesame oil", "1 tablespoon brown sugar", "1 tablespoon soy sauce", "2 teaspoons minced fresh ginger root", "4 ounces buckwheat soba noodles", "2 teaspoons vegetable oil", "1  boneless skinless chicken breast, cut into thin bite-size strips", "1 teaspoon chopped garlic", "salt and ground black pepper to taste", "1 rib celery, sliced  (Optional)", "1  carrot, sliced", "½  red bell pepper, chopped", "¼ cup chopped fresh cilantro", "2 tablespoons chopped green onion", "1 tablespoon sesame seeds"], "direction": ["Whisk rice vinegar, 1 tablespoon vegetable oil, sesame oil, brown sugar, soy sauce, and ginger together in a large bowl until dressing is combined.", "Bring water to a boil in a large pot. Add soba noodles, stir, and return water to a boil. Boil noodles until tender, 4 to 5 minutes. Drain noodles in a colander under cold running water until cool, about 1 minute.", "Heat 2 teaspoons vegetable oil in a skillet over medium heat. Cook chicken breast pieces until no longer pink in the center and the juices run clear, 2 to 4 minutes. Add garlic, salt, and pepper; stir until fragrant, about 1 minute more.", "Toss soba noodles, chicken, celery, carrot, red pepper, cilantro, green onion, and sesame seeds together with dressing in large bowl."], "facts": "340 calories; protein 15.5g 31% DV; carbohydrates 38.3g 12% DV; fat 15.2g 23% DV; cholesterol 23.1mg 8% DV; sodium 704.2mg 28% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/241806/spicy-baked-tofu/", "name": "Spicy Baked Tofu", "summary": "\nThis healthy, protein-packed tofu dish is filled with flavor. This is a spicy dish. I don't find it overly spicy but I like heat in my faux-meat! I served this with wilted garlic spinach and a fresh salad on the side. Remember that tofu is a concentrated protein, so you don't need as much tofu as you would meat. This dish is great reheated! If you want to be really creative, try grilling your tofu for an even more delicious result! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2258469.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["additional:", "1 hr 5 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  serving cooking spray", "1 (12 ounce) package tofu", "2 tablespoons Japanese low-sodium soy sauce", "2 tablespoons Asian chili sauce", "2 tablespoons minced fresh ginger root", "1 ½ tablespoons hoisin sauce"], "direction": ["Lay the tofu on a plate lined with a couple sheets of paper towel. Layer more paper towel atop tofu and place another plate atop the stack to press water from the tofu. Let sit at least 5 minutes.", "Cut tofu into 1/2-inch strips and put into a large, sealable plastic bag; add soy sauce, chili sauce, ginger, and hoisin sauce. Squeeze bag to remove excess air and seal. Marinate tofu in the refrigerator for at least 1 hour.", "Preheat oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.", "Remove tofu from the marinade, shake to remove excess moisture, and arrange onto the prepared baking sheet. Discard the remaining marinade.", "Bake in preheated oven for 15 minutes, flip, and continue baking until firm, 15 to 20 minutes more."], "facts": "88 calories; protein 7.4g 15% DV; carbohydrates 6.1g 2% DV; fat 4.3g 7% DV; cholesterol 0.2mg; sodium 686.2mg 27% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/239818/iranian-persian-salad-shirazi/", "name": "Iranian / Persian Salad Shirazi", "summary": "\nAn excellent light side salad to accompany a heavy Persian meal or any meal really. Sumac is the red bitter spice usually served for sprinkling on kebab. It's available at most Middle Eastern stores, but if you can't find it just leave it out. I like to dice the veggies very small about 1/4-inch. Serve with fresh lemon wedges. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2282013.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  ripe tomatoes, seeded and diced", "1  red onion, diced", "2 small English cucumbers, peeled and diced", "3 tablespoons olive oil", "lemon, juiced", "1 tablespoon dried mint", "1 teaspoon dried dill", "1 teaspoon ground sumac", "salt and ground black pepper to taste"], "direction": ["Mix tomatoes, red onion, cucumbers, olive oil, lemon juice, mint, dill, sumac, salt, and pepper together in a bowl."], "facts": "145 calories; protein 2.6g 5% DV; carbohydrates 13.8g 5% DV; fat 10.7g 17% DV; cholesterol 0mg; sodium 51.9mg 2% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/238977/lamb-korma/", "name": "Lamb Korma", "summary": "\nOriginated in Persia, brought to India during Akbar period, and modified in Kashmir. \nThe recipe varies from region to region and restaurant to restaurant. North Indian Korma is pale yellow in color from saffron and cooked without any tomatoes or turmeric. This recipe version will be the closest to the traditional Kashmiri Korma. Kashmir Pandits substitute onion and garlic with asafoetida. Serve with jasmine rice and mango chutney. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4469168.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 ¼ pounds cubed lamb meat", "4 teaspoons olive oil, divided", "1  brown onion, chopped", "1  red potato, peeled and cubed", "½ cup curry powder", "½ cup water", "⅓ cup coconut milk", "⅓ cup drained canned chickpeas (garbanzo beans)"], "direction": ["Place lamb in a bowl and drizzle 2 teaspoons olive oil over lamb; stir until coated.", "Heat remaining 2 teaspoons olive oil in a saucepan over low heat; cook and stir onion until softened, 10 to 15 minutes. Remove saucepan from heat and add potato to onion.", "Heat a large skillet over medium heat; cook and stir lamb, working in small batches, until browned, about 5 minutes per batch. Transfer browned lamb to onion mixture.", "Stir curry into lamb-onion mixture and cook over medium heat for 1 minute. Add water to lamb-onion mixture and bring to a boil. Reduce heat to low, cover saucepan, and simmer until lamb is cooked through and potatoes are tender, about 45 minutes.", "Mix coconut milk and chickpeas into lamb-onion mixture and simmer until heated through, about 5 minutes."], "facts": "302 calories; protein 28.1g 56% DV; carbohydrates 17.4g 6% DV; fat 13.8g 21% DV; cholesterol 80.3mg 27% DV; sodium 102.2mg 4% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/230330/nuoc-cham-vietnamese-spicy-dipping-sauce/", "name": "Nuoc Cham (Vietnamese Spicy Dipping Sauce)", "summary": "\nThis sauce can be used for dipping veggies, meats, or egg rolls. It's also great spooned over a bowl of steaming hot pho or other rice noodle soup. For me this sauce IS the flavor of Vietnamese cooking. Enjoy! This can be stored in the fridge for up to two weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3913338.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["3 ½ fluid ounces water", "6  spicy red chile peppers, seeded and minced", "6 cloves garlic, minced", "¼ cup fish sauce", "¼ cup rice vinegar", "¼ cup white sugar", "¼ cup lemon juice"], "direction": ["Stir water, chile peppers, garlic, fish sauce, rice vinegar, and sugar together in a saucepan over medium-low heat until sugar dissolves into the liquid; remove from heat and set aside to cool completely, about 1 hour.", "Stir lemon juice into the cooled liquid."], "facts": "36 calories; protein 0.9g 2% DV; carbohydrates 8.7g 3% DV; fat 0.1g; cholesterol 0mg; sodium 440.8mg 18% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228240/bibimbap-korean-rice-with-mixed-vegetables/", "name": "Bibimbap (Korean Rice With Mixed Vegetables)", "summary": "\nAlong with kimchi, bibimbap takes its place among the favored foods in Korean cuisine. Literally meaning 'mixed rice,' it's a popular meal consisting of white rice topped with vegetables, beef, a whole egg, and gochujang (red chili pepper paste). For those who cannot handle the spiciness (like our children), you can substitute with soy sauce or Sriracha (rooster sauce) in place of it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3961066.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  English cucumber, cut into matchsticks", "¼ cup gochujang (Korean hot pepper paste)  (Optional)", "1 bunch fresh spinach, cut into thin strips", "1 tablespoon soy sauce", "1 teaspoon olive oil", "2  carrots, cut into matchsticks", "1 clove garlic, minced", "1 pinch red pepper flakes", "1 pound thinly-sliced beef top round steak", "1 teaspoon olive oil", "4  large eggs", "4 cups cooked white rice", "4 teaspoons toasted sesame oil, divided", "1 teaspoon sesame seeds", "2 teaspoons gochujang (Korean hot pepper paste), divided  (Optional)"], "direction": ["Stir cucumber pieces with 1/4 cup gochujang paste in a bowl; set aside.", "Bring about 2 cups of water to a boil in a large nonstick skillet and stir in spinach; cook until spinach is bright green and wilted, 2 to 3 minutes. Drain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir soy sauce into spinach.", "Heat 1 teaspoon olive oil in large nonstick skillet and cook and stir carrots until softened, about 3 minutes; stir in garlic and cook just until fragrant, about 1 more minute. Stir in cucumber pieces with gochujang paste; sprinkle with red pepper flakes, and set the mixture aside in a bowl.", "Brown beef in a clean nonstick skillet over medium heat, about 5 minutes per side, and set aside. In a separate nonstick skillet, heat 1 more teaspoon olive oil over medium-low heat and fry the eggs just on one side until yolks are runny but whites are firm, 2 to 4 minutes each.", "To assemble the dish, divide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon of sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired."], "facts": "569 calories; protein 34.9g 70% DV; carbohydrates 63g 20% DV; fat 19.3g 30% DV; cholesterol 242.9mg 81% DV; sodium 573.9mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/79543/fried-rice-restaurant-style/", "name": "Fried Rice Restaurant Style", "summary": "\nA quick fried rice like you get at your favorite Chinese restaurant. A couple of eggs, baby carrots, peas and soy sauce is all you need. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3770230.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups enriched white rice", "4 cups water", "⅔ cup chopped baby carrots", "½ cup frozen green peas", "2 tablespoons vegetable oil", "2  eggs", "soy sauce to taste", "2 tablespoons sesame oil, to taste"], "direction": ["In a saucepan, combine rice and water. Bring to a boil. Reduce heat, cover, and simmer for 20 minutes.", "In a small saucepan, boil carrots in water about 3 to 5 minutes. Drop peas into boiling water, and drain.", "Heat wok over high heat. Pour in oil, then stir in carrots and peas; cook about 30 seconds. Crack in eggs, stirring quickly to scramble eggs with vegetables. Stir in cooked rice. Shake in soy sauce, and toss rice to coat. Drizzle with sesame oil, and toss again."], "facts": "261 calories; protein 5.8g 12% DV; carbohydrates 39.7g 13% DV; fat 8.4g 13% DV; cholesterol 46.5mg 16% DV; sodium 380.9mg 15% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/259887/simple-teriyaki-sauce/", "name": "Simple Teriyaki Sauce", "summary": "\nThis simple but amazing teriyaki sauce will take your chicken and rice to the next level! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4553894.jpg", "meta": [["prep:", "5 mins"], ["cook:", "6 mins"], ["total:", "11 mins"], ["Servings:", "12"], ["Yield:", "cups"]], "ingredients": ["1 cup water", "¼ cup soy sauce", "5 teaspoons packed brown sugar", "1 tablespoon honey, or more to taste", "½ teaspoon ground ginger", "¼ teaspoon garlic powder", "2 tablespoons cornstarch", "¼ cup cold water"], "direction": ["Combine 1 cup water, soy sauce, brown sugar, honey, ginger, and garlic powder in a saucepan over medium heat. Cook until nearly heated through, about 1 minute.", "Mix cornstarch and 1/4 cold water together in a cup; stir until dissolved. Add to the saucepan. Cook and stir sauce until thickened, 5 to 7 minutes."], "facts": "21 calories; protein 0.4g 1% DV; carbohydrates 5g 2% DV; fat 0g; cholesterol 0mg; sodium 302.1mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/99211/perfect-sushi-rice/", "name": "Perfect Sushi Rice", "summary": "\nHere is my recipe for the perfect sushi rice. You can eat this alone or roll into your favorite sushi roll with ingredients of choice. I use strips of carrots, cucumbers and slices of avocado. You can adjust the amount of vinegar in this recipe to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5646437.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "15"], ["Yield:", "5 cups"]], "ingredients": ["2 cups uncooked glutinous white rice (sushi rice)", "3 cups water", "½ cup rice vinegar", "1 tablespoon vegetable oil", "¼ cup white sugar", "1 teaspoon salt"], "direction": ["Rinse the rice in a strainer or colander until the water runs clear. Combine with water in a medium saucepan. Bring to a boil, then reduce the heat to low, cover and cook for 20 minutes. Rice should be tender and water should be absorbed. Cool until cool enough to handle.", "In a small saucepan, combine the rice vinegar, oil, sugar and salt. Cook over medium heat until the sugar dissolves. Cool, then stir into the cooked rice. When you pour this in to the rice it will seem very wet. Keep stirring and the rice will dry as it cools."], "facts": "112 calories; protein 1.7g 3% DV; carbohydrates 23.5g 8% DV; fat 1g 2% DV; cholesterol 0mg; sodium 158.2mg 6% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/212721/indian-chicken-curry-murgh-kari/", "name": "Indian Chicken Curry (Murgh Kari)", "summary": "\nThis is a really good recipe for spicy Indian chicken curry. It's pretty easy to make and tastes really good! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465974.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 pounds skinless, boneless chicken breast halves", "2 teaspoons salt", "½ cup cooking oil", "1 ½ cups chopped onion", "1 tablespoon minced garlic", "1 ½ teaspoons minced fresh ginger root", "1 tablespoon curry powder", "1 teaspoon ground cumin", "1 teaspoon ground turmeric", "1 teaspoon ground coriander", "1 teaspoon cayenne pepper", "1 tablespoon water", "1 (15 ounce) can crushed tomatoes", "1 cup plain yogurt", "1 tablespoon chopped fresh cilantro", "1 teaspoon salt", "½ cup water", "1 teaspoon garam masala", "1 tablespoon chopped fresh cilantro", "1 tablespoon fresh lemon juice"], "direction": ["Sprinkle the chicken breasts with 2 teaspoons salt.", "Heat the oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned. Transfer the browned chicken breasts to a plate and set aside.", "Reduce the heat under the skillet to medium-high; add the onion, garlic, and ginger to the oil remaining in the skillet and cook and stir until the onion turns translucent, about 8 minutes. Stir the curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. Mix the tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt into the mixture. Return the chicken breast to the skillet along with any juices on the plate. Pour 1/2 cup water into the mixture; bring to a boil, turning the chicken to coat with the sauce. Sprinkle the garam masala and 1 tablespoon cilantro over the chicken.", "Cover the skillet and simmer until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).  Sprinkle with lemon juice to serve."], "facts": "427 calories; protein 38.1g 76% DV; carbohydrates 14.7g 5% DV; fat 24.3g 37% DV; cholesterol 94.7mg 32% DV; sodium 1370.4mg 55% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/35151/traditional-filipino-lumpia/", "name": "Traditional Filipino Lumpia", "summary": "\nThis is a traditional Filipino dish. It is the Filipino version of the egg rolls. It can be served as a side dish or as an appetizer. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6244851.jpg", "meta": [["prep:", "45 mins"], ["cook:", "25 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "15"], ["Yield:", "30 lumpia"]], "ingredients": ["1 tablespoon vegetable oil", "1 pound ground pork", "2 cloves garlic, crushed", "½ cup chopped onion", "½ cup minced carrots", "½ cup chopped green onions", "½ cup thinly sliced green cabbage", "1 teaspoon ground black pepper", "1 teaspoon salt", "1 teaspoon garlic powder", "1 teaspoon soy sauce", "30  lumpia wrappers", "2 cups vegetable oil for frying"], "direction": ["Place a wok or large skillet over high heat, and pour in 1 tablespoon vegetable oil. Cook pork, stirring frequently, until no pink is showing. Remove pork from pan and set aside. Drain grease from pan, leaving a thin coating. Cook garlic and onion in the same pan for 2 minutes. Stir in the cooked pork, carrots, green onions, and cabbage. Season with pepper, salt, garlic powder, and soy sauce. Remove from heat, and set aside until cool enough to handle.", "Place three heaping tablespoons of the filling diagonally near one corner of each wrapper, leaving a 1 1/2 inch space at both ends. Fold the side along the length of the filling over the filling, tuck in both ends, and roll neatly. Keep the roll tight as you assemble. Moisten the other side of the wrapper with water to seal the edge. Cover the rolls with plastic wrap to retain moisture.", "Heat a heavy skillet over medium heat, add oil to 1/2 inch depth, and heat for 5 minutes. Slide 3 or 4 lumpia into the oil. Fry the rolls for 1 to 2 minutes, until all sides are golden brown. Drain on paper towels. Serve immediately."], "facts": "168 calories; protein 7g 14% DV; carbohydrates 11g 4% DV; fat 10.5g 16% DV; cholesterol 23.2mg 8% DV; sodium 287.8mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/100606/beef-bulgogi/", "name": "Beef Bulgogi", "summary": "\nJust like my Korean mom makes it!  It's delicious! Even better if rolled up in red leaf lettuce with rice and hot pepper paste. If you want to spice it up just add red pepper powder to your marinade. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1254483.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound flank steak, thinly sliced", "5 tablespoons soy sauce", "2 ½ tablespoons white sugar", "¼ cup chopped green onion", "2 tablespoons minced garlic", "2 tablespoons sesame seeds", "2 tablespoons sesame oil", "½ teaspoon ground black pepper"], "direction": ["Place the beef in a shallow dish.  Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl.  Pour over beef.  Cover and refrigerate for at least 1 hour or overnight.", "Preheat an outdoor grill for high heat, and lightly oil the grate.", "Quickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side."], "facts": "232 calories; protein 16.2g 33% DV; carbohydrates 12.4g 4% DV; fat 13.2g 20% DV; cholesterol 27.2mg 9% DV; sodium 1157.4mg 46% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/232681/char-siu-chinese-bbq-pork/", "name": "Char Siu (Chinese BBQ Pork)", "summary": "\n\"Char siu\" literally means \"fork roast\" - \"char\" being \"fork\" (both noun and verb) and \"siu\" being \"roast\" - after the traditional cooking method for the dish: long strips of seasoned boneless pork are skewered with long forks and placed in a covered oven or over a fire. This is best cooked over charcoal, but it's important to cook with indirect heat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060446.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 25 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2  pork tenderloins", "½ cup soy sauce", "⅓ cup honey", "⅓ cup ketchup", "⅓ cup brown sugar", "¼ cup Chinese rice wine", "2 tablespoons hoisin sauce", "½ teaspoon red food coloring  (Optional)", "1 teaspoon Chinese five-spice powder  (Optional)"], "direction": ["Cut pork with the grain into strips 1 1/2- to 2-inches long; put into a large resealable plastic bag.", "Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red food coloring or red bean curd (see Cook's Note), and Chinese five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes. Pour the marinade into the bag with the pork, squeeze air from the bag, and seal. Turn bag a few times to coat all pork pieces in marinade.", "Marinate pork in refrigerator, 2 hours to overnight.", "Preheat an outdoor grill for medium-high heat and lightly oil the grate.", "Remove pork from marinade and shake to remove excess liquid. Discard remaining marinade.", "Cook pork on preheated grill for 20 minutes. Put a small container of water onto the grill and continue cooking, turning the pork regularly, until cooked through, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."], "facts": "483 calories; protein 43.8g 88% DV; carbohydrates 53.5g 17% DV; fat 8.9g 14% DV; cholesterol 126.7mg 42% DV; sodium 2249.8mg 90% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/56059/asian-coconut-rice/", "name": "Asian Coconut Rice", "summary": "\nI tried so many different ways to duplicate my favorite restaurant's coconut rice after they went out of business. This one is perfect! Garnish with toasted coconut and chopped cilantro if you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2232157.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (14 ounce) can coconut milk", "1 ¼ cups water", "1 teaspoon sugar", "1 pinch salt", "1 ½ cups uncooked jasmine rice"], "direction": ["In a saucepan, combine coconut milk, water, sugar, and salt. Stir until sugar is dissolved. Stir in rice. Bring to a boil over medium heat. Cover, reduce heat, and simmer 18 to 20 minutes, until rice is tender."], "facts": "453 calories; protein 6.8g 14% DV; carbohydrates 61.4g 20% DV; fat 20.9g 32% DV; cholesterol 0mg; sodium 53.7mg 2% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/71722/asian-lettuce-wraps/", "name": "Asian Lettuce Wraps", "summary": "\nDelicious and bursting with flavor, Asian lettuce wraps are a great idea for entertaining or a family style meal. Each person can build their own fresh, delicious wrap. Just be sure to have plates or napkins available since the mixture can sometimes drip a little. To serve, allow each person to spoon a portion of the meat into a lettuce leaf. Wrap the lettuce around the meat like a burrito and enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2630776.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["16  Boston Bibb or butter lettuce leaves", "1 pound lean ground beef", "1 tablespoon cooking oil", "1 large onion, chopped", "¼ cup hoisin sauce", "2 cloves fresh garlic, minced", "1 tablespoon soy sauce", "1 tablespoon rice wine vinegar", "2 teaspoons minced pickled ginger", "1 dash Asian chile pepper sauce, or to taste  (Optional)", "1 (8 ounce) can water chestnuts, drained and finely chopped", "1 bunch green onions, chopped", "2 teaspoons Asian (dark) sesame oil"], "direction": ["Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside.", "Heat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes.", "Arrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center."], "facts": "388 calories; protein 23.4g 47% DV; carbohydrates 24.3g 8% DV; fat 22.3g 34% DV; cholesterol 68.9mg 23% DV; sodium 579.6mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/14704/best-egg-rolls/", "name": "Best Egg Rolls", "summary": "\nThese are fabulous as a side dish with stir-fry dishes. Serve warm with egg roll sauce or soy sauce if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5174296.jpg", "meta": [["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground pork", "1 teaspoon ground ginger", "1 teaspoon garlic powder", "1 quart peanut oil for frying", "2 tablespoons all-purpose flour", "2 tablespoons water", "2 cups shredded cabbage", "2 ounces shredded carrots", "8 (7 inch square) egg roll wrappers", "2 tablespoons sesame seeds  (Optional)"], "direction": ["Season pork with ginger and garlic powder and mix thoroughly. Heat mixture in a medium skillet, stirring, until pork is cooked through and no longer pink. Set aside.", "In another large skillet heat oil to about 375 degrees F (190 degrees C) or medium high heat. While oil is heating, combine flour and water in a bowl until they form a paste. In a separate bowl combine the cabbage, carrots and reserved pork mixture. Mix all together.", "Lay out one egg roll skin with a corner pointed toward you. Place  about a 1/4 to 1/3 cup of the cabbage, carrot and pork mixture on  egg roll paper and fold corner up over the mixture. Fold left and right corners toward the center and continue to roll. Brush a bit of the flour paste on the final corner to help seal the egg roll.", "Place egg rolls into heated oil and fry, turning occasionally, until golden brown. Remove from oil and drain on paper towels or rack. Put on serving plate and top with sesame seeds if desired."], "facts": "334 calories; protein 14.2g 28% DV; carbohydrates 22.6g 7% DV; fat 20.5g 32% DV; cholesterol 39.7mg 13% DV; sodium 220.2mg 9% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/24239/vietnamese-fresh-spring-rolls/", "name": "Vietnamese Fresh Spring Rolls", "summary": "\nThese spring rolls are a refreshing change from the usual fried variety, and have become a family favorite.  They are great as a cool summertime appetizer, and are delicious dipped in one or both of the sauces. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5265636.jpg", "meta": [["prep:", "45 mins"], ["cook:", "5 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 spring rolls"]], "ingredients": ["2 ounces rice vermicelli", "8  rice wrappers (8.5 inch diameter)", "8 large cooked shrimp - peeled, deveined and cut in half", "1 ⅓ tablespoons chopped fresh Thai basil", "3 tablespoons chopped fresh mint leaves", "3 tablespoons chopped fresh cilantro", "2 leaves lettuce, chopped", "4 teaspoons fish sauce", "¼ cup water", "2 tablespoons fresh lime juice", "1 clove garlic, minced", "2 tablespoons white sugar", "½ teaspoon garlic chili sauce", "3 tablespoons hoisin sauce", "1 teaspoon finely chopped peanuts"], "direction": ["Bring a medium saucepan of water to boil. Boil rice vermicelli 3 to 5 minutes, or until al dente, and drain.", "Fill a large bowl with warm water. Dip one wrapper into the hot water for 1 second to soften. Lay wrapper flat. In a row across the center, place 2 shrimp halves, a handful of vermicelli, basil, mint, cilantro and lettuce, leaving about 2 inches uncovered on each side. Fold uncovered sides inward, then tightly roll the wrapper, beginning at the end with the lettuce. Repeat with remaining ingredients.", "In a small bowl, mix the fish sauce, water, lime juice, garlic, sugar and chili sauce.", "In another small bowl, mix the hoisin sauce and peanuts.", "Serve rolled spring rolls with the fish sauce and hoisin sauce mixtures."], "facts": "82 calories; protein 3.3g 7% DV; carbohydrates 15.8g 5% DV; fat 0.7g 1% DV; cholesterol 10.8mg 4% DV; sodium 305.4mg 12% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/13107/miso-soup/", "name": "Miso Soup", "summary": "\nDashi is a basic stock used in Japanese cooking which is made by boiling dried kelp (seaweed) and dried bonito (fish). Instant dashi granules are sold in conveniently-sized jars or packets and vary in strength. Add more dashi to your soup if you want a stronger stock. You can use yellow, white or red miso paste for this soup. Yellow miso is sweet and creamy, red miso is stronger and saltier. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F365400.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons dashi granules", "4 cups water", "3 tablespoons miso paste", "1 (8 ounce) package silken tofu, diced", "2  green onions, sliced diagonally into 1/2 inch pieces"], "direction": ["In a medium saucepan over medium-high heat, combine dashi granules and water; bring to a boil. Reduce heat to medium, and whisk in the miso paste. Stir in tofu. Separate the layers of the green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving."], "facts": "63 calories; protein 5.5g 11% DV; carbohydrates 5.3g 2% DV; fat 2.3g 4% DV; cholesterol 0mg; sodium 513.1mg 21% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/142967/easy-garam-masala/", "name": "Easy Garam Masala", "summary": "\nThis is a quick Garam Masala (Indian spice) mix. Garam Masala is better when made with whole spices that have been roasted and ground, but this is a quick and easy substitute that's pretty good. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F399841.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "12"], ["Yield:", "1 /4 cup"]], "ingredients": ["1 tablespoon ground cumin", "1 ½ teaspoons ground coriander", "1 ½ teaspoons ground cardamom", "1 ½ teaspoons ground black pepper", "1 teaspoon ground cinnamon", "½ teaspoon ground cloves", "½ teaspoon ground nutmeg"], "direction": ["Mix cumin, coriander, cardamom, pepper, cinnamon, cloves, and nutmeg in a bowl. Place mix in an airtight container, and store in a cool, dry place."], "facts": "6 calories; protein 0.2g; carbohydrates 1g; fat 0.2g; cholesterol 0mg; sodium 1.3mg."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/", "name": "Quick Beef Stir-Fry", "summary": "\nQuick and easy. I make this on my busiest weeknights. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6263320.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 pound beef sirloin, cut into 2-inch strips", "1 ½ cups fresh broccoli florets", "1  red bell pepper, cut into matchsticks", "2  carrots, thinly sliced", "1  green onion, chopped", "1 teaspoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons sesame seeds, toasted"], "direction": ["Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.", "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes."], "facts": "268 calories; protein 22.6g 45% DV; carbohydrates 9.1g 3% DV; fat 15.8g 24% DV; cholesterol 48.9mg 16% DV; sodium 526.2mg 21% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/257938/spicy-thai-basil-chicken-pad-krapow-gai/", "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)", "summary": "\nMy version of this classic Thai dish has spectacular taste even with regular basil instead of Thai or holy basil. The sauce actually acts like a glaze as the chicken mixture cooks over high heat. The recipe works best if you chop or grind your own chicken and have all ingredients prepped before you start cooking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4507925.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["⅓ cup chicken broth", "1 tablespoon oyster sauce", "1 tablespoon soy sauce, or as needed", "2 teaspoons fish sauce", "1 teaspoon white sugar", "1 teaspoon brown sugar", "2 tablespoons vegetable oil", "1 pound skinless, boneless chicken thighs, coarsely chopped", "¼ cup sliced shallots", "4 cloves garlic, minced", "2 tablespoons minced Thai chilies, Serrano, or other hot pepper", "1 cup very thinly sliced fresh basil leaves", "2 cups hot cooked rice"], "direction": ["Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended.", "Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute.", "Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat.", "Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice."], "facts": "715 calories; protein 49.8g 100% DV; carbohydrates 58.6g 19% DV; fat 30g 46% DV; cholesterol 155.9mg 52% DV; sodium 1181.9mg 47% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/", "name": "The Best Thai Coconut Soup", "summary": "\nAuthentic, bold, and delicious Thai flavors make this soup irresistible! This is the best Thai coconut soup I've had. You won't be disappointed with this one! Serve over steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2319909.jpg", "meta": [["prep:", "35 mins"], ["cook:", "30 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon vegetable oil", "2 tablespoons grated fresh ginger", "1 stalk lemon grass, minced", "2 teaspoons red curry paste", "4 cups chicken broth", "3 tablespoons fish sauce", "1 tablespoon light brown sugar", "3 (13.5 ounce) cans coconut milk", "½ pound fresh shiitake mushrooms, sliced", "1 pound medium shrimp - peeled and deveined", "2 tablespoons fresh lime juice", "salt to taste", "¼ cup chopped fresh cilantro"], "direction": ["Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro."], "facts": "368 calories; protein 13.2g 26% DV; carbohydrates 8.9g 3% DV; fat 32.9g 51% DV; cholesterol 86.3mg 29% DV; sodium 579.4mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/223382/chicken-stir-fry/", "name": "Chicken Stir-Fry", "summary": "\nA quick and easy dish to prepare, this chicken stir-fry is packed with veggies. Try adding bean sprouts, bamboo shoots, snap peas, or any of your favorite vegetables. Serve it with white or brown rice, or noodles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F973101.jpg", "meta": [["prep:", "30 mins"], ["cook:", "35 mins"], ["additional:", "15 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 cups white rice", "4 cups water", "⅔ cup soy sauce", "¼ cup brown sugar", "1 tablespoon cornstarch", "1 tablespoon minced fresh ginger", "1 tablespoon minced garlic", "¼ teaspoon red pepper flakes", "3  skinless, boneless chicken breast halves, thinly sliced", "1 tablespoon sesame oil", "1  green bell pepper, cut into matchsticks", "1 (8 ounce) can sliced water chestnuts, drained", "1 head broccoli, broken into florets", "1 cup sliced carrots", "1  onion, cut into large chunks", "1 tablespoon sesame oil"], "direction": ["Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes.", "Combine soy sauce, brown sugar, and corn starch in a small bowl; stir until smooth. Mix ginger, garlic, and red pepper into sauce; coat chicken with marinade and refrigerate for at least 15 minutes.", "Heat 1 tablespoon sesame oil in a large skillet over medium-high heat. Cook and stir bell pepper, water chestnuts, broccoli, carrots, and onion until just tender, about 5 minutes. Remove vegetables from skillet and keep warm.", "Remove chicken from marinade, reserving liquid. Heat 1 tablespoon sesame oil in skillet over medium-high heat. Cook and stir chicken until slightly pink on the inside, about 2 minutes per side; return vegetables and reserved marinade to skillet. Bring to a boil; cook and stir until chicken is no longer pink in the middle and vegetables are tender, 5 to 7 minutes. Serve over rice."], "facts": "700 calories; protein 67.7g 135% DV; carbohydrates 76.7g 25% DV; fat 12.1g 19% DV; cholesterol 161.4mg 54% DV; sodium 1790.4mg 72% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/72068/chicken-katsu/", "name": "Chicken Katsu", "summary": "\nThis is my family recipe for Chicken Katsu - Japanese style fried chicken. Can also be used to make Tonkatsu, just use pork cutlets instead of chicken. Serve with white rice and tonkatsu sauce. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5816671.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves - pounded to 1/2 inch thickness", "salt and pepper to taste", "2 tablespoons all-purpose flour", "1  egg, beaten", "1 cup panko bread crumbs", "1 cup oil for frying, or as needed"], "direction": ["Season the chicken breasts on both sides with salt and pepper. Place the flour, egg and panko crumbs into separate shallow dishes. Coat the chicken breasts in flour, shaking off any excess. Dip them into the egg, and then press into the panko crumbs until well coated on both sides.", "Heat 1/4 inch of oil in a large skillet over medium-high heat. Place chicken in the hot oil, and cook 3 or 4 minutes per side, or until golden brown."], "facts": "297 calories; protein 31.2g 62% DV; carbohydrates 22.2g 7% DV; fat 11.4g 18% DV; cholesterol 118.4mg 40% DV; sodium 250.7mg 10% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/115965/egg-drop-soup-better-than-restaurant-quality/", "name": "Egg Drop Soup (Better than Restaurant Quality!)", "summary": "\nAfter many many trips to different Chinese restaurants looking for a good bowl of egg drop soup, I decided to take it upon myself to create what I feel is the ultimate in egg drop soup. I hope you enjoy it as much as I do! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F972459.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "1"], ["Yield:", "1 cup"]], "ingredients": ["1 cup chicken broth", "¼ teaspoon soy sauce", "¼ teaspoon sesame oil", "1 teaspoon cornstarch  (Optional)", "2 teaspoons water  (Optional)", "1  egg, beaten", "1 drop yellow food coloring  (Optional)", "1 teaspoon chopped fresh chives", "⅛ teaspoon salt  (Optional)", "½ teaspoon ground white pepper  (Optional)"], "direction": ["In a small saucepan, combine the chicken broth, soy sauce and sesame oil. Bring to a boil. Stir together the cornstarch and water to dissolve cornstarch; pour into the boiling broth. Stir gently while you pour in the egg and yellow food coloring if using. Season with chives, salt and pepper before serving."], "facts": "112 calories; protein 7.5g 15% DV; carbohydrates 4.8g 2% DV; fat 6.7g 10% DV; cholesterol 191mg 64% DV; sodium 1395.7mg 56% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/", "name": "Black Pepper Beef and Cabbage Stir Fry", "summary": "\nA very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8279013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "4 cloves garlic, chopped", "½ pound ground beef", "½ small head cabbage, shredded", "1  red bell pepper, cut into strips", "2 tablespoons soy sauce", "1 teaspoon cornstarch", "½ cup cold water", "1 teaspoon ground black pepper, or to taste", "1 pinch salt, to taste"], "direction": ["Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.", "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened."], "facts": "280 calories; protein 11.6g 23% DV; carbohydrates 9.5g 3% DV; fat 22.1g 34% DV; cholesterol 48.2mg 16% DV; sodium 547.3mg 22% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/228443/authentic-pho/", "name": "Authentic Pho", "summary": "\nThis authentic pho isn't quick, but it is delicious. The key is in the broth, which gets simmered for at least 6 hours. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1120315.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 hrs"], ["additional:", "1 hr"], ["total:", "9 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 pounds beef soup bones", "1  onion, unpeeled and cut in half", "5 slices fresh ginger", "1 tablespoon salt", "2 pods star anise", "2 ½ tablespoons fish sauce", "4 quarts water", "1 (8 ounce) package dried rice noodles", "1 ½ pounds beef top sirloin, thinly sliced", "½ cup chopped cilantro", "1 tablespoon chopped green onion", "1 ½ cups bean sprouts", "1 bunch Thai basil", "1  lime, cut into 4 wedges", "¼ cup hoisin sauce  (Optional)", "¼ cup chile-garlic sauce (such as Sriracha®)  (Optional)"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour.", "Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes.", "Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside.", "Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer.", "Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side."], "facts": "509 calories; protein 34.9g 70% DV; carbohydrates 65.6g 21% DV; fat 11g 17% DV; cholesterol 74mg 25% DV; sodium 3519.3mg 141% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/14565/naan/", "name": "Naan", "summary": "\nThis recipe makes the best naan I have tasted outside of an Indian restaurant. I can't make enough of it for my family. I serve it with shish kabobs, but I think they would eat it plain. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1016308.jpg", "meta": [["prep:", "30 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs 23 mins"], ["total:", "3 hrs"], ["Servings:", "14"], ["Yield:", "14 servings"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water", "¼ cup white sugar", "3 tablespoons milk", "1  egg, beaten", "2 teaspoons salt", "4 ½ cups bread flour", "2 teaspoons minced garlic  (Optional)", "¼ cup butter, melted"], "direction": ["In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume.", "Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes.", "During the second rising, preheat grill to high heat.", "At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared."], "facts": "52 calories; protein 0.8g 2% DV; carbohydrates 4.1g 1% DV; fat 3.7g 6% DV; cholesterol 22.3mg 7% DV; sodium 362.7mg 15% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/61024/asian-orange-chicken/", "name": "Asian Orange Chicken", "summary": "\nA delicious citrus chicken recipe with flavors reminiscent of the orange chicken from a popular restaurant in the mall. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3864686.jpg", "meta": [["prep:", "40 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ½ cups water", "2 tablespoons orange juice", "¼ cup lemon juice", "⅓ cup rice vinegar", "2 ½ tablespoons soy sauce", "1 tablespoon grated orange zest", "1 cup packed brown sugar", "½ teaspoon minced fresh ginger root", "½ teaspoon minced garlic", "2 tablespoons chopped green onion", "¼ teaspoon red pepper flakes", "3 tablespoons cornstarch", "2 tablespoons water"], "direction": ["Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes.", "Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours.", "In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat.", "Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil.", "Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally."], "facts": "445 calories; protein 17.8g 36% DV; carbohydrates 68.7g 22% DV; fat 11.2g 17% DV; cholesterol 34.2mg 11% DV; sodium 762.8mg 31% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/268091/easy-korean-ground-beef-bowl/", "name": "Easy Korean Ground Beef Bowl", "summary": "\nKorean beef bowls are quick and easy to make. The ingredients can easily be adjusted to suit your taste. Serve over warm rice or spiralized vegetables. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5759837.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 bowls"]], "ingredients": ["1 pound lean ground beef", "5 cloves garlic, crushed", "1 tablespoon freshly grated ginger", "2 teaspoons toasted sesame oil", "½ cup reduced-sodium soy sauce", "⅓ cup light brown sugar", "¼ teaspoon crushed red pepper", "6  green onions, chopped, divided", "4 cups hot cooked brown rice", "1 tablespoon toasted sesame seeds"], "direction": ["Heat a large skillet over medium-high heat. Add beef and cook, stirring and crumbling into small pieces until browned, 5 to 7 minutes. Drain excess grease.", "Add garlic, ginger, and sesame oil, stirring until fragrant, about 2 minutes. Stir in soy sauce, brown sugar, and red pepper. Cook until some of the sauce absorbs into the beef, about 7 minutes. Add 1/2 of the chopped green onions.", "Serve beef over hot cooked rice; garnished with sesame seeds and remaining green onions."], "facts": "574 calories; protein 28.8g 58% DV; carbohydrates 70.3g 23% DV; fat 19.1g 29% DV; cholesterol 74.3mg 25% DV; sodium 1142.2mg 46% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/47015/quick-and-easy-pancit/", "name": "Quick and Easy Pancit", "summary": "\nQuick, Easy and delicious! Will remind you of Island Fiestas! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5886739.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 Servings"]], "ingredients": ["1 (12 ounce) package dried rice noodles", "1 teaspoon vegetable oil", "1  onion, finely diced", "3 cloves garlic, minced", "2 cups diced cooked chicken breast meat", "1 small head cabbage, thinly sliced", "4  carrot, thinly sliced", "¼ cup soy sauce", "2  lemons - cut into wedges, for garnish"], "direction": ["Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside.", "Heat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons."], "facts": "369 calories; protein 18.1g 36% DV; carbohydrates 65.1g 21% DV; fat 4.9g 8% DV; cholesterol 35mg 12% DV; sodium 788.6mg 32% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/19670/sweet-and-sour-sauce-i/", "name": "Sweet and Sour Sauce I", "summary": "\nAn excellent, traditional sweet and sour sauce. It is great served with meatballs, with tempura, or even over rice! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1029629.jpg", "meta": [["prep:", "2 mins"], ["cook:", "10 mins"], ["total:", "12 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["¾ cup white sugar", "⅓ cup white vinegar", "⅔ cup water", "¼ cup soy sauce", "1 tablespoon ketchup", "2 tablespoons cornstarch"], "direction": ["Place the sugar, vinegar, water, soy sauce, ketchup and cornstarch in a medium saucepan, and bring to a boil. Stir continuously until the mixture has thickened."], "facts": "43 calories; protein 0.3g 1% DV; carbohydrates 10.8g 4% DV; fat 0g; cholesterol 0mg; sodium 236.3mg 10% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/212940/chicken-arroz-caldo-chicken-rice-porridge/", "name": "Chicken Arroz Caldo (Chicken Rice Porridge)", "summary": "\nThis is a soupy dish that is served mainly for a snack. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6512910.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 tablespoons olive oil", "1  onion, diced", "2 cloves garlic, crushed", "1 (2 inch) piece fresh ginger, peeled and thinly sliced", "2 ¼ pounds chicken wings, split and tips discarded", "1 tablespoon fish sauce  (Optional)", "5 ¼ cups chicken broth", "1 cup glutinous sweet rice", "salt and pepper to taste", "1  green onion, chopped", "1  lemon, sliced  (Optional)", "1 teaspoon fish sauce for sprinkling, if desired  (Optional)"], "direction": ["Heat the olive oil in a large pot over medium heat; cook and stir the onion, garlic, and ginger in the hot oil until fragrant, about 5 minutes. Add the chicken wings; cook and stir together for 1 minute. Stir the fish sauce into the pot, cover, and cook another 2 minutes.", "Pour the chicken broth into the pot. Add the sweet rice and stir. Bring the mixture to a boil; cover and cook for 10 minutes, stirring occasionally to assure the rice is not sticking to the bottom of the pot. Season with salt and pepper. Garnish with the green onion, and serve with lemon slices and additional fish sauce, if desired."], "facts": "294 calories; protein 15.5g 31% DV; carbohydrates 24.6g 8% DV; fat 14.9g 23% DV; cholesterol 42.1mg 14% DV; sodium 1586.1mg 63% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/191156/restaurant-style-beef-and-broccoli/", "name": "Restaurant Style Beef and Broccoli", "summary": "\nThis is my go-to recipe when I want Chinese food without having to go out. Very easy and delicious. Substituting chicken for the beef works great too. Serve over rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F516732.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["⅓ cup oyster sauce", "2 teaspoons Asian (toasted) sesame oil", "⅓ cup sherry", "1 teaspoon soy sauce", "1 teaspoon white sugar", "1 teaspoon cornstarch", "¾ pound beef round steak, cut into 1/8-inch thick strips", "3 tablespoons vegetable oil, plus more if needed", "1  thin slice of fresh ginger root", "1 clove garlic, peeled and smashed", "1 pound broccoli, cut into florets"], "direction": ["Whisk together the oyster sauce, sesame oil, sherry, soy sauce, sugar, and cornstarch in a bowl, and stir until the sugar has dissolved. Place the steak pieces into a shallow bowl, pour the oyster sauce mixture over the meat, stir to coat well, and marinate for at least 30 minutes in refrigerator.", "Heat vegetable oil in a wok or large skillet over medium-high heat, and stir in the ginger and garlic. Let them sizzle in the hot oil for about 1 minute to flavor the oil, then remove and discard. Stir in the broccoli, and toss and stir in the hot oil until bright green and almost tender, 5 to 7 minutes. Remove the broccoli from the wok, and set aside.", "Pour a little more oil into the wok, if needed, and stir and toss the beef with the marinade until the sauce forms a glaze on the beef, and the meat is no longer pink, about 5 minutes. Return the cooked broccoli to the wok, and stir until the meat and broccoli are heated through, about 3 minutes."], "facts": "331 calories; protein 21.7g 43% DV; carbohydrates 13.3g 4% DV; fat 21.1g 33% DV; cholesterol 51.9mg 17% DV; sodium 419.2mg 17% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/9027/kung-pao-chicken/", "name": "Kung Pao Chicken", "summary": "\nSpicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F290890.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound skinless, boneless chicken breast halves - cut into chunks", "2 tablespoons white wine", "2 tablespoons soy sauce", "2 tablespoons sesame oil, divided", "2 tablespoons cornstarch, dissolved in 2 tablespoons water", "1 ounce hot chile paste", "1 teaspoon distilled white vinegar", "2 teaspoons brown sugar", "4  green onions, chopped", "1 tablespoon chopped garlic", "1 (8 ounce) can water chestnuts", "4 ounces chopped peanuts"], "direction": ["To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes.", "To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic.", "Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens."], "facts": "437 calories; protein 34.4g 69% DV; carbohydrates 25.3g 8% DV; fat 23.3g 36% DV; cholesterol 65.9mg 22% DV; sodium 595.6mg 24% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/31144/sweet-and-sour-pork-iii/", "name": "Sweet and Sour Pork III", "summary": "\nMy husband's grandmother was Chinese. She taught me this one. This is the way Gramma made Sweet and Sour all her life (she died 6 years ago at age 94). The secret is apple cider vinegar. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F265130.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound pork butt, cut into 1 inch cubes", "1 teaspoon salt", "¼ teaspoon white sugar", "1 teaspoon soy sauce", "1  egg white", "2  green onions, chopped", "1 quart vegetable oil for frying", "½ cup cornstarch", "1 tablespoon vegetable oil", "3 stalks celery, cut into 1/2 inch pieces", "1 medium green bell pepper, cut into 1 inch pieces", "1  medium onion, cut into wedges", "white sugar to taste", "salt to taste", "1 cup water", "¼ teaspoon salt", "¾ cup white sugar", "⅓ cup apple cider vinegar", "¼ cup ketchup", "½ teaspoon soy sauce", "1 (8 ounce) can pineapple chunks, undrained", "2 tablespoons cornstarch", "¼ cup water"], "direction": ["Place cubed pork in a medium bowl, and season with 1 teaspoon salt, 1/4 teaspoon sugar, and 1 teaspoon soy sauce. Mix in the egg white and green onions. Cover, and place in the refrigerator at least 1 hour.", "Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer.", "Coat the pork with 1/2 cup cornstarch, and fry in the heated oil about 10 minutes, until evenly browned. Drain on paper towels.", "Heat 1 tablespoon oil in a wok over medium heat. Stir in the celery, green bell pepper, and onion, and cook until tender. Season with salt and sugar. Remove from heat, and set aside.", "In a large saucepan, mix 1 cup water, 1/4 teaspoon salt, 3/4 cup sugar, apple cider vinegar, ketchup, and 1/2 teaspoon soy sauce. Bring to a boil, and stir in the cooked pork, celery mixture, and the pineapple chunks with juice. Return to boil, and mix in 2 tablespoons cornstarch and 1/4 cup water to thicken. Cook until well blended."], "facts": "663 calories; protein 13.9g 28% DV; carbohydrates 74.7g 24% DV; fat 35g 54% DV; cholesterol 42.6mg 14% DV; sodium 1085.4mg 43% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/193307/easy-mochi/", "name": "Easy Mochi", "summary": "\nA lovely Chinese New Year's snack; soft, slightly sweet, and chewy, this is a wonderful traditional dessert. Ready in only minutes. Serve with steaming hot tea! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6894718.jpg", "meta": [["prep:", "30 mins"], ["cook:", "5 mins"], ["additional:", "3 hrs"], ["total:", "3 hrs 35 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 cup sweetened red bean paste", "1 cup sweet rice flour (mochiko)", "1 teaspoon green tea powder (matcha)", "1 cup water", "¼ cup white sugar", "½ cup cornstarch, for rolling out the dough"], "direction": ["Wrap red bean paste in aluminum foil and place in the freezer for at least 3 hours. Mix sweet rice flour and green tea powder thoroughly in a microwave-safe glass or ceramic bowl. Stir in water, then sugar. Mix until smooth. Cover bowl with plastic wrap.", "Cook the rice flour mixture in the microwave for 3 minutes and 30 seconds. Meanwhile, remove red bean paste from the freezer and divide paste into 8 equal balls. Set aside. Stir rice flour mixture and heat for another 15 to 30 seconds.", "Dust work surface with cornstarch. While the mochi is still hot from the microwave, begin rolling balls the size of about 2 tablespoons. Flatten the mochi ball and place 1 frozen red bean paste ball in the center. Pinch the mochi over the red bean paste until the paste is completely covered. Sprinkle with additional cornstarch and place mochi seam side down in a paper muffin liner to prevent sticking. Repeat until all the mochi and red bean paste is used."], "facts": "213 calories; protein 2.8g 6% DV; carbohydrates 49.8g 16% DV; fat 0.2g; cholesterol 0mg; sodium 82.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/16641/red-lentil-curry/", "name": "Red Lentil Curry", "summary": "\nThis is a rich and hearty lentil curry, great as a main meal rather than as a side dish like the more traditional Indian dhal. Don't let the ingredient list faze you, this really is an easy dish to make. This dish is great served with basmati rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8133071.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups red lentils", "1 large onion, diced", "1 tablespoon vegetable oil", "2 tablespoons curry paste", "1 tablespoon curry powder", "1 teaspoon ground turmeric", "1 teaspoon ground cumin", "1 teaspoon chili powder", "1 teaspoon salt", "1 teaspoon white sugar", "1 teaspoon minced garlic", "1 teaspoon minced fresh ginger", "1 (14.25 ounce) can tomato puree"], "direction": ["Wash the lentils in cold water until the water runs clear. Put lentils in a pot with enough water to cover; bring to a boil, place a cover on the pot, reduce heat to medium-low, and simmer, adding water during cooking as needed to keep covered, until tender, 15 to 20 minutes. Drain.", "Heat vegetable oil in a large skillet over medium heat; cook and stir onions in hot oil until caramelized, about 20 minutes.", "Mix curry paste, curry powder, turmeric, cumin, chili powder, salt, sugar, garlic, and ginger together in a large bowl; stir into the onions. Increase heat to high and cook, stirring constantly, until fragrant, 1 to 2 minutes.", "Stir in the tomato puree, remove from heat and stir into the lentils."], "facts": "192 calories; protein 12.1g 24% DV; carbohydrates 32.5g 11% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 571.9mg 23% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/141169/easy-indian-butter-chicken/", "name": "Easy Indian Butter Chicken", "summary": "\nThis is a recipe I have perfected over the years and passed onto many others.  The sauce is perfect when creamy and not too thick or too thin.  The level of salt and spices can be suited to your taste.  Garam and tandoori masala can be found in the ethnic aisle of your grocery store. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2180712.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup butter, divided", "1  onion, minced", "1 tablespoon minced garlic", "1 (15 ounce) can tomato sauce", "3 cups heavy cream", "2 teaspoons salt", "1 teaspoon cayenne pepper", "1 teaspoon garam masala", "1 ½ pounds skinless, boneless chicken breast, cut into bite-sized chunks", "2 tablespoons vegetable oil", "2 tablespoons tandoori masala"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "Melt a few tablespoons of butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes.", "Meanwhile melt the remaining butter in a saucepan over medium-high heat along with the tomato sauce, heavy cream, salt, cayenne pepper, and garam masala. Bring to a simmer, then reduce heat to medium-low; cover, and simmer for 30 minutes, stirring occasionally. Then stir in caramelized onions.", "While the sauce is simmering, toss cubed chicken breast with vegetable oil until coated, then season with tandoori masala and spread out onto a baking sheet.", "Bake chicken in preheated oven until no longer pink in the center, about 12 minutes. Once done, add the chicken to the sauce and simmer for 5 minutes before serving."], "facts": "880 calories; protein 26.4g 53% DV; carbohydrates 12.8g 4% DV; fat 82.3g 127% DV; cholesterol 302.9mg 101% DV; sodium 1461mg 58% DV."}, {"type": "By Cuisine  ", "package": "asian_recipes", "link": "https://www.allrecipes.com/recipe/46822/indian-chicken-curry-ii/", "name": "Indian Chicken Curry II", "summary": "\nThis is an adaptation of yellow chicken curry from India. The aromas and flavors are a delight to the senses! It is best served with fresh Naan bread and Jasmine or Basmati rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1053643.jpg", "meta": [["prep:", "20 mins"], ["cook:", "25 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 to 6 servings"]], "ingredients": ["3 tablespoons olive oil", "1 small onion, chopped", "2 cloves garlic, minced", "3 tablespoons curry powder", "1 teaspoon ground cinnamon", "1 teaspoon paprika", "1  bay leaf", "½ teaspoon grated fresh ginger root", "½ teaspoon white sugar", "salt to taste", "2  skinless, boneless chicken breast halves - cut into bite-size pieces", "1 tablespoon tomato paste", "1 cup plain yogurt", "¾ cup coconut milk", "½  lemon, juiced", "½ teaspoon cayenne pepper"], "direction": ["Heat olive oil in a skillet over medium heat. Saute onion until lightly browned. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar and salt. Continue stirring for 2 minutes. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes.", "Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes."], "facts": "313 calories; protein 19.1g 38% DV; carbohydrates 14g 5% DV; fat 21.7g 33% DV; cholesterol 37.9mg 13% DV; sodium 268.3mg 11% DV."}]