[{"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/260540/chef-johns-sourdough-bread/", "name": "Chef John's Sourdough Bread", "summary": "\nMaking your own sourdough bread does take a while, but the amount of actual work is minimal--and the bread you'll get is spectacular! See the footnote link to how to make the sourdough starter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6103033.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "21 hrs"], ["total:", "21 hrs 35 mins"], ["Servings:", "8"], ["Yield:", "1 loaf"]], "ingredients": ["100 grams sourdough starter", "250 grams water", "8 grams kosher salt", "394 grams bread flour", "rice flour for bread form (banneton)", "1 10-inch banneton (proofing basket)"], "direction": ["Measure out starter into a bowl. Add water, salt, and bread flour. Mix until ingredients are well blended into a very sticky dough. Cover with aluminum foil; let rest 4 hours at 70 to 75 degrees F (22 degrees C).", "With wet hands, fold dough over on itself 3 or 4 times. Cover with foil and allow dough to ferment for 2 more hours.", "Generously dust a bread form with rice flour (see Chef's Note for banneton substitution).", "Scrape dough out onto a lightly floured work surface (you can use bread flour or all-purpose flour). Shape into a ball with a smooth, unbroken surface, using just enough flour on the surface to keep it from sticking. Transfer smooth-side down to banneton. Pinch together the rougher edges of the surface toward the center to smooth them and maintain the round ball shape.", "Cover and refrigerate 12 hours to slow the fermentation process.", "Remove loaf from the refrigerator and let it rise in a warm spot until the dough springs slowly back and retains a slight indentation when poked gently with a finger, about 3 to 5 hours.", "Preheat oven to 450 degrees F (230 degrees C). Line a rimmed baking sheet with parchment paper.", "Dust surface of dough with flour. Gently invert banneton over the baking sheet and transfer dough onto parchment paper. Gently brush off excess rice flour. Score the top of the dough about 1/8-inch deep with a sharp knife to create a shallow slit running across the center. Mist entire surface lightly with water.", "Bake in the center of preheated oven until beautifully browned, 25 to 30 minutes.", "Transfer to a rack to cool completely (do not slice loaf while it is still warm)."], "facts": "205 calories; protein 6.9g 14% DV; carbohydrates 41.2g 13% DV; fat 0.9g 1% DV; cholesterol 0.1mg; sodium 404.8mg 16% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/9353/strawberry-bread/", "name": "Strawberry Bread", "summary": "\nThis is wonderful hot or cold, for breakfast or as a dessert. A definite family favorite! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F836956.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "24"], ["Yield:", "2 9-inch loaves"]], "ingredients": ["2 cups fresh strawberries", "3 ⅛ cups all-purpose flour", "2 cups white sugar", "1 tablespoon ground cinnamon", "1 teaspoon salt", "1 teaspoon baking soda", "1 ¼ cups vegetable oil", "4  eggs, beaten", "1 ¼ cups chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Butter and flour two 9 x 5-inch loaf pans.", "Slice strawberries and place in medium-sized bowl. Sprinkle lightly with sugar, and set aside while preparing batter.", "Combine flour, sugar, cinnamon, salt and baking soda in large bowl; mix well. Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans.", "Bake in preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately). Let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing."], "facts": "281 calories; protein 3.3g 7% DV; carbohydrates 31.2g 10% DV; fat 16.6g 26% DV; cholesterol 31mg 10% DV; sodium 161.5mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/24932/whole-wheat-beer-bread/", "name": "Whole Wheat Beer Bread", "summary": "\nGood with soups, chili. Makes excellent toast. Flavor of bread will change, depending on type of beer used. Loaf comes out looking textured on top. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F390936.jpg", "meta": [["prep:", "10 mins"], ["cook:", "50 mins"], ["total:", "1 hr"], ["Servings:", "12"], ["Yield:", "1 - 9x5 inch loaf"]], "ingredients": ["1 ½ cups all-purpose flour", "1 ½ cups whole wheat flour", "4 ½ teaspoons baking powder", "1 ½ teaspoons salt", "⅓ cup packed brown sugar", "1 (12 fluid ounce) can or bottle beer"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large mixing bowl, combine all-purpose flour, whole wheat flour, baking powder, salt and brown sugar. Pour in beer, stir until a stiff batter is formed. It may be necessary to mix dough with your hands. Scrape dough into  prepared loaf pan.", "Bake in preheated oven for 50 to 60 minutes, until a toothpick inserted into center of the loaf comes out clean."], "facts": "144 calories; protein 3.8g 8% DV; carbohydrates 30.2g 10% DV; fat 0.4g 1% DV; cholesterolmg; sodium 429.5mg 17% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/270860/garlic-naan/", "name": "Garlic Naan", "summary": "\nThough restaurant naan is usually cooked in the intense heat of the tandoor oven, you can pull off this homemade version using a hot cast iron skillet. When cooked at the proper temperature, the naan will develop blistered bubbles with a lovely golden-black char. Reward yourself for a job well done by sopping it in copious amounts of curry. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6703829.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 25 mins"], ["total:", "3 hrs 10 mins"], ["Servings:", "6"], ["Yield:", "6 naan"]], "ingredients": ["½ cup warm water", "1 teaspoon white sugar", "1 (.25 ounce) package active dry yeast"], "direction": ["Combine water, sugar, and yeast in a bowl. Let stand until yeast softens and forms a creamy foam, about 15 minutes.", "In the meantime, heat butter in a pan over medium heat until melted and sizzling. Quickly mix in garlic. Remove garlic butter from heat and set aside until ready to use.", "Add yogurt, bread flour, salt, and 1 tablespoon of the garlic butter to the yeast mixture. Stir with a wooden spoon until a shaggy dough forms. Knead by hand until dough pulls away from the sides of the bowl, adding more water or flour as needed. Turn dough out onto the counter and continue kneading into a smooth ball, 3 to 4 minutes.", "Place dough in a large bowl. Coat with a few more drizzles of garlic butter. Cover and let rise until doubled in volume, about 2 hours.", "Punch down dough and turn out onto the counter. Shape into a rough rectangle and cut into 6 pieces. Roll each piece into a ball and lightly dust with flour. Cover with plastic wrap and proof until slightly puffy, 15 to 20 minutes.", "Roll each piece into an oval about 1/8 inch thick. Sprinkle some cilantro on top and press lightly to adhere.", "Preheat a cast iron skillet until very, very hot, about 5 minutes. Cook each naan until large bubbles form, 1 to 2 minutes. Flip over, press gently, and cook until bubbles on the bottom are charred, 2 to 3 minutes more.", "Brush naan with more garlic butter before serving."], "facts": "227 calories; protein 6g 12% DV; carbohydrates 31.3g 10% DV; fat 8.6g 13% DV; cholesterol 20.9mg 7% DV; sodium 384.7mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/222337/brown-butter-pineapple-corn-muffins/", "name": "Brown Butter Pineapple Corn Muffins", "summary": "\nWhen you're talking about cornbread, you're also talking about a big bowl of chili, and nothing balances that big spoon in one hand like a warm corn muffin in the other. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F862424.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "1 hr 5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["½ cup unsalted butter", "¾ cup chopped dried sweetened pineapple", "1 cup all-purpose flour", "1 cup yellow cornmeal", "½ teaspoon baking soda", "½ teaspoon salt", "1 cup buttermilk", "2  large eggs"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Line a muffin pan with paper muffin liners, and lightly spray liners with cooking spray.", "Melt butter in a heavy saucepan over medium heat until golden brown. Remove from heat and stir in pineapple. Set aside to steep for 20 minutes.", "Whisk flour, cornmeal, baking soda, and salt until combined. Set aside.", "Combine buttermilk, eggs, and pineapple mixture in a large bowl. Whisk until smooth, about 1 minute. Add flour mixture to buttermilk mixture; whisk until just combined.", "Divide batter evenly between the prepared muffin cups and bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 25 minutes. Cool in the pan for 5 minutes before removing to cool completely on a wire rack."], "facts": "195 calories; protein 4g 8% DV; carbohydrates 24.1g 8% DV; fat 9.2g 14% DV; cholesterol 52.2mg 17% DV; sodium 185.6mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6833/burger-or-hot-dog-buns/", "name": "Burger or Hot Dog Buns", "summary": "\nThis recipe can be used to make either hamburger buns or hot dog buns. My husband says they are 'top of the line.' Nice and soft. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1106883.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["1 cup milk", "½ cup water", "¼ cup butter", "4 ½ cups all-purpose flour", "1 (.25 ounce) package instant yeast", "2 tablespoons white sugar", "1 ½ teaspoons salt", "1  egg"], "direction": ["In a small saucepan, heat milk, water and butter until very warm, 120 degrees F (50 degrees C).", "In a large bowl, mix together 1 3/4 cup flour, yeast, sugar and salt. Mix milk mixture into flour mixture, and then mix in egg. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes.", "Divide dough into 12 equal pieces. Shape into smooth balls, and place on a greased baking sheet. Flatten slightly. Cover, and let rise for 30 to 35 minutes.", "Bake at 400 degrees F (200 degrees C) for 10 to 12 minutes, or until golden brown.", "For Hot Dog Buns:  Shape each piece into a 6x4 inch rectangle. Starting with the longer side, roll up tightly, and pinch edges and ends to seal. Let rise about 20 to 25 minutes. Bake as above. These buns are pretty big. I usually make 16 instead of 12."], "facts": "230 calories; protein 6.3g 13% DV; carbohydrates 39.1g 13% DV; fat 5.1g 8% DV; cholesterol 27.3mg 9% DV; sodium 333.6mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/157642/homemade-flour-tortillas/", "name": "Homemade Flour Tortillas", "summary": "\nTraditional flour tortillas - homemade and much better than store bought. Do not substitute vegetable oil or shortening for the lard. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F663757.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["4 cups all-purpose flour", "1 teaspoon salt", "2 teaspoons baking powder", "2 tablespoons lard", "1 ½ cups water"], "direction": ["Whisk the flour, salt, and baking powder together in a mixing bowl. Mix in the lard with your fingers until the flour resembles cornmeal. Add the water and mix until the dough comes together; place on a lightly floured surface and knead a few minutes until smooth and elastic. Divide the dough into 24 equal pieces and roll each piece into a ball.", "Preheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough."], "facts": "86 calories; protein 2.2g 4% DV; carbohydrates 16g 5% DV; fat 1.3g 2% DV; cholesterol 1mg; sodium 138.4mg 6% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0ebabff6-3872-4b38-ad70-898e0c409522%2F7df60bf0-b98a-4f9a-9936-8bf1a6a4b885%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/", "name": "Downeast Maine Pumpkin Bread", "summary": "\nThis is a great old Maine recipe, moist and spicy. The bread actually tastes even better the day after it is baked. Great for holiday gift giving! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4567827.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "24"], ["Yield:", "3 - 7x3 inch loaf pans"]], "ingredients": ["1 (15 ounce) can pumpkin puree", "4  eggs", "1 cup vegetable oil", "⅔ cup water", "3 cups white sugar", "3 ½ cups all-purpose flour", "2 teaspoons baking soda", "1 ½ teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "½ teaspoon ground cloves", "¼ teaspoon ground ginger"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.", "In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.", "Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."], "facts": "263 calories; protein 3.1g 6% DV; carbohydrates 40.6g 13% DV; fat 10.3g 16% DV; cholesterol 31mg 10% DV; sodium 305.4mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20171/quick-and-easy-pizza-crust/", "name": "Quick and Easy Pizza Crust", "summary": "\nThis is a great recipe when you don't want to wait for the dough to rise.  You just mix it and allow it to rest for 5 minutes and then it's ready to go!!  It yields a soft, chewy crust.  For a real treat, I recommend you use bread flour and bake it on a pizza stone, but all-purpose flour works well too. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F83108818-1b7b-4971-b363-c924665417d7%2Fd1a0f6a1-5e24-41f9-8645-9d86c4c592ba%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza crust"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "1 cup warm water (110 degrees F/45 degrees C)", "2 ½ cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.", "Stir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes.", "Turn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving."], "facts": "170 calories; protein 4.8g 10% DV; carbohydrates 28.1g 9% DV; fat 4g 6% DV; cholesterolmg; sodium 292.8mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17891/golden-sweet-cornbread/", "name": "Golden Sweet Cornbread", "summary": "\nIf you like sweet cornbread, this is the recipe for you! My mom made this for me as a child, and now it's my family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F307059.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 - 9 inch round pan"]], "ingredients": ["1 cup all-purpose flour", "1 cup yellow cornmeal", "⅔ cup white sugar", "1 teaspoon salt", "3 ½ teaspoons baking powder", "1  egg", "1 cup milk", "⅓ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray or lightly grease a 9 inch round cake pan.", "In a large bowl, combine flour, cornmeal, sugar, salt and baking powder. Stir in egg, milk and vegetable oil until well combined. Pour batter into prepared pan.", "Bake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the loaf comes out clean."], "facts": "189 calories; protein 3.1g 6% DV; carbohydrates 28.2g 9% DV; fat 7.4g 11% DV; cholesterol 17.1mg 6% DV; sodium 353.9mg 14% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/241707/joys-easy-banana-bread/", "name": "Joy's Easy Banana Bread", "summary": "\nThis easy banana bread recipe is quick to prepare, and everyone always comes back for seconds! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2226688.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "10"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["3  ripe bananas, mashed", "1 cup white sugar", "1  egg", "¼ cup melted butter", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.", "Combine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. Stir salt into batter. Pour batter into the prepared loaf pan.", "Bake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour."], "facts": "225 calories; protein 3g 6% DV; carbohydrates 42.4g 14% DV; fat 5.4g 8% DV; cholesterol 30.8mg 10% DV; sodium 398.8mg 16% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17215/best-bread-machine-bread/", "name": "Best Bread Machine Bread", "summary": "\nThis recipe is easy and foolproof. It makes a very soft and tasty loaf of bread with a flaky crust. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5506039.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "1 - 1 1/2 pound loaf"]], "ingredients": ["1 cup warm water (110 degrees F/45 degrees C)", "2 tablespoons white sugar", "1 (.25 ounce) package bread machine yeast", "¼ cup vegetable oil", "3 cups bread flour", "1 teaspoon salt"], "direction": ["Place the water, sugar and yeast in the pan of the bread machine. Let the yeast dissolve and foam for 10 minutes. Add the oil, flour and salt to the yeast. Select Basic or White Bread setting, and press Start."], "facts": "174 calories; protein 4.3g 9% DV; carbohydrates 27.1g 9% DV; fat 5.2g 8% DV; cholesterolmg; sodium 195.4mg 8% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/241917/quick-cinnamon-rolls/", "name": "Quick Cinnamon Rolls", "summary": "\nQuick and easy cinnamon rolls from scratch, with no yeast, proofing, or kneading necessary! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7535189.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "18"], ["Yield:", "18 cinnamon rolls"]], "ingredients": ["¼ cup butter, divided  (Optional)"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons melted butter.", "Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands. Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms.", "Turn dough out onto a floured work surface and roll dough into a 1/4-inch thick rectangle. Brush surface of dough with 2 tablespoons melted butter.", "Whisk 1/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough. Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish.", "Bake in the preheated oven until rolls are set, 20 to 25 minutes.", "Beat confectioners' sugar, cream cheese, 1/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth. Top hot cinnamon rolls with cream cheese frosting."], "facts": "223 calories; protein 2.7g 5% DV; carbohydrates 31.6g 10% DV; fat 9.9g 15% DV; cholesterol 36.7mg 12% DV; sodium 262.1mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6815/monkey-bread-i/", "name": "Monkey Bread I", "summary": "\nRefrigerated biscuits with cinnamon bake in a tube pan. My 7 year old daughter, Leah, loves her Monkey Bread. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F546316.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "15"], ["Yield:", "1 10 inch tube pan"]], "ingredients": ["3 (12 ounce) packages refrigerated biscuit dough", "1 cup white sugar", "2 teaspoons ground cinnamon", "½ cup margarine", "1 cup packed brown sugar", "½ cup chopped walnuts", "½ cup raisins"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease one 9 or 10 inch tube/Bundt® pan.", "Mix white sugar and cinnamon in a plastic bag. Cut biscuits into quarters. Shake 6 to 8 biscuit pieces in the sugar cinnamon mix. Arrange pieces in the bottom of the prepared pan. Continue until all biscuits are coated and placed in pan. If using nuts and raisins, arrange them in and among the biscuit pieces as you go along.", "In a small saucepan, melt the margarine with the brown sugar over medium heat. Boil for 1 minute. Pour over the biscuits.", "Bake at 350 degrees F (175 degrees C) for 35 minutes. Let bread cool in pan for 10 minutes, then turn out onto a plate. Do not cut! The bread just pulls apart."], "facts": "418 calories; protein 5.3g 11% DV; carbohydrates 61.5g 20% DV; fat 17.7g 27% DV; cholesterol 0.7mg; sodium 746.2mg 30% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/22539/quick-and-easy-yorkshire-pudding/", "name": "Quick and Easy Yorkshire Pudding", "summary": "\nA great, quick and easy recipe for Yorkshire pudding.  Everybody loves 'em! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3911287.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["3  eggs", "1 cup milk", "1 cup all-purpose flour", "2 tablespoons butter"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "In a medium bowl, beat eggs with milk.  Stir in flour.  Set aside.", "Divide butter evenly into the twelve cups of a muffin tin, about 1/2 teaspoon per cup.  Place tin in oven to melt butter, 2 to 5 minutes.  Remove tin from oven, and distribute batter evenly among buttery cups.", "Bake in preheated oven 5 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake 25 minutes more or until puffed and golden."], "facts": "83 calories; protein 3.3g 7% DV; carbohydrates 9g 3% DV; fat 3.7g 6% DV; cholesterol 53.2mg 18% DV; sodium 39.7mg 2% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6874/best-ever-muffins/", "name": "Best Ever Muffins", "summary": "\nStart with this basic recipe, and add one of several different ingredients for a variety of different muffins. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5671166.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2 cups all-purpose flour", "3 teaspoons baking powder", "½ teaspoon salt", "¾ cup white sugar", "1  egg", "1 cup milk", "¼ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Stir together the flour, baking powder, salt and sugar in a large bowl.  Make a well in the center. In a small bowl or 2 cup measuring cup, beat egg with a fork. Stir in milk and oil. Pour all at once into the well in the flour mixture. Mix quickly and lightly with a fork until moistened, but do not beat. The batter will be lumpy. Pour the batter into paper lined muffin pan cups.", "Variations: Blueberry Muffins: Add 1 cup fresh blueberries. Raisin Muffins: Add 1 cup finely chopped raisins. Date Muffins: Add 1 cup finely chopped dates. Cheese Muffins: Fold in 1 cup grated sharp yellow cheese. Bacon Muffins: Fold 1/4 cup crisp cooked bacon, broken into bits.", "Bake for 25 minutes, or until golden."], "facts": "182 calories; protein 3.3g 7% DV; carbohydrates 29.7g 10% DV; fat 5.6g 9% DV; cholesterol 17.1mg 6% DV; sodium 233.4mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/244638/no-yeast-pizza-crust/", "name": "No-Yeast Pizza Crust", "summary": "\nA tasty, quick pizza crust that uses no yeast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548649.jpg", "meta": [["prep:", "15 mins"], ["additional:", "10 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza"]], "ingredients": ["1 ⅓ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup fat-free milk", "2 tablespoons olive oil"], "direction": ["Mix flour, baking powder, and salt together in a bowl; stir in milk and olive oil until a soft dough forms. Turn dough onto a lightly floured surface and knead 10 times. Shape dough into a ball. Cover dough with an inverted bowl and let sit for 10 minutes.", "Roll dough into a 12-inch circle on a baking sheet."], "facts": "112 calories; protein 2.8g 6% DV; carbohydrates 16.9g 6% DV; fat 3.6g 6% DV; cholesterol 0.3mg; sodium 215.8mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6698/moms-zucchini-bread/", "name": "Mom's Zucchini Bread", "summary": "\nReally, really good and moist- my kids eat it as quickly as I can make it.  Bread will freeze well, and keep in refrigerator for weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037957.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "24"], ["Yield:", "2 loaves"]], "ingredients": ["3 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking soda", "1 teaspoon baking powder", "1 tablespoon ground cinnamon", "3  eggs", "1 cup vegetable oil", "2 ¼ cups white sugar", "3 teaspoons vanilla extract", "2 cups grated zucchini", "1 cup chopped walnuts"], "direction": ["Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).", "Sift flour, salt, baking powder, soda, and cinnamon together in a bowl.", "Beat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.", "Bake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool."], "facts": "255 calories; protein 3.3g 7% DV; carbohydrates 32.1g 10% DV; fat 13.1g 20% DV; cholesterol 23.3mg 8% DV; sodium 179.8mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/", "name": "To Die For Blueberry Muffins", "summary": "\nThese muffins are extra large and yummy with the sugary-cinnamon crumb topping. I usually double the recipe and fill the muffin cups just to the top edge for a wonderful extra-generously-sized deli style muffin.  Add extra blueberries too, if you want! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662790.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 large muffins"]], "ingredients": ["1 ½ cups all-purpose flour", "¾ cup white sugar", "½ teaspoon salt", "2 teaspoons baking powder", "⅓ cup vegetable oil", "1  egg", "⅓ cup milk, or more as needed", "1 cup fresh blueberries", "½ cup white sugar", "⅓ cup all-purpose flour", "¼ cup butter, cubed", "1 ½ teaspoons ground cinnamon"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.", "Combine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and add enough milk to reach the 1-cup mark. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.", "To Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.", "Bake for 20 to 25 minutes in the preheated oven, or until done."], "facts": "383 calories; protein 4.3g 9% DV; carbohydrates 56.9g 18% DV; fat 16.1g 25% DV; cholesterol 39.3mg 13% DV; sodium 321.8mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6900/dumplings/", "name": "Dumplings", "summary": "\nMy mother was one of the best cooks I ever knew. When she made stews we mostly found dumplings in them.  We never ate things from packages or microwaves and you sure could taste what food was. That's the only way I cook today -  I don't use any electronic gadgets to cook with except an electric stove. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5011529.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 dumplings"]], "ingredients": ["1 cup all-purpose flour", "2 teaspoons baking powder", "1 teaspoon white sugar", "½ teaspoon salt", "1 tablespoon margarine", "½ cup milk"], "direction": ["Stir together flour, baking powder, sugar, and salt in medium size bowl. Cut in butter until crumbly. Stir in milk to make a soft dough.", "Drop by spoonfuls into boiling stew. Cover and simmer 15 minutes without lifting lid. Serve.", "To make parsley dumplings, add 1 tablespoon parsley flakes to the dry ingredients."], "facts": "105 calories; protein 2.8g 6% DV; carbohydrates 18g 6% DV; fat 2.4g 4% DV; cholesterol 1.6mg 1% DV; sodium 385.8mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17066/janets-rich-banana-bread/", "name": "Janet's Rich Banana Bread", "summary": "\nThis is the moistest banana bread that I have ever tasted. It's also very easy to make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F171761.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "15"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["½ cup butter, melted", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon salt", "½ cup sour cream", "½ cup chopped walnuts", "2  medium bananas, sliced"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.", "In a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely."], "facts": "218 calories; protein 3.2g 6% DV; carbohydrates 27.4g 9% DV; fat 11.1g 17% DV; cholesterol 44.4mg 15% DV; sodium 218.9mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/102151/easy-baking-powder-drop-biscuits/", "name": "Easy Baking Powder Drop Biscuits", "summary": "\nThese are the best breakfast biscuits, easy and perfect for sausage gravy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6054694.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "2 ½ teaspoons baking powder", "½ teaspoon salt", "1 tablespoon white sugar", "½ cup chilled butter, diced", "1 ¼ cups whole milk"], "direction": ["Preheat an oven to 450 degrees F (230 degrees C).", "Mix flour, baking powder, salt, and sugar in a bowl.  Cut in the cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Add milk a little at a time, stirring lightly between additions.", "Drop the batter by spoonfuls onto a cookie sheet, and bake for 12 to 15 minutes, until the tops are golden."], "facts": "163 calories; protein 3.1g 6% DV; carbohydrates 18.4g 6% DV; fat 8.7g 13% DV; cholesterol 22.9mg 8% DV; sodium 263.5mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/42719/banana-muffins-ii/", "name": "Banana Muffins II", "summary": "\nThese delicious banana muffins are easy for kids to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F187952.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 muffins, or 48 mini muffins"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "½ teaspoon salt", "3 large bananas, mashed", "¾ cup white sugar", "1  egg", "⅓ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Coat muffin pans with non-stick spray, or use paper liners. Sift together the flour, baking powder, baking soda, and salt; set aside.", "Combine bananas, sugar, egg, and melted butter in a large bowl. Fold in flour mixture, and mix until smooth. Scoop into muffin pans.", "Bake in preheated oven. Bake mini muffins for 10 to 15 minutes, and large muffins for 25 to 30 minutes. Muffins will spring back when lightly tapped."], "facts": "187 calories; protein 2.6g 5% DV; carbohydrates 32.3g 10% DV; fat 5.8g 9% DV; cholesterol 29.1mg 10% DV; sodium 274.6mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/230482/banana-chocolate-chip-bread/", "name": "Banana Chocolate Chip Bread", "summary": "\nSuper amazing banana bread. Moist and tasty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4516795.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "10"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "3  ripe bananas, mashed", "1 tablespoon milk", "1 teaspoon ground cinnamon, or to taste", "½ cup butter, softened", "1 cup white sugar", "2  eggs", "1 cup semisweet chocolate chips"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass.", "Mix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat butter and sugar in a third bowl until light and fluffy. Add eggs to butter mixture, one at a time, beating well after each addition. Stir banana mixture into butter mixture. Stir in dry mixture until blended. Fold in chocolate chips until just combined. Pour batter into prepared loaf pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing."], "facts": "378 calories; protein 5.1g 10% DV; carbohydrates 58.2g 19% DV; fat 15.6g 24% DV; cholesterol 61.7mg 21% DV; sodium 489.9mg 20% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20075/basic-biscuits/", "name": "Basic Biscuits", "summary": "\nThis is a basic biscuit recipe with baking powder used as the leavening. They're easy to make and go with almost any meal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4471846.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "10"], ["Yield:", "8 to 12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "½ teaspoon salt", "½ cup shortening", "¾ cup milk"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).", "In a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.", "Pour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.", "Turn dough out onto a lightly floured surface and toss with flour until no longer sticky. Roll dough out into a 1/2 inch thick sheet and cut with a floured biscuit or cookie cutter. Press together unused dough and repeat rolling and cutting procedure.", "Place biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes."], "facts": "191 calories; protein 3.2g 6% DV; carbohydrates 20.2g 7% DV; fat 10.9g 17% DV; cholesterol 1.5mg 1% DV; sodium 225mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/231288/debbies-amazing-apple-bread/", "name": "Debbie's Amazing Apple Bread", "summary": "\nI was given this recipe years ago by my friend Debbie. I've had it written down on a torn piece of paper for years and decided today that this recipe needs to be on AllRecipes. It is a moist, sweet, and delicious bread with a crispy crust.  By far my favorite bread recipe! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1052046.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "10"], ["Yield:", "1 loaf"]], "ingredients": ["2  eggs", "2 cups white sugar", "½ cup vegetable oil", "2 teaspoons vanilla extract", "2 cups apples, peeled and diced", "2 cups all-purpose flour", "1 ½ teaspoons salt", "1 teaspoon baking powder", "½ teaspoon ground cinnamon, or more to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.", "Beat eggs, sugar, vegetable oil, and vanilla extract in a mixing bowl; add apples.", "Mix flour, salt, baking powder, and cinnamon in a separate bowl; add to apple mixture and stir just until evenly combined into a thick batter. Pour batter into the prepared loaf pan.", "Bake in the preheated oven for 45 minutes. Cover loaf pan with aluminum foil; continue baking until a toothpick inserted into the center comes out clean, about 15 minutes more. Cool in the pan for 10 minutes before removing to cool completely on a wire rack."], "facts": "373 calories; protein 3.9g 8% DV; carbohydrates 62.9g 20% DV; fat 12.2g 19% DV; cholesterol 37.2mg 12% DV; sodium 412.4mg 17% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/7224/pan-de-muertos-mexican-bread-of-the-dead/", "name": "Pan de Muertos (Mexican Bread of the Dead)", "summary": "\nThis is a version of the bread that is made for the November 2 celebration known as the Dia de los Muertos (Day of the Dead) in Mexico. You can also mold the bread into different shapes like angels and animals. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F286833.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 large round loaf"]], "ingredients": ["¼ cup margarine", "¼ cup milk", "¼ cup warm water (110 degrees F/45 degrees C)", "3 cups all-purpose flour", "1 ¼ teaspoons active dry yeast", "½ teaspoon salt", "2 teaspoons anise seed", "¼ cup white sugar", "2  eggs, beaten", "2 teaspoons orange zest", "¼ cup white sugar", "¼ cup orange juice", "1 tablespoon orange zest", "2 tablespoons white sugar"], "direction": ["Heat the milk and the butter together in a medium saucepan, until the butter melts. Remove from the heat and add them warm water. The mixture should be around 110 degrees F (43 degrees C).", "In a large bowl combine 1 cup of the flour, yeast, salt, anise seed and 1/4 cup of the sugar. Beat in the warm milk mixture then add the eggs and orange zest and beat until well combined. Stir in 1/2 cup of flour and continue adding more flour until the dough is soft.", "Turn the dough out onto a lightly floured surface and knead until smooth and elastic.", "Place the dough into a lightly greased bowl cover with plastic wrap and let rise in a warm place until doubled in size. This will take about 1 to 2 hours. Punch the dough down and shape it into a large round loaf with a round knob on top. Place dough onto a baking sheet, loosely cover with plastic wrap and let rise in a warm place for about 1 hour or until just about doubled in size.", "Bake in a preheated 350 degrees F (175 degrees C) oven for about 35 to 45 minutes. Remove from oven let cool slightly then brush with glaze.", "To make glaze: In a small saucepan combine the 1/4 cup sugar, orange juice and orange zest. Bring to a boil over medium heat and boil for 2 minutes. Brush over top of bread while still warm. Sprinkle glazed bread with white sugar."], "facts": "208 calories; protein 4.8g 10% DV; carbohydrates 35.7g 12% DV; fat 5.1g 8% DV; cholesterol 31.4mg 11% DV; sodium 155.6mg 6% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/7906/chocolate-chip-muffins/", "name": "Chocolate Chip Muffins", "summary": "\nYou won't believe how easily and quickly you can have chocolate chip muffins on the table using this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470819.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2 cups all-purpose flour", "½ cup white sugar", "3 teaspoons baking powder", "½ teaspoon salt", "¾ cup milk", "⅓ cup vegetable oil", "1  egg", "¾ cup mini semi-sweet chocolate chips", "3 tablespoons white sugar", "2 tablespoons brown sugar"], "direction": ["Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.", "In a medium bowl, combine flour, 1/2 cup sugar, baking powder, chocolate chips, and salt; mix well. In a small bowl, combine milk, oil and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.)", "Fill cups 2/3 full.  Sprinkle tops of muffins before baking with a combination of 3 tablespoons sugar and 2 tablespoon brown sugar.", "Bake for 20 to 25 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm."], "facts": "249 calories; protein 3.6g 7% DV; carbohydrates 37.5g 12% DV; fat 10.3g 16% DV; cholesterol 16.7mg 6% DV; sodium 233.1mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/239856/cheddar-cheese-muffins/", "name": "Cheddar Cheese Muffins", "summary": "\nNice bread-like cheese muffins. Not overly cheesy, but feel free to add more. One of my favorites! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5080080.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "12 large muffins"]], "ingredients": ["2 cups all-purpose flour", "½ cup white sugar", "1 tablespoon baking powder", "1 teaspoon salt", "½ teaspoon baking soda", "1 ½ cups shredded Cheddar cheese", "1 cup plain yogurt", "2  eggs, beaten", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease 12 large muffin cups.", "Mix flour, sugar, baking powder, salt, and baking soda together in a large mixing bowl; stir Cheddar cheese into the flour mixture. Pour yogurt, eggs, and butter over the flour mixture; stir until the dry ingredients are just moistened. Spoon the batter into the prepared muffin cups.", "Bake in the preheated oven until the tops just start to lightly brown, 18 to 20 minutes."], "facts": "448 calories; protein 15.7g 31% DV; carbohydrates 52.3g 17% DV; fat 19.7g 30% DV; cholesterol 114.4mg 38% DV; sodium 943mg 38% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20175/scones/", "name": "Scones", "summary": "\nThis is a very simple recipe for scones. You can customize them by adding dried fruit or nuts. Half and half can also be substituted for milk if you wish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5614372.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "8 scones"]], "ingredients": ["3 cups all-purpose flour", "½ cup white sugar", "5 teaspoons baking powder", "½ teaspoon salt", "¾ cup butter", "1  egg, beaten", "1 cup milk"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.", "In a large bowl, combine flour, sugar, baking powder, and salt. Cut in butter. Mix the egg and milk in a small bowl, and stir into flour mixture until moistened.", "Turn dough out onto a lightly floured surface, and knead briefly. Roll dough out into a 1/2 inch thick round. Cut into 8 wedges, and place on the prepared baking sheet.", "Bake 15 minutes in the preheated oven, or until golden brown."], "facts": "397 calories; protein 6.8g 14% DV; carbohydrates 50.6g 16% DV; fat 18.9g 29% DV; cholesterol 71.4mg 24% DV; sodium 594.9mg 24% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/14565/naan/", "name": "Naan", "summary": "\nThis recipe makes the best naan I have tasted outside of an Indian restaurant. I can't make enough of it for my family. I serve it with shish kabobs, but I think they would eat it plain. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1016308.jpg", "meta": [["prep:", "30 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs 23 mins"], ["total:", "3 hrs"], ["Servings:", "14"], ["Yield:", "14 servings"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water", "¼ cup white sugar", "3 tablespoons milk", "1  egg, beaten", "2 teaspoons salt", "4 ½ cups bread flour", "2 teaspoons minced garlic  (Optional)", "¼ cup butter, melted"], "direction": ["In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume.", "Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes.", "During the second rising, preheat grill to high heat.", "At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared."], "facts": "52 calories; protein 0.8g 2% DV; carbohydrates 4.1g 1% DV; fat 3.7g 6% DV; cholesterol 22.3mg 7% DV; sodium 362.7mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/76594/grandmothers-buttermilk-cornbread/", "name": "Grandmother's Buttermilk Cornbread", "summary": "\nThis is my grandmother's cornbread recipe and it's the best - sweet and moist! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb89ef78f-919b-400c-a03d-b205b5a352ac%2F886fcf07-43c1-44d5-8991-1d0151fa7393%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "9"], ["Yield:", "9 servings"]], "ingredients": ["½ cup butter", "⅔ cup white sugar", "2 large eggs", "1 cup buttermilk", "½ teaspoon baking soda", "1 cup cornmeal", "1 cup all-purpose flour", "¼ teaspoon salt"], "direction": ["Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.", "Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.", "Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean."], "facts": "284 calories; protein 4.8g 10% DV; carbohydrates 39.1g 13% DV; fat 12.2g 19% DV; cholesterol 59mg 20% DV; sodium 317.8mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/33157/apple-strudel-muffins/", "name": "Apple Strudel Muffins", "summary": "\nFabulous apple muffins with a delicious cinnamon crumb topping! Give them a try -- you won't be sorry! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F173362.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "20 mins"], ["total:", "1 hr"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon baking soda", "½ teaspoon salt", "½ cup butter", "1 cup white sugar", "2  eggs", "1 ¼ teaspoons vanilla", "1 ½ cups chopped apples", "⅓ cup packed brown sugar", "1 tablespoon all-purpose flour", "⅛ teaspoon ground cinnamon", "1 tablespoon butter"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Grease a 12 cup muffin pan.", "In a medium bowl, mix flour, baking powder, baking soda and salt.", "In a large bowl, beat together butter, sugar and eggs until smooth. Mix in vanilla. Stir in apples, and gradually blend in the flour mixture. Spoon the mixture into the prepared muffin pan.", "In a small bowl, mix brown sugar, flour and cinnamon. Cut in butter until mixture is like coarse crumbs. Sprinkle over tops of mixture in muffin pan.", "Bake 20 minutes in the preheated oven, or until a toothpick inserted in the center of a muffin comes out clean. Allow to sit 5 minutes before removing muffins from pan. Cool on a wire rack."], "facts": "264 calories; protein 3.4g 7% DV; carbohydrates 41.4g 13% DV; fat 9.7g 15% DV; cholesterol 53.9mg 18% DV; sodium 254.6mg 10% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/24700/churros/", "name": "Churros", "summary": "\nThese Mexican fritters are very common at fairs. In my border hometown, the line at this stand is always overwhelming. People wait hours in line just to get a taste of these churros. I have run across several recipes but this is the best one by far. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup water", "2 ½ tablespoons white sugar", "½ teaspoon salt", "2 tablespoons vegetable oil", "1 cup all-purpose flour", "2 quarts oil for frying", "½ cup white sugar, or to taste", "1 teaspoon ground cinnamon"], "direction": ["In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball.", "Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels.", "Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."], "facts": "691 calories; protein 3.3g 7% DV; carbohydrates 57.1g 18% DV; fat 51.1g 79% DV; cholesterolmg; sodium 293.1mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/220943/chef-johns-buttermilk-biscuits/", "name": "Chef John's Buttermilk Biscuits", "summary": "\nThis deceptively simple recipe can come out a million different ways with some very minor variations on the ingredients and amounts. This one's my favorite - flaky, but not dry; chewy, but not tough; crisp in just the right spots. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5909221.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "¼ teaspoon baking soda", "7 tablespoons unsalted butter, chilled in freezer and cut into thin slices", "¾ cup cold buttermilk", "2 tablespoons buttermilk for brushing"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Line a baking sheet with a silicone baking mat or parchment paper.", "Whisk flour, baking powder, salt, and baking soda together in a large bowl.", "Cut butter into flour mixture with a pastry blender until the mixture resembles coarse crumbs, about 5 minutes.", "Make a well in the center of butter and flour mixture. Pour in 3/4 cup buttermilk; stir until just combined.", "Turn dough onto a floured work surface, pat together into a rectangle.", "Fold the rectangle in thirds. Turn dough a half turn, gather any crumbs, and flatten back into a rectangle. Repeat twice more, folding and pressing dough a total of three times.", "Roll dough on a floured surface to about 1/2 inch thick.", "Cut out 12 biscuits using a 2 1/2-inch round biscuit cutter.", "Transfer biscuits to the prepared baking sheet. Press an indent into the top of each biscuit with your thumb.", "Brush the tops of biscuits with 2 tablespoons buttermilk.", "Bake in the preheated oven until browned, about 15 minutes."], "facts": "143 calories; protein 2.8g 6% DV; carbohydrates 17g 6% DV; fat 7.1g 11% DV; cholesterol 18.5mg 6% DV; sodium 321.3mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/215378/classic-dinner-rolls/", "name": "Classic Dinner Rolls", "summary": "\nWho can resist warm yeast rolls, fresh from the oven? \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1024104.jpg", "meta": [["prep:", "40 mins"], ["cook:", "20 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "12 rolls"]], "ingredients": ["2 cups all-purpose flour, or more if needed", "1 envelope Fleischmann's® RapidRise Yeast", "2 tablespoons sugar", "½ teaspoon salt", "½ cup milk", "¼ cup water", "2 tablespoons butter OR margarine"], "direction": ["Combine 3/4 cup flour, undissolved yeast, sugar and salt in a large bowl. Heat milk, water and butter until very warm (120 degrees to 130 degrees F). Add to flour mixture. Beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add 1/4 cup flour; beat 2 minutes at high speed. Stir in enough remaining flour to make soft dough. Knead on lightly floured surface until smooth and elastic, about 8 to 10 minutes. Cover; let rest 10 minutes.", "Divide dough into 12 equal pieces; shape into balls. Place in greased 8-inch round pan. Cover; let rise in warm, draft-free place until doubled in size, about 30 minutes.", "Bake in preheated 375 degrees F oven for 20 minutes or until done. Remove from pan; brush with additional melted butter, if desired. Serve warm."], "facts": "108 calories; protein 2.8g 6% DV; carbohydrates 18.5g 6% DV; fat 2.3g 4% DV; cholesterol 5.9mg 2% DV; sodium 115.3mg 5% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/260622/red-lobster-cheddar-biscuits/", "name": "Red Lobster® Cheddar Biscuits", "summary": "\nI made these with baked potato soup and loved it. Great addition! I gave them to a friend and he said they tasted just like the ones at Red Lobster®. The recipe will yield more if made into smaller biscuits. They are best served fresh out of the oven. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4571413.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 biscuits"]], "ingredients": ["2 cups all-purpose flour", "1 cup shredded Cheddar cheese", "1 tablespoon baking powder", "1 teaspoon salt", "½ teaspoon garlic powder", "⅔ cup milk", "⅓ cup butter", "1  large egg", "2 tablespoons melted butter"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a baking sheet.", "Combine flour, Cheddar cheese, baking powder, salt, and garlic powder in a bowl.", "Combine milk, 1/3 cup butter, and egg in a separate bowl. Mix into the flour mixture until chunky; be careful not to over-mix the batter.", "Drop batter by tablespoonfuls onto the prepared baking sheet.", "Bake in the preheated oven for 10 minutes. Brush melted butter on top and continue baking until golden brown, about 5 minutes more."], "facts": "379 calories; protein 11.1g 22% DV; carbohydrates 34g 11% DV; fat 22.1g 34% DV; cholesterol 90.2mg 30% DV; sodium 795.9mg 32% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/67937/extreme-banana-nut-bread-ebnb/", "name": "Extreme Banana Nut Bread 'EBNB'", "summary": "\nThis is my mom's dense, excellent, and definitely unhealthy banana nut bread recipe.  It's always completely gone in minutes.  This is great at parties, but hazardous at home.  HEALTH WARNINGS: EBNB may be habit forming. A very flexible recipe that will accommodate changes based on what you have on hand.  Use any type of fat in place of the butter, such as shortening or oil. It works with either brown or white sugar too. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1392234.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "24"], ["Yield:", "2 - 9x5 inch loaves"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon salt", "2 teaspoons baking soda", "1 cup butter or margarine", "2 cups white sugar", "2 cups mashed overripe bananas", "4  eggs, beaten", "1 cup chopped walnuts"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5 inch loaf pans.", "Sift the flour, salt and baking soda into a large bowl. In a separate bowl, mix together the butter or margarine and sugar until smooth. Stir in the bananas, eggs, and walnuts until well blended. Pour the wet ingredients into the dry mixture, and stir just until blended. Divide the batter evenly between the two loaf pans.", "Bake for 60 to 70 minutes in the preheated oven, until a knife inserted into the crown of the loaf comes out clean. Let the loaves cool in the pans for at least 5 minutes, then turn out onto a cooling rack, and cool completely. Wrap in aluminum foil to keep in the moisture. Ideally, refrigerate the loaves for 2 hours or more before serving."], "facts": "232 calories; protein 3.2g 6% DV; carbohydrates 29.7g 10% DV; fat 11.9g 18% DV; cholesterol 51.3mg 17% DV; sodium 268.4mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6773/simple-whole-wheat-bread/", "name": "Simple Whole Wheat Bread", "summary": "\nSimply a great-tasting and easy-to-make whole wheat bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012491.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "36"], ["Yield:", "3 loaves"]], "ingredients": ["3 cups warm water (110 degrees F/45 degrees C)", "2 (.25 ounce) packages active dry yeast", "⅓ cup honey", "5 cups bread flour", "3 tablespoons butter, melted", "⅓ cup honey", "1 tablespoon salt", "3 ½ cups whole wheat flour", "2 tablespoons butter, melted"], "direction": ["In a large bowl, mix warm water, yeast, and 1/3 cup honey.  Add 5 cups white bread flour, and stir to combine.  Let set for 30 minutes, or until big and bubbly.", "Mix in 3 tablespoons melted butter, 1/3 cup honey, and salt.  Stir in 2 cups whole wheat flour.  Flour a flat surface and knead with whole wheat flour until not real sticky - just pulling away from the counter, but still sticky to touch.  This may take an additional 2 to 4 cups of whole wheat flour.  Place in a greased bowl, turning once to coat the surface of the dough.  Cover with a dishtowel.  Let rise in a warm place until doubled.", "Punch down, and divide into 3 loaves.  Place in greased 9 x 5 inch loaf pans, and allow to rise until dough has topped the pans by one inch.", "Bake at 350 degrees F (175 degrees C) for 25 to 30 minutes; do not overbake.  Lightly brush the tops of loaves with 2 tablespoons melted butter or margarine when done to prevent crust from getting hard.  Cool completely."], "facts": "134 calories; protein 3.8g 8% DV; carbohydrates 25.9g 8% DV; fat 2.1g 3% DV; cholesterol 4.2mg 1% DV; sodium 207.1mg 8% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/25224/classic-bran-muffins/", "name": "Classic Bran Muffins", "summary": "\nA delicious source of fiber! My family have them almost every morning. Great healthy muffins! You may substitute dates for the raisins if you wish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470964.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["1 ½ cups wheat bran", "1 cup buttermilk", "⅓ cup vegetable oil", "1  egg", "⅔ cup brown sugar", "½ teaspoon vanilla extract", "1 cup all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup raisins"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or line with paper muffin liners.", "Mix together wheat bran and buttermilk; let stand for 10 minutes.", "Beat together oil, egg, sugar and vanilla and add to buttermilk/bran mixture. Sift together flour, baking soda, baking powder and salt. Stir flour mixture into buttermilk mixture, until just blended. Fold in raisins and spoon batter into prepared muffin tins.", "Bake for 15 to 20 minutes, or until a toothpick inserted into the center of a muffin comes out clean. Cool and enjoy!"], "facts": "168 calories; protein 3.5g 7% DV; carbohydrates 25.6g 8% DV; fat 7.1g 11% DV; cholesterol 16.3mg 5% DV; sodium 262.2mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/260540/chef-johns-sourdough-bread/", "name": "Chef John's Sourdough Bread", "summary": "\nMaking your own sourdough bread does take a while, but the amount of actual work is minimal--and the bread you'll get is spectacular! See the footnote link to how to make the sourdough starter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6103033.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "21 hrs"], ["total:", "21 hrs 35 mins"], ["Servings:", "8"], ["Yield:", "1 loaf"]], "ingredients": ["100 grams sourdough starter", "250 grams water", "8 grams kosher salt", "394 grams bread flour", "rice flour for bread form (banneton)", "1 10-inch banneton (proofing basket)"], "direction": ["Measure out starter into a bowl. Add water, salt, and bread flour. Mix until ingredients are well blended into a very sticky dough. Cover with aluminum foil; let rest 4 hours at 70 to 75 degrees F (22 degrees C).", "With wet hands, fold dough over on itself 3 or 4 times. Cover with foil and allow dough to ferment for 2 more hours.", "Generously dust a bread form with rice flour (see Chef's Note for banneton substitution).", "Scrape dough out onto a lightly floured work surface (you can use bread flour or all-purpose flour). Shape into a ball with a smooth, unbroken surface, using just enough flour on the surface to keep it from sticking. Transfer smooth-side down to banneton. Pinch together the rougher edges of the surface toward the center to smooth them and maintain the round ball shape.", "Cover and refrigerate 12 hours to slow the fermentation process.", "Remove loaf from the refrigerator and let it rise in a warm spot until the dough springs slowly back and retains a slight indentation when poked gently with a finger, about 3 to 5 hours.", "Preheat oven to 450 degrees F (230 degrees C). Line a rimmed baking sheet with parchment paper.", "Dust surface of dough with flour. Gently invert banneton over the baking sheet and transfer dough onto parchment paper. Gently brush off excess rice flour. Score the top of the dough about 1/8-inch deep with a sharp knife to create a shallow slit running across the center. Mist entire surface lightly with water.", "Bake in the center of preheated oven until beautifully browned, 25 to 30 minutes.", "Transfer to a rack to cool completely (do not slice loaf while it is still warm)."], "facts": "205 calories; protein 6.9g 14% DV; carbohydrates 41.2g 13% DV; fat 0.9g 1% DV; cholesterol 0.1mg; sodium 404.8mg 16% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/9353/strawberry-bread/", "name": "Strawberry Bread", "summary": "\nThis is wonderful hot or cold, for breakfast or as a dessert. A definite family favorite! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F836956.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "24"], ["Yield:", "2 9-inch loaves"]], "ingredients": ["2 cups fresh strawberries", "3 ⅛ cups all-purpose flour", "2 cups white sugar", "1 tablespoon ground cinnamon", "1 teaspoon salt", "1 teaspoon baking soda", "1 ¼ cups vegetable oil", "4  eggs, beaten", "1 ¼ cups chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Butter and flour two 9 x 5-inch loaf pans.", "Slice strawberries and place in medium-sized bowl. Sprinkle lightly with sugar, and set aside while preparing batter.", "Combine flour, sugar, cinnamon, salt and baking soda in large bowl; mix well. Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans.", "Bake in preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately). Let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing."], "facts": "281 calories; protein 3.3g 7% DV; carbohydrates 31.2g 10% DV; fat 16.6g 26% DV; cholesterol 31mg 10% DV; sodium 161.5mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/24932/whole-wheat-beer-bread/", "name": "Whole Wheat Beer Bread", "summary": "\nGood with soups, chili. Makes excellent toast. Flavor of bread will change, depending on type of beer used. Loaf comes out looking textured on top. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F390936.jpg", "meta": [["prep:", "10 mins"], ["cook:", "50 mins"], ["total:", "1 hr"], ["Servings:", "12"], ["Yield:", "1 - 9x5 inch loaf"]], "ingredients": ["1 ½ cups all-purpose flour", "1 ½ cups whole wheat flour", "4 ½ teaspoons baking powder", "1 ½ teaspoons salt", "⅓ cup packed brown sugar", "1 (12 fluid ounce) can or bottle beer"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large mixing bowl, combine all-purpose flour, whole wheat flour, baking powder, salt and brown sugar. Pour in beer, stir until a stiff batter is formed. It may be necessary to mix dough with your hands. Scrape dough into  prepared loaf pan.", "Bake in preheated oven for 50 to 60 minutes, until a toothpick inserted into center of the loaf comes out clean."], "facts": "144 calories; protein 3.8g 8% DV; carbohydrates 30.2g 10% DV; fat 0.4g 1% DV; cholesterolmg; sodium 429.5mg 17% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/270860/garlic-naan/", "name": "Garlic Naan", "summary": "\nThough restaurant naan is usually cooked in the intense heat of the tandoor oven, you can pull off this homemade version using a hot cast iron skillet. When cooked at the proper temperature, the naan will develop blistered bubbles with a lovely golden-black char. Reward yourself for a job well done by sopping it in copious amounts of curry. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6703829.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 25 mins"], ["total:", "3 hrs 10 mins"], ["Servings:", "6"], ["Yield:", "6 naan"]], "ingredients": ["½ cup warm water", "1 teaspoon white sugar", "1 (.25 ounce) package active dry yeast"], "direction": ["Combine water, sugar, and yeast in a bowl. Let stand until yeast softens and forms a creamy foam, about 15 minutes.", "In the meantime, heat butter in a pan over medium heat until melted and sizzling. Quickly mix in garlic. Remove garlic butter from heat and set aside until ready to use.", "Add yogurt, bread flour, salt, and 1 tablespoon of the garlic butter to the yeast mixture. Stir with a wooden spoon until a shaggy dough forms. Knead by hand until dough pulls away from the sides of the bowl, adding more water or flour as needed. Turn dough out onto the counter and continue kneading into a smooth ball, 3 to 4 minutes.", "Place dough in a large bowl. Coat with a few more drizzles of garlic butter. Cover and let rise until doubled in volume, about 2 hours.", "Punch down dough and turn out onto the counter. Shape into a rough rectangle and cut into 6 pieces. Roll each piece into a ball and lightly dust with flour. Cover with plastic wrap and proof until slightly puffy, 15 to 20 minutes.", "Roll each piece into an oval about 1/8 inch thick. Sprinkle some cilantro on top and press lightly to adhere.", "Preheat a cast iron skillet until very, very hot, about 5 minutes. Cook each naan until large bubbles form, 1 to 2 minutes. Flip over, press gently, and cook until bubbles on the bottom are charred, 2 to 3 minutes more.", "Brush naan with more garlic butter before serving."], "facts": "227 calories; protein 6g 12% DV; carbohydrates 31.3g 10% DV; fat 8.6g 13% DV; cholesterol 20.9mg 7% DV; sodium 384.7mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/222337/brown-butter-pineapple-corn-muffins/", "name": "Brown Butter Pineapple Corn Muffins", "summary": "\nWhen you're talking about cornbread, you're also talking about a big bowl of chili, and nothing balances that big spoon in one hand like a warm corn muffin in the other. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F862424.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "1 hr 5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["½ cup unsalted butter", "¾ cup chopped dried sweetened pineapple", "1 cup all-purpose flour", "1 cup yellow cornmeal", "½ teaspoon baking soda", "½ teaspoon salt", "1 cup buttermilk", "2  large eggs"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Line a muffin pan with paper muffin liners, and lightly spray liners with cooking spray.", "Melt butter in a heavy saucepan over medium heat until golden brown. Remove from heat and stir in pineapple. Set aside to steep for 20 minutes.", "Whisk flour, cornmeal, baking soda, and salt until combined. Set aside.", "Combine buttermilk, eggs, and pineapple mixture in a large bowl. Whisk until smooth, about 1 minute. Add flour mixture to buttermilk mixture; whisk until just combined.", "Divide batter evenly between the prepared muffin cups and bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 25 minutes. Cool in the pan for 5 minutes before removing to cool completely on a wire rack."], "facts": "195 calories; protein 4g 8% DV; carbohydrates 24.1g 8% DV; fat 9.2g 14% DV; cholesterol 52.2mg 17% DV; sodium 185.6mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6833/burger-or-hot-dog-buns/", "name": "Burger or Hot Dog Buns", "summary": "\nThis recipe can be used to make either hamburger buns or hot dog buns. My husband says they are 'top of the line.' Nice and soft. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1106883.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["1 cup milk", "½ cup water", "¼ cup butter", "4 ½ cups all-purpose flour", "1 (.25 ounce) package instant yeast", "2 tablespoons white sugar", "1 ½ teaspoons salt", "1  egg"], "direction": ["In a small saucepan, heat milk, water and butter until very warm, 120 degrees F (50 degrees C).", "In a large bowl, mix together 1 3/4 cup flour, yeast, sugar and salt. Mix milk mixture into flour mixture, and then mix in egg. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes.", "Divide dough into 12 equal pieces. Shape into smooth balls, and place on a greased baking sheet. Flatten slightly. Cover, and let rise for 30 to 35 minutes.", "Bake at 400 degrees F (200 degrees C) for 10 to 12 minutes, or until golden brown.", "For Hot Dog Buns:  Shape each piece into a 6x4 inch rectangle. Starting with the longer side, roll up tightly, and pinch edges and ends to seal. Let rise about 20 to 25 minutes. Bake as above. These buns are pretty big. I usually make 16 instead of 12."], "facts": "230 calories; protein 6.3g 13% DV; carbohydrates 39.1g 13% DV; fat 5.1g 8% DV; cholesterol 27.3mg 9% DV; sodium 333.6mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/157642/homemade-flour-tortillas/", "name": "Homemade Flour Tortillas", "summary": "\nTraditional flour tortillas - homemade and much better than store bought. Do not substitute vegetable oil or shortening for the lard. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F663757.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["4 cups all-purpose flour", "1 teaspoon salt", "2 teaspoons baking powder", "2 tablespoons lard", "1 ½ cups water"], "direction": ["Whisk the flour, salt, and baking powder together in a mixing bowl. Mix in the lard with your fingers until the flour resembles cornmeal. Add the water and mix until the dough comes together; place on a lightly floured surface and knead a few minutes until smooth and elastic. Divide the dough into 24 equal pieces and roll each piece into a ball.", "Preheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough."], "facts": "86 calories; protein 2.2g 4% DV; carbohydrates 16g 5% DV; fat 1.3g 2% DV; cholesterol 1mg; sodium 138.4mg 6% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0ebabff6-3872-4b38-ad70-898e0c409522%2F7df60bf0-b98a-4f9a-9936-8bf1a6a4b885%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/", "name": "Downeast Maine Pumpkin Bread", "summary": "\nThis is a great old Maine recipe, moist and spicy. The bread actually tastes even better the day after it is baked. Great for holiday gift giving! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4567827.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "24"], ["Yield:", "3 - 7x3 inch loaf pans"]], "ingredients": ["1 (15 ounce) can pumpkin puree", "4  eggs", "1 cup vegetable oil", "⅔ cup water", "3 cups white sugar", "3 ½ cups all-purpose flour", "2 teaspoons baking soda", "1 ½ teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "½ teaspoon ground cloves", "¼ teaspoon ground ginger"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.", "In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.", "Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."], "facts": "263 calories; protein 3.1g 6% DV; carbohydrates 40.6g 13% DV; fat 10.3g 16% DV; cholesterol 31mg 10% DV; sodium 305.4mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20171/quick-and-easy-pizza-crust/", "name": "Quick and Easy Pizza Crust", "summary": "\nThis is a great recipe when you don't want to wait for the dough to rise.  You just mix it and allow it to rest for 5 minutes and then it's ready to go!!  It yields a soft, chewy crust.  For a real treat, I recommend you use bread flour and bake it on a pizza stone, but all-purpose flour works well too. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F83108818-1b7b-4971-b363-c924665417d7%2Fd1a0f6a1-5e24-41f9-8645-9d86c4c592ba%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza crust"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "1 cup warm water (110 degrees F/45 degrees C)", "2 ½ cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.", "Stir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes.", "Turn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving."], "facts": "170 calories; protein 4.8g 10% DV; carbohydrates 28.1g 9% DV; fat 4g 6% DV; cholesterolmg; sodium 292.8mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17891/golden-sweet-cornbread/", "name": "Golden Sweet Cornbread", "summary": "\nIf you like sweet cornbread, this is the recipe for you! My mom made this for me as a child, and now it's my family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F307059.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 - 9 inch round pan"]], "ingredients": ["1 cup all-purpose flour", "1 cup yellow cornmeal", "⅔ cup white sugar", "1 teaspoon salt", "3 ½ teaspoons baking powder", "1  egg", "1 cup milk", "⅓ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray or lightly grease a 9 inch round cake pan.", "In a large bowl, combine flour, cornmeal, sugar, salt and baking powder. Stir in egg, milk and vegetable oil until well combined. Pour batter into prepared pan.", "Bake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the loaf comes out clean."], "facts": "189 calories; protein 3.1g 6% DV; carbohydrates 28.2g 9% DV; fat 7.4g 11% DV; cholesterol 17.1mg 6% DV; sodium 353.9mg 14% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/241707/joys-easy-banana-bread/", "name": "Joy's Easy Banana Bread", "summary": "\nThis easy banana bread recipe is quick to prepare, and everyone always comes back for seconds! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2226688.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "10"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["3  ripe bananas, mashed", "1 cup white sugar", "1  egg", "¼ cup melted butter", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.", "Combine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. Stir salt into batter. Pour batter into the prepared loaf pan.", "Bake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour."], "facts": "225 calories; protein 3g 6% DV; carbohydrates 42.4g 14% DV; fat 5.4g 8% DV; cholesterol 30.8mg 10% DV; sodium 398.8mg 16% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17215/best-bread-machine-bread/", "name": "Best Bread Machine Bread", "summary": "\nThis recipe is easy and foolproof. It makes a very soft and tasty loaf of bread with a flaky crust. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5506039.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "1 - 1 1/2 pound loaf"]], "ingredients": ["1 cup warm water (110 degrees F/45 degrees C)", "2 tablespoons white sugar", "1 (.25 ounce) package bread machine yeast", "¼ cup vegetable oil", "3 cups bread flour", "1 teaspoon salt"], "direction": ["Place the water, sugar and yeast in the pan of the bread machine. Let the yeast dissolve and foam for 10 minutes. Add the oil, flour and salt to the yeast. Select Basic or White Bread setting, and press Start."], "facts": "174 calories; protein 4.3g 9% DV; carbohydrates 27.1g 9% DV; fat 5.2g 8% DV; cholesterolmg; sodium 195.4mg 8% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/241917/quick-cinnamon-rolls/", "name": "Quick Cinnamon Rolls", "summary": "\nQuick and easy cinnamon rolls from scratch, with no yeast, proofing, or kneading necessary! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7535189.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "18"], ["Yield:", "18 cinnamon rolls"]], "ingredients": ["¼ cup butter, divided  (Optional)"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons melted butter.", "Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands. Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms.", "Turn dough out onto a floured work surface and roll dough into a 1/4-inch thick rectangle. Brush surface of dough with 2 tablespoons melted butter.", "Whisk 1/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough. Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish.", "Bake in the preheated oven until rolls are set, 20 to 25 minutes.", "Beat confectioners' sugar, cream cheese, 1/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth. Top hot cinnamon rolls with cream cheese frosting."], "facts": "223 calories; protein 2.7g 5% DV; carbohydrates 31.6g 10% DV; fat 9.9g 15% DV; cholesterol 36.7mg 12% DV; sodium 262.1mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6815/monkey-bread-i/", "name": "Monkey Bread I", "summary": "\nRefrigerated biscuits with cinnamon bake in a tube pan. My 7 year old daughter, Leah, loves her Monkey Bread. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F546316.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "15"], ["Yield:", "1 10 inch tube pan"]], "ingredients": ["3 (12 ounce) packages refrigerated biscuit dough", "1 cup white sugar", "2 teaspoons ground cinnamon", "½ cup margarine", "1 cup packed brown sugar", "½ cup chopped walnuts", "½ cup raisins"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease one 9 or 10 inch tube/Bundt® pan.", "Mix white sugar and cinnamon in a plastic bag. Cut biscuits into quarters. Shake 6 to 8 biscuit pieces in the sugar cinnamon mix. Arrange pieces in the bottom of the prepared pan. Continue until all biscuits are coated and placed in pan. If using nuts and raisins, arrange them in and among the biscuit pieces as you go along.", "In a small saucepan, melt the margarine with the brown sugar over medium heat. Boil for 1 minute. Pour over the biscuits.", "Bake at 350 degrees F (175 degrees C) for 35 minutes. Let bread cool in pan for 10 minutes, then turn out onto a plate. Do not cut! The bread just pulls apart."], "facts": "418 calories; protein 5.3g 11% DV; carbohydrates 61.5g 20% DV; fat 17.7g 27% DV; cholesterol 0.7mg; sodium 746.2mg 30% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/22539/quick-and-easy-yorkshire-pudding/", "name": "Quick and Easy Yorkshire Pudding", "summary": "\nA great, quick and easy recipe for Yorkshire pudding.  Everybody loves 'em! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3911287.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["3  eggs", "1 cup milk", "1 cup all-purpose flour", "2 tablespoons butter"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "In a medium bowl, beat eggs with milk.  Stir in flour.  Set aside.", "Divide butter evenly into the twelve cups of a muffin tin, about 1/2 teaspoon per cup.  Place tin in oven to melt butter, 2 to 5 minutes.  Remove tin from oven, and distribute batter evenly among buttery cups.", "Bake in preheated oven 5 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake 25 minutes more or until puffed and golden."], "facts": "83 calories; protein 3.3g 7% DV; carbohydrates 9g 3% DV; fat 3.7g 6% DV; cholesterol 53.2mg 18% DV; sodium 39.7mg 2% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6874/best-ever-muffins/", "name": "Best Ever Muffins", "summary": "\nStart with this basic recipe, and add one of several different ingredients for a variety of different muffins. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5671166.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2 cups all-purpose flour", "3 teaspoons baking powder", "½ teaspoon salt", "¾ cup white sugar", "1  egg", "1 cup milk", "¼ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Stir together the flour, baking powder, salt and sugar in a large bowl.  Make a well in the center. In a small bowl or 2 cup measuring cup, beat egg with a fork. Stir in milk and oil. Pour all at once into the well in the flour mixture. Mix quickly and lightly with a fork until moistened, but do not beat. The batter will be lumpy. Pour the batter into paper lined muffin pan cups.", "Variations: Blueberry Muffins: Add 1 cup fresh blueberries. Raisin Muffins: Add 1 cup finely chopped raisins. Date Muffins: Add 1 cup finely chopped dates. Cheese Muffins: Fold in 1 cup grated sharp yellow cheese. Bacon Muffins: Fold 1/4 cup crisp cooked bacon, broken into bits.", "Bake for 25 minutes, or until golden."], "facts": "182 calories; protein 3.3g 7% DV; carbohydrates 29.7g 10% DV; fat 5.6g 9% DV; cholesterol 17.1mg 6% DV; sodium 233.4mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/244638/no-yeast-pizza-crust/", "name": "No-Yeast Pizza Crust", "summary": "\nA tasty, quick pizza crust that uses no yeast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548649.jpg", "meta": [["prep:", "15 mins"], ["additional:", "10 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza"]], "ingredients": ["1 ⅓ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup fat-free milk", "2 tablespoons olive oil"], "direction": ["Mix flour, baking powder, and salt together in a bowl; stir in milk and olive oil until a soft dough forms. Turn dough onto a lightly floured surface and knead 10 times. Shape dough into a ball. Cover dough with an inverted bowl and let sit for 10 minutes.", "Roll dough into a 12-inch circle on a baking sheet."], "facts": "112 calories; protein 2.8g 6% DV; carbohydrates 16.9g 6% DV; fat 3.6g 6% DV; cholesterol 0.3mg; sodium 215.8mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6698/moms-zucchini-bread/", "name": "Mom's Zucchini Bread", "summary": "\nReally, really good and moist- my kids eat it as quickly as I can make it.  Bread will freeze well, and keep in refrigerator for weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037957.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "24"], ["Yield:", "2 loaves"]], "ingredients": ["3 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking soda", "1 teaspoon baking powder", "1 tablespoon ground cinnamon", "3  eggs", "1 cup vegetable oil", "2 ¼ cups white sugar", "3 teaspoons vanilla extract", "2 cups grated zucchini", "1 cup chopped walnuts"], "direction": ["Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).", "Sift flour, salt, baking powder, soda, and cinnamon together in a bowl.", "Beat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.", "Bake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool."], "facts": "255 calories; protein 3.3g 7% DV; carbohydrates 32.1g 10% DV; fat 13.1g 20% DV; cholesterol 23.3mg 8% DV; sodium 179.8mg 7% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/", "name": "To Die For Blueberry Muffins", "summary": "\nThese muffins are extra large and yummy with the sugary-cinnamon crumb topping. I usually double the recipe and fill the muffin cups just to the top edge for a wonderful extra-generously-sized deli style muffin.  Add extra blueberries too, if you want! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662790.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 large muffins"]], "ingredients": ["1 ½ cups all-purpose flour", "¾ cup white sugar", "½ teaspoon salt", "2 teaspoons baking powder", "⅓ cup vegetable oil", "1  egg", "⅓ cup milk, or more as needed", "1 cup fresh blueberries", "½ cup white sugar", "⅓ cup all-purpose flour", "¼ cup butter, cubed", "1 ½ teaspoons ground cinnamon"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.", "Combine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and add enough milk to reach the 1-cup mark. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.", "To Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.", "Bake for 20 to 25 minutes in the preheated oven, or until done."], "facts": "383 calories; protein 4.3g 9% DV; carbohydrates 56.9g 18% DV; fat 16.1g 25% DV; cholesterol 39.3mg 13% DV; sodium 321.8mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6900/dumplings/", "name": "Dumplings", "summary": "\nMy mother was one of the best cooks I ever knew. When she made stews we mostly found dumplings in them.  We never ate things from packages or microwaves and you sure could taste what food was. That's the only way I cook today -  I don't use any electronic gadgets to cook with except an electric stove. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5011529.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 dumplings"]], "ingredients": ["1 cup all-purpose flour", "2 teaspoons baking powder", "1 teaspoon white sugar", "½ teaspoon salt", "1 tablespoon margarine", "½ cup milk"], "direction": ["Stir together flour, baking powder, sugar, and salt in medium size bowl. Cut in butter until crumbly. Stir in milk to make a soft dough.", "Drop by spoonfuls into boiling stew. Cover and simmer 15 minutes without lifting lid. Serve.", "To make parsley dumplings, add 1 tablespoon parsley flakes to the dry ingredients."], "facts": "105 calories; protein 2.8g 6% DV; carbohydrates 18g 6% DV; fat 2.4g 4% DV; cholesterol 1.6mg 1% DV; sodium 385.8mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/17066/janets-rich-banana-bread/", "name": "Janet's Rich Banana Bread", "summary": "\nThis is the moistest banana bread that I have ever tasted. It's also very easy to make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F171761.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "15"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["½ cup butter, melted", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon salt", "½ cup sour cream", "½ cup chopped walnuts", "2  medium bananas, sliced"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.", "In a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely."], "facts": "218 calories; protein 3.2g 6% DV; carbohydrates 27.4g 9% DV; fat 11.1g 17% DV; cholesterol 44.4mg 15% DV; sodium 218.9mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/102151/easy-baking-powder-drop-biscuits/", "name": "Easy Baking Powder Drop Biscuits", "summary": "\nThese are the best breakfast biscuits, easy and perfect for sausage gravy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6054694.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "2 ½ teaspoons baking powder", "½ teaspoon salt", "1 tablespoon white sugar", "½ cup chilled butter, diced", "1 ¼ cups whole milk"], "direction": ["Preheat an oven to 450 degrees F (230 degrees C).", "Mix flour, baking powder, salt, and sugar in a bowl.  Cut in the cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Add milk a little at a time, stirring lightly between additions.", "Drop the batter by spoonfuls onto a cookie sheet, and bake for 12 to 15 minutes, until the tops are golden."], "facts": "163 calories; protein 3.1g 6% DV; carbohydrates 18.4g 6% DV; fat 8.7g 13% DV; cholesterol 22.9mg 8% DV; sodium 263.5mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/42719/banana-muffins-ii/", "name": "Banana Muffins II", "summary": "\nThese delicious banana muffins are easy for kids to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F187952.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 muffins, or 48 mini muffins"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "½ teaspoon salt", "3 large bananas, mashed", "¾ cup white sugar", "1  egg", "⅓ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Coat muffin pans with non-stick spray, or use paper liners. Sift together the flour, baking powder, baking soda, and salt; set aside.", "Combine bananas, sugar, egg, and melted butter in a large bowl. Fold in flour mixture, and mix until smooth. Scoop into muffin pans.", "Bake in preheated oven. Bake mini muffins for 10 to 15 minutes, and large muffins for 25 to 30 minutes. Muffins will spring back when lightly tapped."], "facts": "187 calories; protein 2.6g 5% DV; carbohydrates 32.3g 10% DV; fat 5.8g 9% DV; cholesterol 29.1mg 10% DV; sodium 274.6mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/230482/banana-chocolate-chip-bread/", "name": "Banana Chocolate Chip Bread", "summary": "\nSuper amazing banana bread. Moist and tasty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4516795.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "10"], ["Yield:", "1 9x5-inch loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "3  ripe bananas, mashed", "1 tablespoon milk", "1 teaspoon ground cinnamon, or to taste", "½ cup butter, softened", "1 cup white sugar", "2  eggs", "1 cup semisweet chocolate chips"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass.", "Mix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat butter and sugar in a third bowl until light and fluffy. Add eggs to butter mixture, one at a time, beating well after each addition. Stir banana mixture into butter mixture. Stir in dry mixture until blended. Fold in chocolate chips until just combined. Pour batter into prepared loaf pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing."], "facts": "378 calories; protein 5.1g 10% DV; carbohydrates 58.2g 19% DV; fat 15.6g 24% DV; cholesterol 61.7mg 21% DV; sodium 489.9mg 20% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20075/basic-biscuits/", "name": "Basic Biscuits", "summary": "\nThis is a basic biscuit recipe with baking powder used as the leavening. They're easy to make and go with almost any meal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4471846.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "10"], ["Yield:", "8 to 12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "½ teaspoon salt", "½ cup shortening", "¾ cup milk"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).", "In a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.", "Pour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.", "Turn dough out onto a lightly floured surface and toss with flour until no longer sticky. Roll dough out into a 1/2 inch thick sheet and cut with a floured biscuit or cookie cutter. Press together unused dough and repeat rolling and cutting procedure.", "Place biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes."], "facts": "191 calories; protein 3.2g 6% DV; carbohydrates 20.2g 7% DV; fat 10.9g 17% DV; cholesterol 1.5mg 1% DV; sodium 225mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/231288/debbies-amazing-apple-bread/", "name": "Debbie's Amazing Apple Bread", "summary": "\nI was given this recipe years ago by my friend Debbie. I've had it written down on a torn piece of paper for years and decided today that this recipe needs to be on AllRecipes. It is a moist, sweet, and delicious bread with a crispy crust.  By far my favorite bread recipe! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1052046.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "10"], ["Yield:", "1 loaf"]], "ingredients": ["2  eggs", "2 cups white sugar", "½ cup vegetable oil", "2 teaspoons vanilla extract", "2 cups apples, peeled and diced", "2 cups all-purpose flour", "1 ½ teaspoons salt", "1 teaspoon baking powder", "½ teaspoon ground cinnamon, or more to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.", "Beat eggs, sugar, vegetable oil, and vanilla extract in a mixing bowl; add apples.", "Mix flour, salt, baking powder, and cinnamon in a separate bowl; add to apple mixture and stir just until evenly combined into a thick batter. Pour batter into the prepared loaf pan.", "Bake in the preheated oven for 45 minutes. Cover loaf pan with aluminum foil; continue baking until a toothpick inserted into the center comes out clean, about 15 minutes more. Cool in the pan for 10 minutes before removing to cool completely on a wire rack."], "facts": "373 calories; protein 3.9g 8% DV; carbohydrates 62.9g 20% DV; fat 12.2g 19% DV; cholesterol 37.2mg 12% DV; sodium 412.4mg 17% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/7224/pan-de-muertos-mexican-bread-of-the-dead/", "name": "Pan de Muertos (Mexican Bread of the Dead)", "summary": "\nThis is a version of the bread that is made for the November 2 celebration known as the Dia de los Muertos (Day of the Dead) in Mexico. You can also mold the bread into different shapes like angels and animals. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F286833.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 large round loaf"]], "ingredients": ["¼ cup margarine", "¼ cup milk", "¼ cup warm water (110 degrees F/45 degrees C)", "3 cups all-purpose flour", "1 ¼ teaspoons active dry yeast", "½ teaspoon salt", "2 teaspoons anise seed", "¼ cup white sugar", "2  eggs, beaten", "2 teaspoons orange zest", "¼ cup white sugar", "¼ cup orange juice", "1 tablespoon orange zest", "2 tablespoons white sugar"], "direction": ["Heat the milk and the butter together in a medium saucepan, until the butter melts. Remove from the heat and add them warm water. The mixture should be around 110 degrees F (43 degrees C).", "In a large bowl combine 1 cup of the flour, yeast, salt, anise seed and 1/4 cup of the sugar. Beat in the warm milk mixture then add the eggs and orange zest and beat until well combined. Stir in 1/2 cup of flour and continue adding more flour until the dough is soft.", "Turn the dough out onto a lightly floured surface and knead until smooth and elastic.", "Place the dough into a lightly greased bowl cover with plastic wrap and let rise in a warm place until doubled in size. This will take about 1 to 2 hours. Punch the dough down and shape it into a large round loaf with a round knob on top. Place dough onto a baking sheet, loosely cover with plastic wrap and let rise in a warm place for about 1 hour or until just about doubled in size.", "Bake in a preheated 350 degrees F (175 degrees C) oven for about 35 to 45 minutes. Remove from oven let cool slightly then brush with glaze.", "To make glaze: In a small saucepan combine the 1/4 cup sugar, orange juice and orange zest. Bring to a boil over medium heat and boil for 2 minutes. Brush over top of bread while still warm. Sprinkle glazed bread with white sugar."], "facts": "208 calories; protein 4.8g 10% DV; carbohydrates 35.7g 12% DV; fat 5.1g 8% DV; cholesterol 31.4mg 11% DV; sodium 155.6mg 6% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/7906/chocolate-chip-muffins/", "name": "Chocolate Chip Muffins", "summary": "\nYou won't believe how easily and quickly you can have chocolate chip muffins on the table using this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470819.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2 cups all-purpose flour", "½ cup white sugar", "3 teaspoons baking powder", "½ teaspoon salt", "¾ cup milk", "⅓ cup vegetable oil", "1  egg", "¾ cup mini semi-sweet chocolate chips", "3 tablespoons white sugar", "2 tablespoons brown sugar"], "direction": ["Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.", "In a medium bowl, combine flour, 1/2 cup sugar, baking powder, chocolate chips, and salt; mix well. In a small bowl, combine milk, oil and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.)", "Fill cups 2/3 full.  Sprinkle tops of muffins before baking with a combination of 3 tablespoons sugar and 2 tablespoon brown sugar.", "Bake for 20 to 25 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm."], "facts": "249 calories; protein 3.6g 7% DV; carbohydrates 37.5g 12% DV; fat 10.3g 16% DV; cholesterol 16.7mg 6% DV; sodium 233.1mg 9% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/239856/cheddar-cheese-muffins/", "name": "Cheddar Cheese Muffins", "summary": "\nNice bread-like cheese muffins. Not overly cheesy, but feel free to add more. One of my favorites! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5080080.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "12 large muffins"]], "ingredients": ["2 cups all-purpose flour", "½ cup white sugar", "1 tablespoon baking powder", "1 teaspoon salt", "½ teaspoon baking soda", "1 ½ cups shredded Cheddar cheese", "1 cup plain yogurt", "2  eggs, beaten", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease 12 large muffin cups.", "Mix flour, sugar, baking powder, salt, and baking soda together in a large mixing bowl; stir Cheddar cheese into the flour mixture. Pour yogurt, eggs, and butter over the flour mixture; stir until the dry ingredients are just moistened. Spoon the batter into the prepared muffin cups.", "Bake in the preheated oven until the tops just start to lightly brown, 18 to 20 minutes."], "facts": "448 calories; protein 15.7g 31% DV; carbohydrates 52.3g 17% DV; fat 19.7g 30% DV; cholesterol 114.4mg 38% DV; sodium 943mg 38% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/20175/scones/", "name": "Scones", "summary": "\nThis is a very simple recipe for scones. You can customize them by adding dried fruit or nuts. Half and half can also be substituted for milk if you wish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5614372.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "8 scones"]], "ingredients": ["3 cups all-purpose flour", "½ cup white sugar", "5 teaspoons baking powder", "½ teaspoon salt", "¾ cup butter", "1  egg, beaten", "1 cup milk"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.", "In a large bowl, combine flour, sugar, baking powder, and salt. Cut in butter. Mix the egg and milk in a small bowl, and stir into flour mixture until moistened.", "Turn dough out onto a lightly floured surface, and knead briefly. Roll dough out into a 1/2 inch thick round. Cut into 8 wedges, and place on the prepared baking sheet.", "Bake 15 minutes in the preheated oven, or until golden brown."], "facts": "397 calories; protein 6.8g 14% DV; carbohydrates 50.6g 16% DV; fat 18.9g 29% DV; cholesterol 71.4mg 24% DV; sodium 594.9mg 24% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/14565/naan/", "name": "Naan", "summary": "\nThis recipe makes the best naan I have tasted outside of an Indian restaurant. I can't make enough of it for my family. I serve it with shish kabobs, but I think they would eat it plain. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1016308.jpg", "meta": [["prep:", "30 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs 23 mins"], ["total:", "3 hrs"], ["Servings:", "14"], ["Yield:", "14 servings"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water", "¼ cup white sugar", "3 tablespoons milk", "1  egg, beaten", "2 teaspoons salt", "4 ½ cups bread flour", "2 teaspoons minced garlic  (Optional)", "¼ cup butter, melted"], "direction": ["In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume.", "Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes.", "During the second rising, preheat grill to high heat.", "At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared."], "facts": "52 calories; protein 0.8g 2% DV; carbohydrates 4.1g 1% DV; fat 3.7g 6% DV; cholesterol 22.3mg 7% DV; sodium 362.7mg 15% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/76594/grandmothers-buttermilk-cornbread/", "name": "Grandmother's Buttermilk Cornbread", "summary": "\nThis is my grandmother's cornbread recipe and it's the best - sweet and moist! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb89ef78f-919b-400c-a03d-b205b5a352ac%2F886fcf07-43c1-44d5-8991-1d0151fa7393%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "9"], ["Yield:", "9 servings"]], "ingredients": ["½ cup butter", "⅔ cup white sugar", "2 large eggs", "1 cup buttermilk", "½ teaspoon baking soda", "1 cup cornmeal", "1 cup all-purpose flour", "¼ teaspoon salt"], "direction": ["Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.", "Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.", "Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean."], "facts": "284 calories; protein 4.8g 10% DV; carbohydrates 39.1g 13% DV; fat 12.2g 19% DV; cholesterol 59mg 20% DV; sodium 317.8mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/33157/apple-strudel-muffins/", "name": "Apple Strudel Muffins", "summary": "\nFabulous apple muffins with a delicious cinnamon crumb topping! Give them a try -- you won't be sorry! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F173362.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "20 mins"], ["total:", "1 hr"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon baking soda", "½ teaspoon salt", "½ cup butter", "1 cup white sugar", "2  eggs", "1 ¼ teaspoons vanilla", "1 ½ cups chopped apples", "⅓ cup packed brown sugar", "1 tablespoon all-purpose flour", "⅛ teaspoon ground cinnamon", "1 tablespoon butter"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Grease a 12 cup muffin pan.", "In a medium bowl, mix flour, baking powder, baking soda and salt.", "In a large bowl, beat together butter, sugar and eggs until smooth. Mix in vanilla. Stir in apples, and gradually blend in the flour mixture. Spoon the mixture into the prepared muffin pan.", "In a small bowl, mix brown sugar, flour and cinnamon. Cut in butter until mixture is like coarse crumbs. Sprinkle over tops of mixture in muffin pan.", "Bake 20 minutes in the preheated oven, or until a toothpick inserted in the center of a muffin comes out clean. Allow to sit 5 minutes before removing muffins from pan. Cool on a wire rack."], "facts": "264 calories; protein 3.4g 7% DV; carbohydrates 41.4g 13% DV; fat 9.7g 15% DV; cholesterol 53.9mg 18% DV; sodium 254.6mg 10% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/24700/churros/", "name": "Churros", "summary": "\nThese Mexican fritters are very common at fairs. In my border hometown, the line at this stand is always overwhelming. People wait hours in line just to get a taste of these churros. I have run across several recipes but this is the best one by far. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup water", "2 ½ tablespoons white sugar", "½ teaspoon salt", "2 tablespoons vegetable oil", "1 cup all-purpose flour", "2 quarts oil for frying", "½ cup white sugar, or to taste", "1 teaspoon ground cinnamon"], "direction": ["In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball.", "Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels.", "Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."], "facts": "691 calories; protein 3.3g 7% DV; carbohydrates 57.1g 18% DV; fat 51.1g 79% DV; cholesterolmg; sodium 293.1mg 12% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/220943/chef-johns-buttermilk-biscuits/", "name": "Chef John's Buttermilk Biscuits", "summary": "\nThis deceptively simple recipe can come out a million different ways with some very minor variations on the ingredients and amounts. This one's my favorite - flaky, but not dry; chewy, but not tough; crisp in just the right spots. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5909221.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 biscuits"]], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "¼ teaspoon baking soda", "7 tablespoons unsalted butter, chilled in freezer and cut into thin slices", "¾ cup cold buttermilk", "2 tablespoons buttermilk for brushing"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Line a baking sheet with a silicone baking mat or parchment paper.", "Whisk flour, baking powder, salt, and baking soda together in a large bowl.", "Cut butter into flour mixture with a pastry blender until the mixture resembles coarse crumbs, about 5 minutes.", "Make a well in the center of butter and flour mixture. Pour in 3/4 cup buttermilk; stir until just combined.", "Turn dough onto a floured work surface, pat together into a rectangle.", "Fold the rectangle in thirds. Turn dough a half turn, gather any crumbs, and flatten back into a rectangle. Repeat twice more, folding and pressing dough a total of three times.", "Roll dough on a floured surface to about 1/2 inch thick.", "Cut out 12 biscuits using a 2 1/2-inch round biscuit cutter.", "Transfer biscuits to the prepared baking sheet. Press an indent into the top of each biscuit with your thumb.", "Brush the tops of biscuits with 2 tablespoons buttermilk.", "Bake in the preheated oven until browned, about 15 minutes."], "facts": "143 calories; protein 2.8g 6% DV; carbohydrates 17g 6% DV; fat 7.1g 11% DV; cholesterol 18.5mg 6% DV; sodium 321.3mg 13% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/215378/classic-dinner-rolls/", "name": "Classic Dinner Rolls", "summary": "\nWho can resist warm yeast rolls, fresh from the oven? \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1024104.jpg", "meta": [["prep:", "40 mins"], ["cook:", "20 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "12 rolls"]], "ingredients": ["2 cups all-purpose flour, or more if needed", "1 envelope Fleischmann's® RapidRise Yeast", "2 tablespoons sugar", "½ teaspoon salt", "½ cup milk", "¼ cup water", "2 tablespoons butter OR margarine"], "direction": ["Combine 3/4 cup flour, undissolved yeast, sugar and salt in a large bowl. Heat milk, water and butter until very warm (120 degrees to 130 degrees F). Add to flour mixture. Beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add 1/4 cup flour; beat 2 minutes at high speed. Stir in enough remaining flour to make soft dough. Knead on lightly floured surface until smooth and elastic, about 8 to 10 minutes. Cover; let rest 10 minutes.", "Divide dough into 12 equal pieces; shape into balls. Place in greased 8-inch round pan. Cover; let rise in warm, draft-free place until doubled in size, about 30 minutes.", "Bake in preheated 375 degrees F oven for 20 minutes or until done. Remove from pan; brush with additional melted butter, if desired. Serve warm."], "facts": "108 calories; protein 2.8g 6% DV; carbohydrates 18.5g 6% DV; fat 2.3g 4% DV; cholesterol 5.9mg 2% DV; sodium 115.3mg 5% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/260622/red-lobster-cheddar-biscuits/", "name": "Red Lobster® Cheddar Biscuits", "summary": "\nI made these with baked potato soup and loved it. Great addition! I gave them to a friend and he said they tasted just like the ones at Red Lobster®. The recipe will yield more if made into smaller biscuits. They are best served fresh out of the oven. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4571413.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 biscuits"]], "ingredients": ["2 cups all-purpose flour", "1 cup shredded Cheddar cheese", "1 tablespoon baking powder", "1 teaspoon salt", "½ teaspoon garlic powder", "⅔ cup milk", "⅓ cup butter", "1  large egg", "2 tablespoons melted butter"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a baking sheet.", "Combine flour, Cheddar cheese, baking powder, salt, and garlic powder in a bowl.", "Combine milk, 1/3 cup butter, and egg in a separate bowl. Mix into the flour mixture until chunky; be careful not to over-mix the batter.", "Drop batter by tablespoonfuls onto the prepared baking sheet.", "Bake in the preheated oven for 10 minutes. Brush melted butter on top and continue baking until golden brown, about 5 minutes more."], "facts": "379 calories; protein 11.1g 22% DV; carbohydrates 34g 11% DV; fat 22.1g 34% DV; cholesterol 90.2mg 30% DV; sodium 795.9mg 32% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/67937/extreme-banana-nut-bread-ebnb/", "name": "Extreme Banana Nut Bread 'EBNB'", "summary": "\nThis is my mom's dense, excellent, and definitely unhealthy banana nut bread recipe.  It's always completely gone in minutes.  This is great at parties, but hazardous at home.  HEALTH WARNINGS: EBNB may be habit forming. A very flexible recipe that will accommodate changes based on what you have on hand.  Use any type of fat in place of the butter, such as shortening or oil. It works with either brown or white sugar too. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1392234.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "24"], ["Yield:", "2 - 9x5 inch loaves"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon salt", "2 teaspoons baking soda", "1 cup butter or margarine", "2 cups white sugar", "2 cups mashed overripe bananas", "4  eggs, beaten", "1 cup chopped walnuts"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5 inch loaf pans.", "Sift the flour, salt and baking soda into a large bowl. In a separate bowl, mix together the butter or margarine and sugar until smooth. Stir in the bananas, eggs, and walnuts until well blended. Pour the wet ingredients into the dry mixture, and stir just until blended. Divide the batter evenly between the two loaf pans.", "Bake for 60 to 70 minutes in the preheated oven, until a knife inserted into the crown of the loaf comes out clean. Let the loaves cool in the pans for at least 5 minutes, then turn out onto a cooling rack, and cool completely. Wrap in aluminum foil to keep in the moisture. Ideally, refrigerate the loaves for 2 hours or more before serving."], "facts": "232 calories; protein 3.2g 6% DV; carbohydrates 29.7g 10% DV; fat 11.9g 18% DV; cholesterol 51.3mg 17% DV; sodium 268.4mg 11% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/6773/simple-whole-wheat-bread/", "name": "Simple Whole Wheat Bread", "summary": "\nSimply a great-tasting and easy-to-make whole wheat bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012491.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "36"], ["Yield:", "3 loaves"]], "ingredients": ["3 cups warm water (110 degrees F/45 degrees C)", "2 (.25 ounce) packages active dry yeast", "⅓ cup honey", "5 cups bread flour", "3 tablespoons butter, melted", "⅓ cup honey", "1 tablespoon salt", "3 ½ cups whole wheat flour", "2 tablespoons butter, melted"], "direction": ["In a large bowl, mix warm water, yeast, and 1/3 cup honey.  Add 5 cups white bread flour, and stir to combine.  Let set for 30 minutes, or until big and bubbly.", "Mix in 3 tablespoons melted butter, 1/3 cup honey, and salt.  Stir in 2 cups whole wheat flour.  Flour a flat surface and knead with whole wheat flour until not real sticky - just pulling away from the counter, but still sticky to touch.  This may take an additional 2 to 4 cups of whole wheat flour.  Place in a greased bowl, turning once to coat the surface of the dough.  Cover with a dishtowel.  Let rise in a warm place until doubled.", "Punch down, and divide into 3 loaves.  Place in greased 9 x 5 inch loaf pans, and allow to rise until dough has topped the pans by one inch.", "Bake at 350 degrees F (175 degrees C) for 25 to 30 minutes; do not overbake.  Lightly brush the tops of loaves with 2 tablespoons melted butter or margarine when done to prevent crust from getting hard.  Cool completely."], "facts": "134 calories; protein 3.8g 8% DV; carbohydrates 25.9g 8% DV; fat 2.1g 3% DV; cholesterol 4.2mg 1% DV; sodium 207.1mg 8% DV."}, {"type": "By Meal ", "package": "bread_recipes", "link": "https://www.allrecipes.com/recipe/25224/classic-bran-muffins/", "name": "Classic Bran Muffins", "summary": "\nA delicious source of fiber! My family have them almost every morning. Great healthy muffins! You may substitute dates for the raisins if you wish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470964.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["1 ½ cups wheat bran", "1 cup buttermilk", "⅓ cup vegetable oil", "1  egg", "⅔ cup brown sugar", "½ teaspoon vanilla extract", "1 cup all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup raisins"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or line with paper muffin liners.", "Mix together wheat bran and buttermilk; let stand for 10 minutes.", "Beat together oil, egg, sugar and vanilla and add to buttermilk/bran mixture. Sift together flour, baking soda, baking powder and salt. Stir flour mixture into buttermilk mixture, until just blended. Fold in raisins and spoon batter into prepared muffin tins.", "Bake for 15 to 20 minutes, or until a toothpick inserted into the center of a muffin comes out clean. Cool and enjoy!"], "facts": "168 calories; protein 3.5g 7% DV; carbohydrates 25.6g 8% DV; fat 7.1g 11% DV; cholesterol 16.3mg 5% DV; sodium 262.2mg 11% DV."}]