[{"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/260313/christmas-reindeer-cupcakes/", "name": "Christmas Reindeer Cupcakes", "summary": "\nCute reindeer cupcakes for Christmas that the kids will absolutely adore. These cupcakes are great anytime of year, however, simply skip the reindeer decorating! You can get the kids to help you decorate for loads of family fun. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4561717.jpg", "meta": [["prep:", "1 hr"], ["cook:", "18 mins"], ["additional:", "1 hr 5 mins"], ["total:", "2 hrs 23 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes"]], "ingredients": ["9 tablespoons unsalted butter, room temperature", "¾ cup white sugar", "1 teaspoon vanilla extract", "2  eggs", "1 ½ cups sifted self-rising flour", "½ cup milk"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease a 12-cup muffin tin or line cups with paper liners.", "Combine 9 tablespoons butter, white sugar, and vanilla extract in a large bowl; beat with an electric mixer until smooth and creamy. Add eggs one at a time and beat until well combined. Fold in half the flour and 1/4 cup milk and stir to combine. Repeat with remaining flour and milk. Spoon batter into the prepared muffin cups, filling each 3/4 full.", "Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 18 minutes.", "Remove tin from oven and cool on a wire rack for 5 minutes. Remove cupcakes from the tin and cool completely on a wire rack before decorating, about 1 hour.", "Combine confections' sugar, 1 tablespoon butter, and 1 tablespoon milk in a large bowl; beat with an electric mixer until smooth and creamy. Thin frosting with a little milk or water, if necessary. Add food coloring and stir until frosting is uniformly brown. Add more food coloring, 1 drop at a time, until frosting is the color you like.", "Spread a thin layer of frosting on top of each cupcake. Break vanilla cookies in half. Place a cookie half on each cupcake as a mouth. Use a bit of frosting to \"glue\" a jelly bean onto the cookie for Rudolph's red nose. Stick 2 candy eyeballs into each cupcake. Break off a piece from each pretzel so they look like antlers and stick 2 into the top of each cupcakes. Shape chewy candies into ears and stick 2 into the sides of each cupcake."], "facts": "427 calories; protein 6.3g 13% DV; carbohydrates 77.1g 25% DV; fat 13.9g 21% DV; cholesterol 57.4mg 19% DV; sodium 815.3mg 33% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/256065/double-decker-marshmallow-fudge/", "name": "Double-Decker Marshmallow Fudge", "summary": "\nA layer of homemade marshmallow batter is poured over a pan of fudge to make a truly decadent version of this holiday favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4169418.jpg", "meta": [["prep:", "30 mins"], ["cook:", "17 mins"], ["additional:", "10 hrs 15 mins"], ["total:", "11 hrs 2 mins"], ["Servings:", "24"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["cooking spray", "¼ cup butter", "1 (14 ounce) can sweetened condensed milk", "3 cups semisweet chocolate chips", "½ cup cold water", "3 (.25 ounce) packages unflavored gelatin", "2 cups white sugar", "½ cup water", "1 cup confectioners' sugar"], "direction": ["Line a 9x13-inch cake or jelly roll pan with aluminum foil; coat with cooking spray.", "Melt butter in a medium saucepan over medium heat; stir in condensed milk. Pour in chocolate chips; cook and stir until melted, 5 to 10 minutes.", "Pour chocolate mixture into the prepared pan. Coat a spatula with cooking spray and use to press chocolate mixture into an even layer. Refrigerate fudge until cooled and set, about 2 hours.", "Combine 1/2 cup cold water and gelatin in a bowl; set aside until gelatin starts to thicken, about 15 minutes.", "Mix white sugar and 1/2 cup water in a saucepan over medium heat; cook and stir until sugar dissolves, 5 to 8 minutes. Bring sugar mixture to a boil and cook until temperature reaches 240 degrees F (116 degrees C) on a candy thermometer, 2 to 3 minutes. Remove from heat.", "Slowly pour sugar mixture into gelatin mixture while simultaneously beating with an electric mixer set on low. Gradually increase speed to high and continue beating until marshmallow batter is very thick but not stiff, 10 to 15 minutes.", "Pour marshmallow batter over fudge, smoothing the surface with spatula coated with cooking spray. Let sit uncovered at room temperature until completely set, about 6 hours.", "Dust the top of marshmallow layer with most of the confectioners' sugar. Refrigerate marshmallow fudge for at least 2 hours.", "Lift marshmallow fudge out of the pan by the edges of the foil and place on a large cutting board. Dip a large knife in the remaining confectioners' sugar and slice fudge into 1 1/2-inch squares, continually dipping knife in the sugar after each slice."], "facts": "258 calories; protein 2.9g 6% DV; carbohydrates 44g 14% DV; fat 9.6g 15% DV; cholesterol 10.6mg 4% DV; sodium 38.9mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/57028/amazingly-good-eggnog/", "name": "Amazingly Good Eggnog", "summary": "\nIt's taken me several years to perfect this recipe. Now everyone asks, 'When are you making the eggnog?!' This uses cooked eggs for safety, and you can use more or less rum to taste.  It's a bit of work to make, but well worth it.  You'll never buy store-bought eggnog again! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5911445.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 28 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 cups milk", "5  whole cloves", "½ teaspoon vanilla extract", "1 teaspoon ground cinnamon", "12  egg yolks", "1 ½ cups sugar", "2 ½ cups light rum", "4 cups light cream", "2 teaspoons vanilla extract", "½ teaspoon ground nutmeg"], "direction": ["Combine milk, cloves, 1/2 teaspoon vanilla, and cinnamon in a saucepan, and heat over lowest setting for 5 minutes.  Slowly bring milk mixture to a boil.", "In a large bowl, combine egg yolks and sugar.  Whisk together until fluffy.  Whisk hot milk mixture slowly into the eggs. Pour mixture into saucepan. Cook over medium heat, stirring constantly for 3 minutes, or until thick.  Do not allow mixture to boil.  Strain to remove cloves, and let cool for about an hour.", "Stir in rum, cream, 2 teaspoon vanilla, and nutmeg.  Refrigerate overnight  before serving."], "facts": "404 calories; protein 4.9g 10% DV; carbohydrates 32.1g 11% DV; fat 17.1g 26% DV; cholesterol 59.3mg 20% DV; sodium 65.9mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/17345/buche-de-noel/", "name": "Buche de Noel", "summary": "\nBuche de Noel is the French name for a Christmas cake shaped like a log. This one is a heavenly flourless chocolate cake rolled with chocolate whipped cream. Traditionally, Buche de Noel is decorated with confectioners' sugar to resemble snow on a Yule log. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3023127.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 buche de Noel"]], "ingredients": ["2 cups heavy cream", "½ cup confectioners' sugar", "½ cup unsweetened cocoa powder", "1 teaspoon vanilla extract", "6  egg yolks", "½ cup white sugar", "⅓ cup unsweetened cocoa powder", "1 ½ teaspoons vanilla extract", "⅛ teaspoon salt", "6  egg whites", "¼ cup white sugar", "confectioners' sugar for dusting"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate.", "In a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until thick and pale. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks.  Immediately fold the yolk mixture into the whites. Spread the batter evenly into the prepared pan.", "Bake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes.", "Unroll the cake, and spread the filling to within 1 inch of the edge. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. Dust with confectioners' sugar before serving."], "facts": "276 calories; protein 5.1g 10% DV; carbohydrates 27.6g 9% DV; fat 17.7g 27% DV; cholesterol 156.8mg 52% DV; sodium 72.4mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/139544/marzipan-christmas-kringle-juleskringle/", "name": "Marzipan Christmas Kringle (Juleskringle)", "summary": "\nThis marzipan tubular bread is an ABSOLUTE must for the Christmas season, and a traditional dinner would not be complete without this Christmas Kringle for dessert. It may seem complicated at first glance, but if you follow the recipe step by step, it is actually quite easy and you will amaze your family with this beautiful dessert. This is an extremely rich and decadent treat so guests only need a little. Often a coin is hidden in the kringle and it is thought that the finder will be guaranteed good luck for the upcoming year. As such, it is considered bad luck not to indulge at Christmas! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1545324.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "14 hrs"], ["total:", "15 hrs"], ["Servings:", "15"], ["Yield:", "1 loaf"]], "ingredients": ["½ cup warm milk", "1 tablespoon white sugar", "1 (.25 ounce) envelope active dry yeast", "1 cup heavy cream", "3 ½ cups all-purpose flour", "¼ cup white sugar", "1 teaspoon salt", "1 teaspoon ground cardamom", "½ cup butter", "1 (8 ounce) can almond paste", "½ cup crushed sliced almonds", "½ cup white sugar", "1 teaspoon ground cinnamon", "1 teaspoon almond extract", "½ cup white sugar", "1  egg white, beaten", "½ cup sliced almonds"], "direction": ["In a small bowl, stir together the milk and sugar. Sprinkle the yeast over the top and let stand for 10 minutes to dissolve. Stir in cream.", "In a separate bowl, stir together the flour, sugar, salt and cardamom. Cut in the butter using a pastry blender or pinching with your fingers until it is a course mealy texture. Stir in the yeast mixture until well blended. Pat into a ball, flatten slightly, then wrap in plastic wrap. Refrigerate for 12 to 24 hours.", "To make the filling, mix the almond paste, almonds, sugar, cinnamon and almond extract using an electric mixer until evenly blended. It may be crumbly.", "Roll the chilled dough out into a 2 inch wide and 24 inch long rectangle. Spread the filling to within 2 inches of the sides and roll up into a tube. Cover your work surface with sugar, and roll the tube of dough in the sugar to coat thoroughly. Roll and stretch the dough out to form a long rope about 40 inches long. Place on a parchment lined baking sheet and shape into a pretzel shape.", "Brush the top of the pretzel with egg white and sprinkle with almonds. Cover loosely with a towel and let rise for 45 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Bake the kringle in the preheated oven until golden brown, 25 to 30 minutes. Cut into slices to serve."], "facts": "397 calories; protein 6.8g 14% DV; carbohydrates 49.3g 16% DV; fat 19.8g 31% DV; cholesterol 38.7mg 13% DV; sodium 213.9mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/17160/christmas-stollen/", "name": "Christmas Stollen", "summary": "\nI got this recipe while I was head baker at London's Dorchester Hotel. It's packed with dried fruit and filled with a marzipan surprise. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "1 hr 40 mins"], ["total:", "3 hrs"], ["Servings:", "15"], ["Yield:", "1 loaf"]], "ingredients": ["1 tablespoon active dry yeast", "⅔ cup warm milk (110 degrees F/45 degrees C)", "1  large egg", "⅓ cup white sugar", "½ tablespoon salt", "⅓ cup butter, softened", "2 ½ cups bread flour", "⅓ cup currants", "⅓ cup sultana raisins", "⅓ cup red candied cherries, quartered", "⅔ cup diced candied citron", "6 ounces marzipan", "1 tablespoon confectioners' sugar", "¼ teaspoon ground cinnamon"], "direction": ["In a small bowl, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes.", "In a large bowl, combine the yeast mixture with the egg, white sugar, salt, butter, and 2 cups bread flour; beat well. Add the remaining flour, 1/4 cup at a time, stirring well after each addition. When the dough has begun to pull together, turn it out onto a lightly floured surface, and knead in the currants, raisins, dried cherries, and citrus peel. Continue kneading until smooth, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "Lightly grease a cookie sheet. Deflate the dough and turn it out onto a lightly floured surface. Roll the marzipan into a rope and place it in the center of the dough. Fold the dough over to cover it; pinch the seams together to seal. Place the loaf, seam side down, on the prepared baking sheet. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).", "Bake in the preheated oven for 10 minutes, then reduce heat to 300 degrees F (150 degrees C), and bake for a further 30 to 40 minutes, or until golden brown. Allow loaf to cool on a wire rack. Dust the cooled loaf with confectioners' sugar, and sprinkle with the cinnamon."], "facts": "178 calories; protein 2.2g 5% DV; carbohydrates 28.8g 9% DV; fat 6.8g 10% DV; cholesterol 24.1mg 8% DV; sodium 306.5mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/24308/eggnog-cheesecake-iii/", "name": "Eggnog Cheesecake III", "summary": "\nThis is a delicious cheesecake for eggnog lovers. The secret to a smooth  cheesecake is to cream the cream cheese in a food processor for several minutes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F756445.jpg", "meta": [["prep:", "30 mins"], ["cook:", "55 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "16"], ["Yield:", "1 9-inch cake"]], "ingredients": ["1 cup graham cracker crumbs", "2 tablespoons white sugar", "3 tablespoons melted butter", "3 (8 ounce) packages cream cheese, softened", "1 cup white sugar", "3 tablespoons all-purpose flour", "¾ cup eggnog", "2  eggs", "2 tablespoons rum", "1 pinch ground nutmeg"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "In a medium bowl combine graham cracker crumbs, 2 tablespoons sugar and butter.  Press into the bottom of a 9 inch spring form pan.", "Bake in preheated oven for 10 minutes.  Place on a wire rack to cool.", "Preheat oven to 425 degrees F (220 degrees C).", "In a food processor combine cream cheese, 1 cup sugar, flour and eggnog; process until smooth.  Blend in eggs, rum and nutmeg.  Pour mixture into cooled crust.", "Bake in preheated oven for 10 minutes.", "Reduce heat to 250 and bake for 45 minutes, or until center of cake is barely firm to the touch.  Remove from the oven and immediately loosen cake from rim.  Let cake cool completely before removing the rim."], "facts": "277 calories; protein 5g 10% DV; carbohydrates 22g 7% DV; fat 18.9g 29% DV; cholesterol 82.2mg 27% DV; sodium 186.7mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/214012/grandmas-gingerbread-pancakes/", "name": "Grandma's Gingerbread Pancakes", "summary": "\nMy dear Grammie was making gingerbread one morning and my brother and I arrived, starving! She altered the recipe slightly, put it on the grill and the result is this delicious recipe. The smell of it cooking always takes me back to that morning--mmmm! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F533525.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "10"], ["Yield:", "10 pancakes"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "¼ teaspoon baking soda", "¼ teaspoon salt", "½ teaspoon ground dried ginger", "1 teaspoon ground cinnamon", "1  egg", "½ teaspoon vanilla extract", "¼ cup molasses", "1 ½ cups water"], "direction": ["Whisk the flour, baking powder, baking soda, salt, ginger, and cinnamon in a bowl; set aside. Beat the egg in a separate mixing bowl with the vanilla and molasses until smooth. Whisk in the water until completely incorporated. Stir the flour mixture into the molasses mixture until just combined -- a few lumps are okay.", "Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter."], "facts": "101 calories; protein 2.6g 5% DV; carbohydrates 20.9g 7% DV; fat 0.7g 1% DV; cholesterol 18.6mg 6% DV; sodium 149.9mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/25018/butter-rich-spritz-butter-cookies/", "name": "Butter Rich Spritz Butter Cookies", "summary": "\nThese are wonderful cookies from the press. They are rich in flavor. My mom has made these cookies for years for all of the holidays. She even used food coloring for the different designs, like green trees, etc.The kids love to decorate them as much as they love to eat them. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F529520.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 mins"], ["additional:", "2 mins"], ["total:", "18 mins"], ["Servings:", "36"], ["Yield:", "3 dozen"]], "ingredients": ["2 ½ cups all-purpose flour", "½ teaspoon salt", "1 cup butter, softened", "1 ¼ cups confectioners' sugar", "2  egg yolks", "½ teaspoon almond extract", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C). Sift together the flour and salt; set aside.", "In a medium bowl, cream together the butter and sugar. Stir in the egg yolks, almond extract and vanilla extract.  Gradually blend in the sifted ingredients. Fill a cookie press with dough and shoot cookies about 1 1/2 inches apart onto an ungreased cookie sheet. If you like, decorate with sugar or sprinkles at this time.", "Bake for 6 to 8 minutes in the preheated oven."], "facts": "97 calories; protein 1.1g 2% DV; carbohydrates 10.8g 4% DV; fat 5.4g 8% DV; cholesterol 24.9mg 8% DV; sodium 69.3mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/23040/hot-buttered-rum-batter/", "name": "Hot Buttered Rum Batter", "summary": "\nThis is THE batter to use for absolutely delicious and buttery Hot Buttered Rums! You can keep this in the freezer for up to 3 months. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1123112.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "20 mins"], ["total:", "40 mins"], ["Servings:", "100"], ["Yield:", "100 servings"]], "ingredients": ["1 pound butter", "1 pound brown sugar", "1 pound confectioners' sugar", "1 quart vanilla ice cream, softened", "1 tablespoon ground cinnamon", "1 teaspoon ground nutmeg"], "direction": ["Melt butter in a large pot over medium heat. Blend in brown sugar and confectioners' sugar. Remove from heat, and whisk in the ice cream, cinnamon, and nutmeg. Pour mixture into a plastic container, seal, and freeze.", "In a coffee mug, measure 1 tablespoon Hot Buttered Rum Batter and 1 fluid ounce of rum, then fill cup with boiling water. Stir, and sprinkle top of drink with nutmeg."], "facts": "78 calories; protein 0.2g; carbohydrates 10.3g 3% DV; fat 4.3g 7% DV; cholesterol 12.1mg 4% DV; sodium 31.7mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21018/gingerbread-waffles-with-hot-chocolate-sauce/", "name": "Gingerbread Waffles with Hot Chocolate Sauce", "summary": "\nYummy and delicious. These extraordinary waffles are flavored with molasses and spices. Topped with homemade chocolate sauce, they are perfect for a special breakfast treat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888716.jpg", "meta": [["prep:", "25 mins"], ["cook:", "25 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup light molasses", "½ cup butter", "1 ½ teaspoons baking soda", "½ cup milk", "1  egg", "2 cups all-purpose flour", "1 ½ teaspoons ground ginger", "½ teaspoon ground cinnamon", "½ teaspoon salt", "2 cups boiling water", "1 cup white sugar", "2 tablespoons cornstarch", "½ cup unsweetened cocoa powder", "1 teaspoon salt", "2 teaspoons vanilla extract", "2 tablespoons butter"], "direction": ["In a small saucepan, heat molasses and 1/2 cup butter until almost boiling. Remove from heat and let cool slightly. Stir in baking soda, milk and egg.", "In a large bowl, sift together flour, ginger, cinnamon and salt. Make a well in the center and pour in the molasses mixture. Mix until smooth.", "Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot with chocolate sauce.", "To make chocolate sauce: In a saucepan, combine water, 1 cup sugar, cornstarch, cocoa powder and 1 teaspoon salt. Cook over medium heat, stirring constantly, until mixture comes to a boil. Remove from heat and add vanilla and 2 tablespoons butter; stir until smooth."], "facts": "664 calories; protein 7.7g 15% DV; carbohydrates 114g 37% DV; fat 21.9g 34% DV; cholesterol 83.5mg 28% DV; sodium 1077.7mg 43% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/219587/christmas-prime-rib/", "name": "Christmas Prime Rib", "summary": "\nDelicious coating on outside of roast, and perfect roasting time. Plan on 1 pound per person. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1875698.jpg", "meta": [["prep:", "15 mins"], ["cook:", "2 hrs"], ["additional:", "8 hrs 30 mins"], ["total:", "10 hrs 45 mins"], ["Servings:", "12"], ["Yield:", "1 prime rib roast"]], "ingredients": ["1 (6 pound) boneless prime rib roast", "2 tablespoons prepared horseradish", "2 tablespoons Dijon mustard", "2 teaspoons kosher salt", "2 teaspoons coarsely ground black pepper", "2 teaspoons dried thyme", "2 teaspoons garlic powder", "2 stalks celery, cut into 2-inch pieces", "1  carrot, cut into 2-inch pieces", "1 small unpeeled onion, quartered and separated", "2 teaspoons concentrated beef base (paste)", "1 ½ cups water", "1 teaspoon cornstarch", "1 teaspoon water"], "direction": ["The day before serving, remove the roast from the package, and dry thoroughly with paper towels. Set the roast on a baking sheet, and place in refrigerator overnight. Remove from refrigerator 1 hour before cooking time to allow meat to reach room temperature. Rub the roast all over with horseradish and Dijon mustard. In a bowl, mix together the kosher salt, black pepper, thyme, and garlic powder; sprinkle the spice mix over the roast.", "Preheat oven to 450 degrees F (230 degrees C). Place the celery, carrot, and onion pieces into the bottom of a roasting pan. Place the roast on top of the vegetables.", "Roast in the preheated oven for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and roast until the meat is browned and an instant-read meat thermometer inserted into the thickest part of the roast reads 130 to 135 degrees F (54 to 57 degrees C) for medium-rare. Remove from oven, transfer roast to a platter, and cover with a tent of aluminum foil. Allow to rest for 30 minutes. Temperature of the meat will rise about 10 degrees during resting time.", "To make au jus sauce, skim excess fat from the pan drippings in the roasting pan. Place the pan over a burner set to medium heat, and stir in the beef base and 1 1/2 cup of water. Bring to a boil, scraping and dissolving any brown flavor bits from the bottom of the pan. Strain out and discard the vegetables. Combine the cornstarch and 1 teaspoon of water in a small bowl, and whisk the mixture into the sauce. Allow the sauce to thicken slightly (sauce will be thin), pour into a gravy boat, and serve with roast."], "facts": "410 calories; protein 22.7g 45% DV; carbohydrates 3g 1% DV; fat 33.5g 52% DV; cholesterol 84.3mg 28% DV; sodium 465.8mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/15985/grandmas-corn-pudding/", "name": "Grandma's Corn Pudding", "summary": "\nThis corn pudding is definitely comfort food. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6033726.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servngs"]], "ingredients": ["5  eggs", "⅓ cup butter, melted", "¼ cup white sugar", "½ cup milk", "4 tablespoons cornstarch", "1 (15.25 ounce) can whole kernel corn", "2 (14.75 ounce) cans cream-style corn"], "direction": ["Preheat oven to 400 Degrees F (200 degrees C). Grease a 2 quart casserole dish.", "In a large bowl, lightly beat eggs. Add melted butter, sugar, and milk. Whisk in cornstarch. Stir in corn and creamed corn. Blend well.  Pour mixture into prepared casserole dish.", "Bake for 1 hour."], "facts": "277 calories; protein 7.7g 16% DV; carbohydrates 39.6g 13% DV; fat 12g 19% DV; cholesterol 137.8mg 46% DV; sodium 558.2mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/230466/savory-pumpkin-hummus/", "name": "Savory Pumpkin Hummus", "summary": "\nI tinkered a bit with what I found in other recipes and this is the result. I think I like my results. I stirred in a small handful of tamari-flavored pumpkin seeds just before serving (couldn't find plain ones) and sprinkled a bit of paprika on top to make it look nice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1526126.jpg", "meta": [["prep:", "15 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 15 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["2 tablespoons lemon juice", "2 tablespoons tahini", "3 cloves garlic", "¾ teaspoon salt", "2 (15 ounce) cans garbanzo beans, drained", "2 teaspoons extra-virgin olive oil", "1 (15 ounce) can pumpkin puree", "1 teaspoon ground cumin", "½ teaspoon cayenne pepper", "¼ cup toasted pumpkin seed kernels, or more to taste", "1 pinch paprika"], "direction": ["Pulse lemon juice, tahini, garlic, and salt together in a food processor or blender until smooth. Add garbanzo beans and olive oil and pulse until smooth. Add pumpkin, cumin, and cayenne pepper; process until well blended. Transfer hummus to a container with a lid and refrigerate at least 2 hours.", "Fold pumpkin seeds into hummus; garnish with paprika."], "facts": "81 calories; protein 3g 6% DV; carbohydrates 11.3g 4% DV; fat 3.1g 5% DV; cholesterol 0mg; sodium 280.7mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9174/peanut-butter-pie/", "name": "Peanut Butter Pie", "summary": "\nPeanut butter refrigerator pie, very easy to make. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F190359.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 (9 inch) prepared graham cracker crust", "1 (8 ounce) package cream cheese, softened", "½ cup creamy peanut butter", "½ cup confectioners' sugar", "1 (16 ounce) container frozen whipped topping, thawed", "15  miniature chocolate covered peanut butter cups, unwrapped"], "direction": ["Mix the cream cheese, confectioners' sugar and peanut butter together until smooth. Fold in 1/2 of the whipped topping. Spoon the mixture into the graham cracker crust.", "Place the remaining whipped topping over the top of the peanut butter mixture and garnish with the peanut butter cups. Chill for at least 2 hours or overnight before serving."], "facts": "605 calories; protein 9.5g 19% DV; carbohydrates 49.5g 16% DV; fat 43.1g 66% DV; cholesterol 31.7mg 11% DV; sodium 366.8mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/22617/best-spinach-dip-ever/", "name": "Best Spinach Dip Ever", "summary": "\nThis is my dad's recipe. The entire family loves it! A flavorful spinach mixture fills a tasty bread bowl. Your family will love it, too. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F748478.jpg", "meta": [["prep:", "15 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 15 mins"], ["Servings:", "6"], ["Yield:", "1 bread bowl dip"]], "ingredients": ["1 cup mayonnaise", "1 (16 ounce) container sour cream", "1 (1.8 ounce) package dry leek soup mix", "1 (4 ounce) can water chestnuts, drained and chopped", "½ (10 ounce) package frozen chopped spinach, thawed and drained", "1 (1 pound) loaf round sourdough bread"], "direction": ["In a medium bowl, mix together mayonnaise, sour cream, dry leek soup mix, water chestnuts and chopped spinach. Chill in the refrigerator 6 hours, or overnight.", "Remove top and interior of sourdough bread. Fill with mayonnaise mixture. Tear removed bread chunks into pieces for dipping."], "facts": "682 calories; protein 13.3g 27% DV; carbohydrates 53.2g 17% DV; fat 47.4g 73% DV; cholesterol 48.3mg 16% DV; sodium 1183.4mg 47% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/18942/hot-spiked-cider/", "name": "Hot Spiked Cider", "summary": "\nA 'spiked' version of the traditional hot cider - great for fall or holiday gatherings.  This can be made in large quantities and kept warm in an electric coffee server. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1700738.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 quart water", "3  orange spice tea bags", "½ cup light brown sugar", "2 cups apple cider", "1 ½ cups light rum", "8  cinnamon sticks", "3 teaspoons butter"], "direction": ["Pour water into a large saucepan and bring to a boil. Remove from heat and toss in the orange spice tea bags. Cover and let steep 5 minutes.  Remove tea bags and stir in sugar, apple cider, rum, and 2 of the cinnamon sticks.  Heat just to steaming -- do not boil.", "Ladle hot cider into 6 mugs and drop 1/2 teaspoon butter into each.  Garnish with a cinnamon \"swizzle\" stick."], "facts": "260 calories; protein 0g; carbohydrates 29g 10% DV; fat 2g 3% DV; cholesterol 5.4mg 2% DV; sodium 34mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21649/sausage-balls/", "name": "Sausage Balls", "summary": "\nThese are so yummy! My family makes every Christmas morning. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F466969.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "15"], ["Yield:", "30 sausage balls"]], "ingredients": ["1 pound ground pork sausage", "2 cups biscuit baking mix", "1 pound sharp Cheddar cheese, shredded"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, combine sausage, biscuit baking mix and cheese. Form into walnut size balls and place on baking sheets.", "Bake in preheated oven for 20 to 25 minutes, until golden brown and sausage is cooked through."], "facts": "264 calories; protein 12.8g 26% DV; carbohydrates 10.5g 3% DV; fat 19g 29% DV; cholesterol 49.1mg 16% DV; sodium 659.5mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Feasy-sugar-cookies.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/18379/best-green-bean-casserole/", "name": "Best Green Bean Casserole", "summary": "\nThis great variation of the traditional green bean casserole is topped with French fried onions and Cheddar cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1656932.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (14.5 ounce) cans green beans, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (6 ounce) can French fried onions", "1 cup shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place green beans and soup in a large microwave-safe bowl.  Mix well and heat in the microwave on HIGH until warm (3 to 5 minutes). Stir in 1/2 cup of cheese and heat mixture for another 2 to 3 minutes. Transfer green bean mixture to a casserole dish and sprinkle with French fried onions and remaining cheese.", "Bake in a preheated 350 degrees F (175 degrees C) oven until the cheese melts and the onions just begin to brown."], "facts": "322 calories; protein 6.6g 13% DV; carbohydrates 20.2g 7% DV; fat 23.2g 36% DV; cholesterol 19.8mg 7% DV; sodium 1068.3mg 43% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/12142/sweet-potato-pie-i/", "name": "Sweet Potato Pie I", "summary": "\nThis recipe was shared with me by a special friend in Atlanta, GA.  It has long been a favorite, and everyone who tastes it says it is the best they have ever had. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F06%2F7304125_original-2000.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 50 mins"], ["total:", "2 hrs 20 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 (1 pound) sweet potato", "½ cup butter, softened", "1 cup white sugar", "½ cup milk", "2  eggs", "½ teaspoon ground nutmeg", "½ teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 (9 inch) unbaked pie crust"], "direction": ["Boil sweet potato whole in skin for 40 to 50 minutes, or until done.  Run cold water over the sweet potato, and remove the skin.", "Break apart sweet potato in a bowl.  Add butter, and mix well with mixer. Stir in sugar, milk, eggs, nutmeg, cinnamon and vanilla. Beat on medium speed until mixture is smooth.  Pour filling into an unbaked pie crust.", "Bake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until knife inserted in center comes out clean.  Pie will puff up like a souffle, and then will sink down as it cools."], "facts": "389 calories; protein 4.5g 9% DV; carbohydrates 47.8g 15% DV; fat 20.6g 32% DV; cholesterol 78.2mg 26% DV; sodium 253.7mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/", "name": "The Best Rolled Sugar Cookies", "summary": "\nWhenever you make these cookies for someone, be sure to bring along several copies of the recipe!  You will be asked for it, I promise! NOTE: I make icing with confectioners' sugar and milk. I make it fairly thin, as I 'paint' the icing on the cookies with a pastry brush. Thin enough to spread easily but not so thin that it just makes your cookies wet and runs off. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F519229_original-2000.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "2 hrs 32 mins"], ["total:", "3 hrs"], ["Servings:", "60"], ["Yield:", "5 dozen"]], "ingredients": ["1 ½ cups butter, softened", "2 cups white sugar", "4  eggs", "1 teaspoon vanilla extract", "5 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt"], "direction": ["In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).", "Preheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.", "Bake 6 to 8 minutes in preheated oven. Cool completely."], "facts": "110 calories; protein 1.5g 3% DV; carbohydrates 14.7g 5% DV; fat 5g 8% DV; cholesterol 24.6mg 8% DV; sodium 92.6mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9401/salmon-patties-i/", "name": "Salmon Patties I", "summary": "\nThese salmon patties are delicious for lunch or dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7697013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "5"], ["Yield:", "4 to 6 servings"]], "ingredients": ["1 (14.75 ounce) can canned salmon", "1  egg", "¼ cup chopped onion", "½ cup seasoned dry bread crumbs", "1 tablespoon olive oil"], "direction": ["Drain and reserve liquid from salmon. Mix egg, onion, bread crumbs and salmon together.", "Make into patties. If mixture is too dry to form into patties, add reserved liquid from salmon.", "In a  frying pan, heat olive oil. Place patties in pan.  Brown on each side, turning gently.  Drain on paper towels and serve."], "facts": "224 calories; protein 22.3g 45% DV; carbohydrates 9g 3% DV; fat 10.4g 16% DV; cholesterol 73.7mg 25% DV; sodium 522.8mg 21% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/229658/oven-roasted-turkey-breast/", "name": "Oven-Roasted Turkey Breast", "summary": "\nEasy to make, great for dinner, leftovers and sandwiches. Adapted for our 2-person household from larger recipes for larger families with larger appetites. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2663892.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 35 mins"], ["total:", "1 hr 50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¼ cup butter, softened", "1 clove garlic, minced", "1 teaspoon paprika", "1 teaspoon Italian seasoning", "½ teaspoon salt-free garlic and herb seasoning blend (such as Mrs. Dash®)", "salt and ground black pepper to taste", "1 (3 pound) turkey breast with skin", "1 teaspoon minced shallot", "1 tablespoon butter", "1 splash dry white wine", "1 cup chicken stock", "3 tablespoons all-purpose flour", "2 tablespoons half-and-half"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Mix 1/4 cup butter, garlic, paprika, Italian seasoning, garlic and herb seasoning, salt, and black pepper in a bowl. Place turkey breast with skin side up into a roasting pan. Loosen skin with your fingers; brush half the butter mixture over the turkey breast and underneath the skin. Reserve remaining butter mixture. Tent turkey breast loosely with aluminum foil.", "Roast in the preheated oven for 1 hour; baste turkey breast with remaining butter mixture. Return to oven and roast until the juices run clear and an instant-read meat thermometer inserted into the thickest part of the breast, not touching bone, reads 165 degrees F (65 degrees C), about 30 more minutes. Let turkey breast rest 10 to 15 minutes before serving.", "While turkey is resting, transfer pan drippings to a skillet. Skim off excess grease, leaving about 1 tablespoon in skillet. Place skillet over low heat; cook and stir shallot in turkey grease until opaque, about 5 minutes. Melt 1 tablespoon butter in skillet with shallot and whisk in white wine, scraping any browned bits of food from skillet. Whisk in chicken stock and flour until smooth. Bring to a simmer, whisking constantly, until thickened. For a creamier, lighter gravy, whisk in half-and-half."], "facts": "385 calories; protein 60.3g 121% DV; carbohydrates 4.3g 1% DV; fat 11.8g 18% DV; cholesterol 191.3mg 64% DV; sodium 313.8mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/22755/libbys-famous-pumpkin-pie/", "name": "Libby's® Famous Pumpkin Pie", "summary": "\nWhether you're hosting a festive party or a casual get-together with friends, our Famous Pumpkin Pie will make entertaining easy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1680564.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch deep dish pie"]], "ingredients": ["1 (9 inch) unbaked deep dish pie crust", "¾ cup white sugar", "1 teaspoon ground cinnamon", "½ teaspoon salt", "½ teaspoon ground ginger", "¼ teaspoon ground cloves", "2  eggs", "1 (15 ounce) can LIBBY'S® 100% Pure Pumpkin", "1 (12 fluid ounce) can NESTLE® CARNATION® Evaporated Milk"], "direction": ["Preheat oven to 425 degrees F.", "Combine sugar, salt, cinnamon, ginger and cloves in small bowl. Beat eggs lightly in large bowl. Stir in pumpkin and sugar-spice mixture. Gradually stir in evaporated milk. Pour into pie shell.", "Bake for 15 minutes. Reduce temperature to 350 degrees F.; bake for 40 to 50 minutes or until knife inserted near center comes out clean. Cool on wire rack for 2 hours. Serve immediately or refrigerate. (Do not freeze as this will cause the crust to separate from the filling.)"], "facts": "283 calories; protein 6.4g 13% DV; carbohydrates 38.7g 13% DV; fat 12.1g 19% DV; cholesterol 58.7mg 20% DV; sodium 357mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9191/pumpkin-soup/", "name": "Pumpkin Soup", "summary": "\nThis delicious, cream-like soup is served at our family's Thanksgiving dinner every year. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F10%2F55802-Pumpkin-Soup-Photo-by-chibi-chef-2000.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 to 10 servings"]], "ingredients": ["6 cups chicken stock", "1 ½ teaspoons salt", "4 cups pumpkin puree", "1 teaspoon chopped fresh parsley", "1 cup chopped onion", "½ teaspoon chopped fresh thyme", "1 clove garlic, minced", "½ cup heavy whipping cream", "5  whole black peppercorns"], "direction": ["Heat stock, salt, pumpkin, onion, thyme, garlic, and peppercorns. Bring to a boil, reduce heat to low, and simmer for 30 minutes uncovered.", "Puree the soup in small batches (1 cup at a time) using a food processor or blender.", "Return to pan, and bring to a boil again. Reduce heat to low, and simmer for another 30 minutes, uncovered. Stir in heavy cream. Pour into soup bowls and garnish with fresh parsley."], "facts": "115 calories; protein 2.7g 5% DV; carbohydrates 13.5g 4% DV; fat 6.3g 10% DV; cholesterol 24.1mg 8% DV; sodium 1458.1mg 58% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/13045/broccoli-cheese-soup/", "name": "Broccoli Cheese Soup", "summary": "\nThis is a great, very flavorful soup. Good for serving at luncheons or special gatherings with a quiche. To make this soup a little fancier, add 1 cup sliced mushrooms and 1 cup white wine with the onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F306621.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["½ cup butter", "1  onion, chopped", "1 (16 ounce) package frozen chopped broccoli", "4 (14.5 ounce) cans chicken broth", "1 (1 pound) loaf processed cheese food, cubed", "2 cups milk", "1 tablespoon garlic powder", "⅔ cup cornstarch", "1 cup water"], "direction": ["In a stockpot, melt butter over medium heat. Cook onion in butter until softened. Stir in broccoli, and cover with chicken broth. Simmer until broccoli is tender, 10 to 15 minutes.", "Reduce heat, and stir in cheese cubes until melted. Mix in milk and garlic powder.", "In a small bowl, stir cornstarch into water until dissolved. Stir into soup; cook, stirring frequently, until thick."], "facts": "265 calories; protein 10g 20% DV; carbohydrates 15.1g 5% DV; fat 18.2g 28% DV; cholesterol 56.5mg 19% DV; sodium 1136.4mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/20519/best-ever-popcorn-balls/", "name": "Best Ever Popcorn Balls", "summary": "\nSweet, crunchy balls of popcorn. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2721791.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "20"], ["Yield:", "20 popcorn balls"]], "ingredients": ["¾ cup light corn syrup", "¼ cup margarine", "2 teaspoons cold water", "2 ⅝ cups confectioners' sugar", "1 cup marshmallows", "5 quarts plain popped popcorn"], "direction": ["In a saucepan over medium heat, combine the corn syrup, margarine, cold water, confectioners' sugar and marshmallows. Heat and stir until the mixture comes to a boil. Carefully combine the hot mixture with the popcorn, coating each kernel.", "Grease hands with vegetable shortening and quickly shape the coated popcorn into balls before it cools. Wrap with cellophane or plastic wrap and store at room temperature."], "facts": "191 calories; protein 0.9g 2% DV; carbohydrates 32.8g 11% DV; fat 7g 11% DV; cholesterol 0mg; sodium 151.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/87013/hash-brown-and-egg-casserole/", "name": "Hash Brown and Egg Casserole", "summary": "\nThis is my family's recipe that has been handed down through the years.  We've always used the maple flavored pork sausage but any kind is good.  This casserole is a nice and cozy breakfast or brunch meal that everyone will enjoy.  It's got the perfect taste with lots of cheese. Yum! Be sure to use a baking dish that is deep enough to cover with aluminum foil. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2331971.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "1 - 8x8 inch casserole"]], "ingredients": ["1 (2 pound) package frozen hash brown potatoes, thawed", "1 pound pork sausage", "1 small onion, diced", "5  eggs", "½ cup milk", "½ teaspoon onion powder", "⅛ teaspoon garlic powder", "salt and ground black pepper to taste", "12 ounces shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.", "Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.", "Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."], "facts": "616 calories; protein 33.5g 67% DV; carbohydrates 30.4g 10% DV; fat 48.9g 75% DV; cholesterol 259.5mg 87% DV; sodium 1141.7mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21220/mashed-sweet-potatoes/", "name": "Mashed Sweet Potatoes", "summary": "\nSimple mashed sweet potatoes flavored with maple syrup and butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4576638.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["additional:", "15 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  sweet potatoes, peeled and cubed", "¾ cup milk", "½ cup butter", "¾ cup maple syrup"], "direction": ["Bring a large pot of salted water to a boil. Add potatoes and cook until tender, 20 to 30 minutes.", "With an electric mixer on low, blend potatoes, slowly adding milk, about 1/2 a cup at a time. Use more or less to achieve desired texture. Add butter and maple syrup to taste. Blend until smooth. Serve warm."], "facts": "353 calories; protein 2.9g 6% DV; carbohydrates 50.9g 16% DV; fat 16.2g 25% DV; cholesterol 43.1mg 14% DV; sodium 160.1mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9487/pecan-pie/", "name": "Pecan Pie", "summary": "\nThis is a wonderfully rich, Southern pie recipe that is the best I've tried! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5819873.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 ¾ cups white sugar", "¼ cup dark corn syrup", "¼ cup butter", "1 tablespoon cold water", "2 teaspoons cornstarch", "3  eggs", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 ¼ cups chopped pecans", "1 (9 inch) unbaked pie shell"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium saucepan, combine the sugar, corn syrup, butter, water, and cornstarch. Bring to a full boil, and remove from heat.", "In a large bowl, beat eggs until frothy. Gradually beat in cooked syrup mixture. Stir in salt, vanilla, and pecans. Pour into pie shell.", "Bake in preheated oven for 45 to 50 minutes, or until filling is set."], "facts": "512 calories; protein 5.4g 11% DV; carbohydrates 65.1g 21% DV; fat 27.3g 42% DV; cholesterol 85mg 28% DV; sodium 272.7mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/221958/chef-johns-perfect-prime-rib/", "name": "Chef John's Perfect Prime Rib", "summary": "\nThis is a specific formula for achieving a perfectly pink prime rib cooked somewhere a shade under medium rare. To use this method you must have a full-sized, modern oven with a digital temperature setting that indicates when it is preheated. Older ovens with manual controls can vary greatly, and the doors may not have the proper insulation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4886145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs 20 mins"], ["additional:", "4 hrs"], ["total:", "6 hrs 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 pounds prime rib roast", "¼ cup unsalted butter, softened", "1 tablespoon freshly ground black pepper", "1 teaspoon herbes de Provence", "kosher salt"], "direction": ["Place rib roast on a plate and bring to room temperature, about 4 hours.", "Preheat an oven to 500 degrees F (260 degrees C).", "Combine butter, pepper, and herbes de Provence in a bowl; mix until well blended. Spread butter mixture evenly over entire roast. Season roast generously with kosher salt.", "Roast the 4-pound prime rib (see footnote if using a larger and smaller roast) in the preheated oven for 20 minutes. Turn the oven off and, leaving the roast in the oven with the door closed, let the roast sit in the oven for 2 hours. Remove roast from the oven, slice, and serve."], "facts": "1757 calories; protein 72.5g 145% DV; carbohydrates 1g; fat 160.6g 247% DV; cholesterol 361.6mg 121% DV; sodium 342.7mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/15820/puppy-chow/", "name": "Puppy Chow", "summary": "\nThis recipe can be used as an appetizer or dessert. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8096737.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "36"], ["Yield:", "2 to 3 dozen"]], "ingredients": ["9 cups crispy rice cereal squares", "½ cup peanut butter", "1 cup semi-sweet chocolate chips", "1 ½ cups confectioners' sugar"], "direction": ["In a saucepan over low heat, melt the chocolate; add peanut butter and mix until smooth.", "Remove from heat, add cereal and stir until coated.", "Pour powdered sugar into large plastic bag, add coated cereal and shake until well coated. Store in airtight container."], "facts": "90 calories; protein 1.7g 3% DV; carbohydrates 14.7g 5% DV; fat 3.2g 5% DV; cholesterol 0mg; sodium 69.9mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9111/cranberry-sauce/", "name": "Cranberry Sauce", "summary": "\nA Thanksgiving classic. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F743657.jpg", "meta": [["Servings:", "11"], ["Yield:", "8 - 12 servings"]], "ingredients": ["12 ounces cranberries", "1 cup white sugar", "1 cup orange juice"], "direction": ["In a medium sized saucepan over medium heat, dissolve the sugar in the orange juice. Stir in the cranberries and cook until the cranberries start to pop (about 10 minutes). Remove from heat and place sauce in a bowl. Cranberry sauce will thicken as it cools."], "facts": "95 calories; protein 0.3g 1% DV; carbohydrates 24.2g 8% DV; fat 0.1g; cholesterol 0mg; sodium 0.8mg."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/7322/favorite-old-fashioned-gingerbread/", "name": "Favorite Old Fashioned Gingerbread", "summary": "\nThis is everyone's holiday favorite, even the busy cook's, because it is so easy to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4558051.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "9"], ["Yield:", "1 9-inch square cake"]], "ingredients": ["½ cup white sugar", "½ cup butter", "1  egg", "1 cup molasses", "2 ½ cups all-purpose flour", "1 ½ teaspoons baking soda", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "½ teaspoon ground cloves", "½ teaspoon salt", "1 cup hot water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square pan.", "In a large bowl, cream together the sugar and butter. Beat in the egg, and mix in the molasses.", "In a bowl, sift together the flour, baking soda, salt, cinnamon, ginger, and cloves. Blend into the creamed mixture. Stir in the hot water. Pour into the prepared pan.", "Bake 1 hour in the preheated oven, until a knife inserted in the center comes out clean. Allow to cool in pan before serving."], "facts": "375 calories; protein 4.4g 9% DV; carbohydrates 65.3g 21% DV; fat 11.2g 17% DV; cholesterol 47.8mg 16% DV; sodium 434.7mg 17% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/240641/salt-dough/", "name": "Salt Dough", "summary": "\nThis recipe is much like Play-Doh®, but can be baked to a permanent finish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2974510.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["additional:", "1 hr"], ["total:", "3 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 cups"]], "ingredients": ["2 cups all-purpose flour", "1 cup salt", "1 cup cold water"], "direction": ["Mix flour and salt together in a bowl. Slowly mix water, a few tablespoons at a time, into flour mixture until dough is smooth and easy to handle. Knead dough for 10 minutes and let rest for 20 minutes.", "Preheat oven to 250 degrees F (120 degrees C).", "Form dough into desired shapes and arrange on a baking sheet.", "Bake in the preheated oven until dry and hard, about 2 hours. Allow to cool completely."], "facts": "228 calories; protein 6.5g 13% DV; carbohydrates 47.7g 16% DV; fat 0.6g 1% DV; cholesterol 0mg; sodium 23354.7mg 973% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/213073/slow-cooker-cocktail-smokies/", "name": "Slow Cooker Cocktail Smokies", "summary": "\nThese addictive little appetizers are so easy to make, and great for potlucks as well. This recipe could easily be changed up to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5950673.jpg", "meta": [["prep:", "5 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 5 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["2 (16 ounce) packages miniature smoked sausage links", "1 (8 ounce) jar grape jelly", "1 (12 ounce) bottle barbeque sauce"], "direction": ["Combine grape jelly and barbeque sauce in a slow cooker. Stir in the miniature smoked sausage links. Cook on High, until heated through, 2 to 3 hours."], "facts": "377 calories; protein 11.1g 22% DV; carbohydrates 28.3g 9% DV; fat 24.6g 38% DV; cholesterol 56.4mg 19% DV; sodium 1278.3mg 51% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/180314/pumpkin-spice-martini/", "name": "Pumpkin Spice Martini", "summary": "\nA fun, delicious cocktail for your next holiday gathering. A good friend shared this great idea! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1054947.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 martini"]], "ingredients": ["1 (1.5 fluid ounce) jigger vanilla flavored vodka (such as Stoli®)", "1 (1.5 fluid ounce) jigger Irish cream liqueur (such as Bailey's®)", "1 (1.5 fluid ounce) jigger pumpkin flavored liqueur (such as Hiram Walker®)", "1 cup ice cubes", "1 pinch ground cinnamon", "1 pinch ground nutmeg"], "direction": ["Pour the vanilla flavored vodka, Irish cream liqueur, and pumpkin flavored liqueur into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass, and garnish with a sprinkle of ground cinnamon and ground nutmeg to serve."], "facts": "427 calories; protein 0.1g; carbohydrates 40.7g 14% DV; fat 0.6g 1% DV; cholesterol 0mg; sodium 13mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/260313/christmas-reindeer-cupcakes/", "name": "Christmas Reindeer Cupcakes", "summary": "\nCute reindeer cupcakes for Christmas that the kids will absolutely adore. These cupcakes are great anytime of year, however, simply skip the reindeer decorating! You can get the kids to help you decorate for loads of family fun. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4561717.jpg", "meta": [["prep:", "1 hr"], ["cook:", "18 mins"], ["additional:", "1 hr 5 mins"], ["total:", "2 hrs 23 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes"]], "ingredients": ["9 tablespoons unsalted butter, room temperature", "¾ cup white sugar", "1 teaspoon vanilla extract", "2  eggs", "1 ½ cups sifted self-rising flour", "½ cup milk"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease a 12-cup muffin tin or line cups with paper liners.", "Combine 9 tablespoons butter, white sugar, and vanilla extract in a large bowl; beat with an electric mixer until smooth and creamy. Add eggs one at a time and beat until well combined. Fold in half the flour and 1/4 cup milk and stir to combine. Repeat with remaining flour and milk. Spoon batter into the prepared muffin cups, filling each 3/4 full.", "Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 18 minutes.", "Remove tin from oven and cool on a wire rack for 5 minutes. Remove cupcakes from the tin and cool completely on a wire rack before decorating, about 1 hour.", "Combine confections' sugar, 1 tablespoon butter, and 1 tablespoon milk in a large bowl; beat with an electric mixer until smooth and creamy. Thin frosting with a little milk or water, if necessary. Add food coloring and stir until frosting is uniformly brown. Add more food coloring, 1 drop at a time, until frosting is the color you like.", "Spread a thin layer of frosting on top of each cupcake. Break vanilla cookies in half. Place a cookie half on each cupcake as a mouth. Use a bit of frosting to \"glue\" a jelly bean onto the cookie for Rudolph's red nose. Stick 2 candy eyeballs into each cupcake. Break off a piece from each pretzel so they look like antlers and stick 2 into the top of each cupcakes. Shape chewy candies into ears and stick 2 into the sides of each cupcake."], "facts": "427 calories; protein 6.3g 13% DV; carbohydrates 77.1g 25% DV; fat 13.9g 21% DV; cholesterol 57.4mg 19% DV; sodium 815.3mg 33% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/256065/double-decker-marshmallow-fudge/", "name": "Double-Decker Marshmallow Fudge", "summary": "\nA layer of homemade marshmallow batter is poured over a pan of fudge to make a truly decadent version of this holiday favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4169418.jpg", "meta": [["prep:", "30 mins"], ["cook:", "17 mins"], ["additional:", "10 hrs 15 mins"], ["total:", "11 hrs 2 mins"], ["Servings:", "24"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["cooking spray", "¼ cup butter", "1 (14 ounce) can sweetened condensed milk", "3 cups semisweet chocolate chips", "½ cup cold water", "3 (.25 ounce) packages unflavored gelatin", "2 cups white sugar", "½ cup water", "1 cup confectioners' sugar"], "direction": ["Line a 9x13-inch cake or jelly roll pan with aluminum foil; coat with cooking spray.", "Melt butter in a medium saucepan over medium heat; stir in condensed milk. Pour in chocolate chips; cook and stir until melted, 5 to 10 minutes.", "Pour chocolate mixture into the prepared pan. Coat a spatula with cooking spray and use to press chocolate mixture into an even layer. Refrigerate fudge until cooled and set, about 2 hours.", "Combine 1/2 cup cold water and gelatin in a bowl; set aside until gelatin starts to thicken, about 15 minutes.", "Mix white sugar and 1/2 cup water in a saucepan over medium heat; cook and stir until sugar dissolves, 5 to 8 minutes. Bring sugar mixture to a boil and cook until temperature reaches 240 degrees F (116 degrees C) on a candy thermometer, 2 to 3 minutes. Remove from heat.", "Slowly pour sugar mixture into gelatin mixture while simultaneously beating with an electric mixer set on low. Gradually increase speed to high and continue beating until marshmallow batter is very thick but not stiff, 10 to 15 minutes.", "Pour marshmallow batter over fudge, smoothing the surface with spatula coated with cooking spray. Let sit uncovered at room temperature until completely set, about 6 hours.", "Dust the top of marshmallow layer with most of the confectioners' sugar. Refrigerate marshmallow fudge for at least 2 hours.", "Lift marshmallow fudge out of the pan by the edges of the foil and place on a large cutting board. Dip a large knife in the remaining confectioners' sugar and slice fudge into 1 1/2-inch squares, continually dipping knife in the sugar after each slice."], "facts": "258 calories; protein 2.9g 6% DV; carbohydrates 44g 14% DV; fat 9.6g 15% DV; cholesterol 10.6mg 4% DV; sodium 38.9mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/57028/amazingly-good-eggnog/", "name": "Amazingly Good Eggnog", "summary": "\nIt's taken me several years to perfect this recipe. Now everyone asks, 'When are you making the eggnog?!' This uses cooked eggs for safety, and you can use more or less rum to taste.  It's a bit of work to make, but well worth it.  You'll never buy store-bought eggnog again! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5911445.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 28 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 cups milk", "5  whole cloves", "½ teaspoon vanilla extract", "1 teaspoon ground cinnamon", "12  egg yolks", "1 ½ cups sugar", "2 ½ cups light rum", "4 cups light cream", "2 teaspoons vanilla extract", "½ teaspoon ground nutmeg"], "direction": ["Combine milk, cloves, 1/2 teaspoon vanilla, and cinnamon in a saucepan, and heat over lowest setting for 5 minutes.  Slowly bring milk mixture to a boil.", "In a large bowl, combine egg yolks and sugar.  Whisk together until fluffy.  Whisk hot milk mixture slowly into the eggs. Pour mixture into saucepan. Cook over medium heat, stirring constantly for 3 minutes, or until thick.  Do not allow mixture to boil.  Strain to remove cloves, and let cool for about an hour.", "Stir in rum, cream, 2 teaspoon vanilla, and nutmeg.  Refrigerate overnight  before serving."], "facts": "404 calories; protein 4.9g 10% DV; carbohydrates 32.1g 11% DV; fat 17.1g 26% DV; cholesterol 59.3mg 20% DV; sodium 65.9mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/17345/buche-de-noel/", "name": "Buche de Noel", "summary": "\nBuche de Noel is the French name for a Christmas cake shaped like a log. This one is a heavenly flourless chocolate cake rolled with chocolate whipped cream. Traditionally, Buche de Noel is decorated with confectioners' sugar to resemble snow on a Yule log. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3023127.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 buche de Noel"]], "ingredients": ["2 cups heavy cream", "½ cup confectioners' sugar", "½ cup unsweetened cocoa powder", "1 teaspoon vanilla extract", "6  egg yolks", "½ cup white sugar", "⅓ cup unsweetened cocoa powder", "1 ½ teaspoons vanilla extract", "⅛ teaspoon salt", "6  egg whites", "¼ cup white sugar", "confectioners' sugar for dusting"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate.", "In a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until thick and pale. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks.  Immediately fold the yolk mixture into the whites. Spread the batter evenly into the prepared pan.", "Bake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes.", "Unroll the cake, and spread the filling to within 1 inch of the edge. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. Dust with confectioners' sugar before serving."], "facts": "276 calories; protein 5.1g 10% DV; carbohydrates 27.6g 9% DV; fat 17.7g 27% DV; cholesterol 156.8mg 52% DV; sodium 72.4mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/139544/marzipan-christmas-kringle-juleskringle/", "name": "Marzipan Christmas Kringle (Juleskringle)", "summary": "\nThis marzipan tubular bread is an ABSOLUTE must for the Christmas season, and a traditional dinner would not be complete without this Christmas Kringle for dessert. It may seem complicated at first glance, but if you follow the recipe step by step, it is actually quite easy and you will amaze your family with this beautiful dessert. This is an extremely rich and decadent treat so guests only need a little. Often a coin is hidden in the kringle and it is thought that the finder will be guaranteed good luck for the upcoming year. As such, it is considered bad luck not to indulge at Christmas! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1545324.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "14 hrs"], ["total:", "15 hrs"], ["Servings:", "15"], ["Yield:", "1 loaf"]], "ingredients": ["½ cup warm milk", "1 tablespoon white sugar", "1 (.25 ounce) envelope active dry yeast", "1 cup heavy cream", "3 ½ cups all-purpose flour", "¼ cup white sugar", "1 teaspoon salt", "1 teaspoon ground cardamom", "½ cup butter", "1 (8 ounce) can almond paste", "½ cup crushed sliced almonds", "½ cup white sugar", "1 teaspoon ground cinnamon", "1 teaspoon almond extract", "½ cup white sugar", "1  egg white, beaten", "½ cup sliced almonds"], "direction": ["In a small bowl, stir together the milk and sugar. Sprinkle the yeast over the top and let stand for 10 minutes to dissolve. Stir in cream.", "In a separate bowl, stir together the flour, sugar, salt and cardamom. Cut in the butter using a pastry blender or pinching with your fingers until it is a course mealy texture. Stir in the yeast mixture until well blended. Pat into a ball, flatten slightly, then wrap in plastic wrap. Refrigerate for 12 to 24 hours.", "To make the filling, mix the almond paste, almonds, sugar, cinnamon and almond extract using an electric mixer until evenly blended. It may be crumbly.", "Roll the chilled dough out into a 2 inch wide and 24 inch long rectangle. Spread the filling to within 2 inches of the sides and roll up into a tube. Cover your work surface with sugar, and roll the tube of dough in the sugar to coat thoroughly. Roll and stretch the dough out to form a long rope about 40 inches long. Place on a parchment lined baking sheet and shape into a pretzel shape.", "Brush the top of the pretzel with egg white and sprinkle with almonds. Cover loosely with a towel and let rise for 45 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Bake the kringle in the preheated oven until golden brown, 25 to 30 minutes. Cut into slices to serve."], "facts": "397 calories; protein 6.8g 14% DV; carbohydrates 49.3g 16% DV; fat 19.8g 31% DV; cholesterol 38.7mg 13% DV; sodium 213.9mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/17160/christmas-stollen/", "name": "Christmas Stollen", "summary": "\nI got this recipe while I was head baker at London's Dorchester Hotel. It's packed with dried fruit and filled with a marzipan surprise. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "1 hr 40 mins"], ["total:", "3 hrs"], ["Servings:", "15"], ["Yield:", "1 loaf"]], "ingredients": ["1 tablespoon active dry yeast", "⅔ cup warm milk (110 degrees F/45 degrees C)", "1  large egg", "⅓ cup white sugar", "½ tablespoon salt", "⅓ cup butter, softened", "2 ½ cups bread flour", "⅓ cup currants", "⅓ cup sultana raisins", "⅓ cup red candied cherries, quartered", "⅔ cup diced candied citron", "6 ounces marzipan", "1 tablespoon confectioners' sugar", "¼ teaspoon ground cinnamon"], "direction": ["In a small bowl, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes.", "In a large bowl, combine the yeast mixture with the egg, white sugar, salt, butter, and 2 cups bread flour; beat well. Add the remaining flour, 1/4 cup at a time, stirring well after each addition. When the dough has begun to pull together, turn it out onto a lightly floured surface, and knead in the currants, raisins, dried cherries, and citrus peel. Continue kneading until smooth, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "Lightly grease a cookie sheet. Deflate the dough and turn it out onto a lightly floured surface. Roll the marzipan into a rope and place it in the center of the dough. Fold the dough over to cover it; pinch the seams together to seal. Place the loaf, seam side down, on the prepared baking sheet. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).", "Bake in the preheated oven for 10 minutes, then reduce heat to 300 degrees F (150 degrees C), and bake for a further 30 to 40 minutes, or until golden brown. Allow loaf to cool on a wire rack. Dust the cooled loaf with confectioners' sugar, and sprinkle with the cinnamon."], "facts": "178 calories; protein 2.2g 5% DV; carbohydrates 28.8g 9% DV; fat 6.8g 10% DV; cholesterol 24.1mg 8% DV; sodium 306.5mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/24308/eggnog-cheesecake-iii/", "name": "Eggnog Cheesecake III", "summary": "\nThis is a delicious cheesecake for eggnog lovers. The secret to a smooth  cheesecake is to cream the cream cheese in a food processor for several minutes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F756445.jpg", "meta": [["prep:", "30 mins"], ["cook:", "55 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "16"], ["Yield:", "1 9-inch cake"]], "ingredients": ["1 cup graham cracker crumbs", "2 tablespoons white sugar", "3 tablespoons melted butter", "3 (8 ounce) packages cream cheese, softened", "1 cup white sugar", "3 tablespoons all-purpose flour", "¾ cup eggnog", "2  eggs", "2 tablespoons rum", "1 pinch ground nutmeg"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "In a medium bowl combine graham cracker crumbs, 2 tablespoons sugar and butter.  Press into the bottom of a 9 inch spring form pan.", "Bake in preheated oven for 10 minutes.  Place on a wire rack to cool.", "Preheat oven to 425 degrees F (220 degrees C).", "In a food processor combine cream cheese, 1 cup sugar, flour and eggnog; process until smooth.  Blend in eggs, rum and nutmeg.  Pour mixture into cooled crust.", "Bake in preheated oven for 10 minutes.", "Reduce heat to 250 and bake for 45 minutes, or until center of cake is barely firm to the touch.  Remove from the oven and immediately loosen cake from rim.  Let cake cool completely before removing the rim."], "facts": "277 calories; protein 5g 10% DV; carbohydrates 22g 7% DV; fat 18.9g 29% DV; cholesterol 82.2mg 27% DV; sodium 186.7mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/214012/grandmas-gingerbread-pancakes/", "name": "Grandma's Gingerbread Pancakes", "summary": "\nMy dear Grammie was making gingerbread one morning and my brother and I arrived, starving! She altered the recipe slightly, put it on the grill and the result is this delicious recipe. The smell of it cooking always takes me back to that morning--mmmm! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F533525.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "10"], ["Yield:", "10 pancakes"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "¼ teaspoon baking soda", "¼ teaspoon salt", "½ teaspoon ground dried ginger", "1 teaspoon ground cinnamon", "1  egg", "½ teaspoon vanilla extract", "¼ cup molasses", "1 ½ cups water"], "direction": ["Whisk the flour, baking powder, baking soda, salt, ginger, and cinnamon in a bowl; set aside. Beat the egg in a separate mixing bowl with the vanilla and molasses until smooth. Whisk in the water until completely incorporated. Stir the flour mixture into the molasses mixture until just combined -- a few lumps are okay.", "Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter."], "facts": "101 calories; protein 2.6g 5% DV; carbohydrates 20.9g 7% DV; fat 0.7g 1% DV; cholesterol 18.6mg 6% DV; sodium 149.9mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/25018/butter-rich-spritz-butter-cookies/", "name": "Butter Rich Spritz Butter Cookies", "summary": "\nThese are wonderful cookies from the press. They are rich in flavor. My mom has made these cookies for years for all of the holidays. She even used food coloring for the different designs, like green trees, etc.The kids love to decorate them as much as they love to eat them. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F529520.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 mins"], ["additional:", "2 mins"], ["total:", "18 mins"], ["Servings:", "36"], ["Yield:", "3 dozen"]], "ingredients": ["2 ½ cups all-purpose flour", "½ teaspoon salt", "1 cup butter, softened", "1 ¼ cups confectioners' sugar", "2  egg yolks", "½ teaspoon almond extract", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C). Sift together the flour and salt; set aside.", "In a medium bowl, cream together the butter and sugar. Stir in the egg yolks, almond extract and vanilla extract.  Gradually blend in the sifted ingredients. Fill a cookie press with dough and shoot cookies about 1 1/2 inches apart onto an ungreased cookie sheet. If you like, decorate with sugar or sprinkles at this time.", "Bake for 6 to 8 minutes in the preheated oven."], "facts": "97 calories; protein 1.1g 2% DV; carbohydrates 10.8g 4% DV; fat 5.4g 8% DV; cholesterol 24.9mg 8% DV; sodium 69.3mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/23040/hot-buttered-rum-batter/", "name": "Hot Buttered Rum Batter", "summary": "\nThis is THE batter to use for absolutely delicious and buttery Hot Buttered Rums! You can keep this in the freezer for up to 3 months. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1123112.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "20 mins"], ["total:", "40 mins"], ["Servings:", "100"], ["Yield:", "100 servings"]], "ingredients": ["1 pound butter", "1 pound brown sugar", "1 pound confectioners' sugar", "1 quart vanilla ice cream, softened", "1 tablespoon ground cinnamon", "1 teaspoon ground nutmeg"], "direction": ["Melt butter in a large pot over medium heat. Blend in brown sugar and confectioners' sugar. Remove from heat, and whisk in the ice cream, cinnamon, and nutmeg. Pour mixture into a plastic container, seal, and freeze.", "In a coffee mug, measure 1 tablespoon Hot Buttered Rum Batter and 1 fluid ounce of rum, then fill cup with boiling water. Stir, and sprinkle top of drink with nutmeg."], "facts": "78 calories; protein 0.2g; carbohydrates 10.3g 3% DV; fat 4.3g 7% DV; cholesterol 12.1mg 4% DV; sodium 31.7mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21018/gingerbread-waffles-with-hot-chocolate-sauce/", "name": "Gingerbread Waffles with Hot Chocolate Sauce", "summary": "\nYummy and delicious. These extraordinary waffles are flavored with molasses and spices. Topped with homemade chocolate sauce, they are perfect for a special breakfast treat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888716.jpg", "meta": [["prep:", "25 mins"], ["cook:", "25 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup light molasses", "½ cup butter", "1 ½ teaspoons baking soda", "½ cup milk", "1  egg", "2 cups all-purpose flour", "1 ½ teaspoons ground ginger", "½ teaspoon ground cinnamon", "½ teaspoon salt", "2 cups boiling water", "1 cup white sugar", "2 tablespoons cornstarch", "½ cup unsweetened cocoa powder", "1 teaspoon salt", "2 teaspoons vanilla extract", "2 tablespoons butter"], "direction": ["In a small saucepan, heat molasses and 1/2 cup butter until almost boiling. Remove from heat and let cool slightly. Stir in baking soda, milk and egg.", "In a large bowl, sift together flour, ginger, cinnamon and salt. Make a well in the center and pour in the molasses mixture. Mix until smooth.", "Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot with chocolate sauce.", "To make chocolate sauce: In a saucepan, combine water, 1 cup sugar, cornstarch, cocoa powder and 1 teaspoon salt. Cook over medium heat, stirring constantly, until mixture comes to a boil. Remove from heat and add vanilla and 2 tablespoons butter; stir until smooth."], "facts": "664 calories; protein 7.7g 15% DV; carbohydrates 114g 37% DV; fat 21.9g 34% DV; cholesterol 83.5mg 28% DV; sodium 1077.7mg 43% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/219587/christmas-prime-rib/", "name": "Christmas Prime Rib", "summary": "\nDelicious coating on outside of roast, and perfect roasting time. Plan on 1 pound per person. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1875698.jpg", "meta": [["prep:", "15 mins"], ["cook:", "2 hrs"], ["additional:", "8 hrs 30 mins"], ["total:", "10 hrs 45 mins"], ["Servings:", "12"], ["Yield:", "1 prime rib roast"]], "ingredients": ["1 (6 pound) boneless prime rib roast", "2 tablespoons prepared horseradish", "2 tablespoons Dijon mustard", "2 teaspoons kosher salt", "2 teaspoons coarsely ground black pepper", "2 teaspoons dried thyme", "2 teaspoons garlic powder", "2 stalks celery, cut into 2-inch pieces", "1  carrot, cut into 2-inch pieces", "1 small unpeeled onion, quartered and separated", "2 teaspoons concentrated beef base (paste)", "1 ½ cups water", "1 teaspoon cornstarch", "1 teaspoon water"], "direction": ["The day before serving, remove the roast from the package, and dry thoroughly with paper towels. Set the roast on a baking sheet, and place in refrigerator overnight. Remove from refrigerator 1 hour before cooking time to allow meat to reach room temperature. Rub the roast all over with horseradish and Dijon mustard. In a bowl, mix together the kosher salt, black pepper, thyme, and garlic powder; sprinkle the spice mix over the roast.", "Preheat oven to 450 degrees F (230 degrees C). Place the celery, carrot, and onion pieces into the bottom of a roasting pan. Place the roast on top of the vegetables.", "Roast in the preheated oven for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and roast until the meat is browned and an instant-read meat thermometer inserted into the thickest part of the roast reads 130 to 135 degrees F (54 to 57 degrees C) for medium-rare. Remove from oven, transfer roast to a platter, and cover with a tent of aluminum foil. Allow to rest for 30 minutes. Temperature of the meat will rise about 10 degrees during resting time.", "To make au jus sauce, skim excess fat from the pan drippings in the roasting pan. Place the pan over a burner set to medium heat, and stir in the beef base and 1 1/2 cup of water. Bring to a boil, scraping and dissolving any brown flavor bits from the bottom of the pan. Strain out and discard the vegetables. Combine the cornstarch and 1 teaspoon of water in a small bowl, and whisk the mixture into the sauce. Allow the sauce to thicken slightly (sauce will be thin), pour into a gravy boat, and serve with roast."], "facts": "410 calories; protein 22.7g 45% DV; carbohydrates 3g 1% DV; fat 33.5g 52% DV; cholesterol 84.3mg 28% DV; sodium 465.8mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/15985/grandmas-corn-pudding/", "name": "Grandma's Corn Pudding", "summary": "\nThis corn pudding is definitely comfort food. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6033726.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servngs"]], "ingredients": ["5  eggs", "⅓ cup butter, melted", "¼ cup white sugar", "½ cup milk", "4 tablespoons cornstarch", "1 (15.25 ounce) can whole kernel corn", "2 (14.75 ounce) cans cream-style corn"], "direction": ["Preheat oven to 400 Degrees F (200 degrees C). Grease a 2 quart casserole dish.", "In a large bowl, lightly beat eggs. Add melted butter, sugar, and milk. Whisk in cornstarch. Stir in corn and creamed corn. Blend well.  Pour mixture into prepared casserole dish.", "Bake for 1 hour."], "facts": "277 calories; protein 7.7g 16% DV; carbohydrates 39.6g 13% DV; fat 12g 19% DV; cholesterol 137.8mg 46% DV; sodium 558.2mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/230466/savory-pumpkin-hummus/", "name": "Savory Pumpkin Hummus", "summary": "\nI tinkered a bit with what I found in other recipes and this is the result. I think I like my results. I stirred in a small handful of tamari-flavored pumpkin seeds just before serving (couldn't find plain ones) and sprinkled a bit of paprika on top to make it look nice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1526126.jpg", "meta": [["prep:", "15 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 15 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["2 tablespoons lemon juice", "2 tablespoons tahini", "3 cloves garlic", "¾ teaspoon salt", "2 (15 ounce) cans garbanzo beans, drained", "2 teaspoons extra-virgin olive oil", "1 (15 ounce) can pumpkin puree", "1 teaspoon ground cumin", "½ teaspoon cayenne pepper", "¼ cup toasted pumpkin seed kernels, or more to taste", "1 pinch paprika"], "direction": ["Pulse lemon juice, tahini, garlic, and salt together in a food processor or blender until smooth. Add garbanzo beans and olive oil and pulse until smooth. Add pumpkin, cumin, and cayenne pepper; process until well blended. Transfer hummus to a container with a lid and refrigerate at least 2 hours.", "Fold pumpkin seeds into hummus; garnish with paprika."], "facts": "81 calories; protein 3g 6% DV; carbohydrates 11.3g 4% DV; fat 3.1g 5% DV; cholesterol 0mg; sodium 280.7mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9174/peanut-butter-pie/", "name": "Peanut Butter Pie", "summary": "\nPeanut butter refrigerator pie, very easy to make. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F190359.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 (9 inch) prepared graham cracker crust", "1 (8 ounce) package cream cheese, softened", "½ cup creamy peanut butter", "½ cup confectioners' sugar", "1 (16 ounce) container frozen whipped topping, thawed", "15  miniature chocolate covered peanut butter cups, unwrapped"], "direction": ["Mix the cream cheese, confectioners' sugar and peanut butter together until smooth. Fold in 1/2 of the whipped topping. Spoon the mixture into the graham cracker crust.", "Place the remaining whipped topping over the top of the peanut butter mixture and garnish with the peanut butter cups. Chill for at least 2 hours or overnight before serving."], "facts": "605 calories; protein 9.5g 19% DV; carbohydrates 49.5g 16% DV; fat 43.1g 66% DV; cholesterol 31.7mg 11% DV; sodium 366.8mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/22617/best-spinach-dip-ever/", "name": "Best Spinach Dip Ever", "summary": "\nThis is my dad's recipe. The entire family loves it! A flavorful spinach mixture fills a tasty bread bowl. Your family will love it, too. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F748478.jpg", "meta": [["prep:", "15 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 15 mins"], ["Servings:", "6"], ["Yield:", "1 bread bowl dip"]], "ingredients": ["1 cup mayonnaise", "1 (16 ounce) container sour cream", "1 (1.8 ounce) package dry leek soup mix", "1 (4 ounce) can water chestnuts, drained and chopped", "½ (10 ounce) package frozen chopped spinach, thawed and drained", "1 (1 pound) loaf round sourdough bread"], "direction": ["In a medium bowl, mix together mayonnaise, sour cream, dry leek soup mix, water chestnuts and chopped spinach. Chill in the refrigerator 6 hours, or overnight.", "Remove top and interior of sourdough bread. Fill with mayonnaise mixture. Tear removed bread chunks into pieces for dipping."], "facts": "682 calories; protein 13.3g 27% DV; carbohydrates 53.2g 17% DV; fat 47.4g 73% DV; cholesterol 48.3mg 16% DV; sodium 1183.4mg 47% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/18942/hot-spiked-cider/", "name": "Hot Spiked Cider", "summary": "\nA 'spiked' version of the traditional hot cider - great for fall or holiday gatherings.  This can be made in large quantities and kept warm in an electric coffee server. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1700738.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 quart water", "3  orange spice tea bags", "½ cup light brown sugar", "2 cups apple cider", "1 ½ cups light rum", "8  cinnamon sticks", "3 teaspoons butter"], "direction": ["Pour water into a large saucepan and bring to a boil. Remove from heat and toss in the orange spice tea bags. Cover and let steep 5 minutes.  Remove tea bags and stir in sugar, apple cider, rum, and 2 of the cinnamon sticks.  Heat just to steaming -- do not boil.", "Ladle hot cider into 6 mugs and drop 1/2 teaspoon butter into each.  Garnish with a cinnamon \"swizzle\" stick."], "facts": "260 calories; protein 0g; carbohydrates 29g 10% DV; fat 2g 3% DV; cholesterol 5.4mg 2% DV; sodium 34mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21649/sausage-balls/", "name": "Sausage Balls", "summary": "\nThese are so yummy! My family makes every Christmas morning. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F466969.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "15"], ["Yield:", "30 sausage balls"]], "ingredients": ["1 pound ground pork sausage", "2 cups biscuit baking mix", "1 pound sharp Cheddar cheese, shredded"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, combine sausage, biscuit baking mix and cheese. Form into walnut size balls and place on baking sheets.", "Bake in preheated oven for 20 to 25 minutes, until golden brown and sausage is cooked through."], "facts": "264 calories; protein 12.8g 26% DV; carbohydrates 10.5g 3% DV; fat 19g 29% DV; cholesterol 49.1mg 16% DV; sodium 659.5mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Feasy-sugar-cookies.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/18379/best-green-bean-casserole/", "name": "Best Green Bean Casserole", "summary": "\nThis great variation of the traditional green bean casserole is topped with French fried onions and Cheddar cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1656932.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (14.5 ounce) cans green beans, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (6 ounce) can French fried onions", "1 cup shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place green beans and soup in a large microwave-safe bowl.  Mix well and heat in the microwave on HIGH until warm (3 to 5 minutes). Stir in 1/2 cup of cheese and heat mixture for another 2 to 3 minutes. Transfer green bean mixture to a casserole dish and sprinkle with French fried onions and remaining cheese.", "Bake in a preheated 350 degrees F (175 degrees C) oven until the cheese melts and the onions just begin to brown."], "facts": "322 calories; protein 6.6g 13% DV; carbohydrates 20.2g 7% DV; fat 23.2g 36% DV; cholesterol 19.8mg 7% DV; sodium 1068.3mg 43% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/12142/sweet-potato-pie-i/", "name": "Sweet Potato Pie I", "summary": "\nThis recipe was shared with me by a special friend in Atlanta, GA.  It has long been a favorite, and everyone who tastes it says it is the best they have ever had. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F06%2F7304125_original-2000.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 50 mins"], ["total:", "2 hrs 20 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 (1 pound) sweet potato", "½ cup butter, softened", "1 cup white sugar", "½ cup milk", "2  eggs", "½ teaspoon ground nutmeg", "½ teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 (9 inch) unbaked pie crust"], "direction": ["Boil sweet potato whole in skin for 40 to 50 minutes, or until done.  Run cold water over the sweet potato, and remove the skin.", "Break apart sweet potato in a bowl.  Add butter, and mix well with mixer. Stir in sugar, milk, eggs, nutmeg, cinnamon and vanilla. Beat on medium speed until mixture is smooth.  Pour filling into an unbaked pie crust.", "Bake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until knife inserted in center comes out clean.  Pie will puff up like a souffle, and then will sink down as it cools."], "facts": "389 calories; protein 4.5g 9% DV; carbohydrates 47.8g 15% DV; fat 20.6g 32% DV; cholesterol 78.2mg 26% DV; sodium 253.7mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/", "name": "The Best Rolled Sugar Cookies", "summary": "\nWhenever you make these cookies for someone, be sure to bring along several copies of the recipe!  You will be asked for it, I promise! NOTE: I make icing with confectioners' sugar and milk. I make it fairly thin, as I 'paint' the icing on the cookies with a pastry brush. Thin enough to spread easily but not so thin that it just makes your cookies wet and runs off. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F519229_original-2000.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "2 hrs 32 mins"], ["total:", "3 hrs"], ["Servings:", "60"], ["Yield:", "5 dozen"]], "ingredients": ["1 ½ cups butter, softened", "2 cups white sugar", "4  eggs", "1 teaspoon vanilla extract", "5 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt"], "direction": ["In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).", "Preheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.", "Bake 6 to 8 minutes in preheated oven. Cool completely."], "facts": "110 calories; protein 1.5g 3% DV; carbohydrates 14.7g 5% DV; fat 5g 8% DV; cholesterol 24.6mg 8% DV; sodium 92.6mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9401/salmon-patties-i/", "name": "Salmon Patties I", "summary": "\nThese salmon patties are delicious for lunch or dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7697013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "5"], ["Yield:", "4 to 6 servings"]], "ingredients": ["1 (14.75 ounce) can canned salmon", "1  egg", "¼ cup chopped onion", "½ cup seasoned dry bread crumbs", "1 tablespoon olive oil"], "direction": ["Drain and reserve liquid from salmon. Mix egg, onion, bread crumbs and salmon together.", "Make into patties. If mixture is too dry to form into patties, add reserved liquid from salmon.", "In a  frying pan, heat olive oil. Place patties in pan.  Brown on each side, turning gently.  Drain on paper towels and serve."], "facts": "224 calories; protein 22.3g 45% DV; carbohydrates 9g 3% DV; fat 10.4g 16% DV; cholesterol 73.7mg 25% DV; sodium 522.8mg 21% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/229658/oven-roasted-turkey-breast/", "name": "Oven-Roasted Turkey Breast", "summary": "\nEasy to make, great for dinner, leftovers and sandwiches. Adapted for our 2-person household from larger recipes for larger families with larger appetites. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2663892.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 35 mins"], ["total:", "1 hr 50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¼ cup butter, softened", "1 clove garlic, minced", "1 teaspoon paprika", "1 teaspoon Italian seasoning", "½ teaspoon salt-free garlic and herb seasoning blend (such as Mrs. Dash®)", "salt and ground black pepper to taste", "1 (3 pound) turkey breast with skin", "1 teaspoon minced shallot", "1 tablespoon butter", "1 splash dry white wine", "1 cup chicken stock", "3 tablespoons all-purpose flour", "2 tablespoons half-and-half"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Mix 1/4 cup butter, garlic, paprika, Italian seasoning, garlic and herb seasoning, salt, and black pepper in a bowl. Place turkey breast with skin side up into a roasting pan. Loosen skin with your fingers; brush half the butter mixture over the turkey breast and underneath the skin. Reserve remaining butter mixture. Tent turkey breast loosely with aluminum foil.", "Roast in the preheated oven for 1 hour; baste turkey breast with remaining butter mixture. Return to oven and roast until the juices run clear and an instant-read meat thermometer inserted into the thickest part of the breast, not touching bone, reads 165 degrees F (65 degrees C), about 30 more minutes. Let turkey breast rest 10 to 15 minutes before serving.", "While turkey is resting, transfer pan drippings to a skillet. Skim off excess grease, leaving about 1 tablespoon in skillet. Place skillet over low heat; cook and stir shallot in turkey grease until opaque, about 5 minutes. Melt 1 tablespoon butter in skillet with shallot and whisk in white wine, scraping any browned bits of food from skillet. Whisk in chicken stock and flour until smooth. Bring to a simmer, whisking constantly, until thickened. For a creamier, lighter gravy, whisk in half-and-half."], "facts": "385 calories; protein 60.3g 121% DV; carbohydrates 4.3g 1% DV; fat 11.8g 18% DV; cholesterol 191.3mg 64% DV; sodium 313.8mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/22755/libbys-famous-pumpkin-pie/", "name": "Libby's® Famous Pumpkin Pie", "summary": "\nWhether you're hosting a festive party or a casual get-together with friends, our Famous Pumpkin Pie will make entertaining easy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1680564.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch deep dish pie"]], "ingredients": ["1 (9 inch) unbaked deep dish pie crust", "¾ cup white sugar", "1 teaspoon ground cinnamon", "½ teaspoon salt", "½ teaspoon ground ginger", "¼ teaspoon ground cloves", "2  eggs", "1 (15 ounce) can LIBBY'S® 100% Pure Pumpkin", "1 (12 fluid ounce) can NESTLE® CARNATION® Evaporated Milk"], "direction": ["Preheat oven to 425 degrees F.", "Combine sugar, salt, cinnamon, ginger and cloves in small bowl. Beat eggs lightly in large bowl. Stir in pumpkin and sugar-spice mixture. Gradually stir in evaporated milk. Pour into pie shell.", "Bake for 15 minutes. Reduce temperature to 350 degrees F.; bake for 40 to 50 minutes or until knife inserted near center comes out clean. Cool on wire rack for 2 hours. Serve immediately or refrigerate. (Do not freeze as this will cause the crust to separate from the filling.)"], "facts": "283 calories; protein 6.4g 13% DV; carbohydrates 38.7g 13% DV; fat 12.1g 19% DV; cholesterol 58.7mg 20% DV; sodium 357mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9191/pumpkin-soup/", "name": "Pumpkin Soup", "summary": "\nThis delicious, cream-like soup is served at our family's Thanksgiving dinner every year. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F10%2F55802-Pumpkin-Soup-Photo-by-chibi-chef-2000.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 to 10 servings"]], "ingredients": ["6 cups chicken stock", "1 ½ teaspoons salt", "4 cups pumpkin puree", "1 teaspoon chopped fresh parsley", "1 cup chopped onion", "½ teaspoon chopped fresh thyme", "1 clove garlic, minced", "½ cup heavy whipping cream", "5  whole black peppercorns"], "direction": ["Heat stock, salt, pumpkin, onion, thyme, garlic, and peppercorns. Bring to a boil, reduce heat to low, and simmer for 30 minutes uncovered.", "Puree the soup in small batches (1 cup at a time) using a food processor or blender.", "Return to pan, and bring to a boil again. Reduce heat to low, and simmer for another 30 minutes, uncovered. Stir in heavy cream. Pour into soup bowls and garnish with fresh parsley."], "facts": "115 calories; protein 2.7g 5% DV; carbohydrates 13.5g 4% DV; fat 6.3g 10% DV; cholesterol 24.1mg 8% DV; sodium 1458.1mg 58% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/13045/broccoli-cheese-soup/", "name": "Broccoli Cheese Soup", "summary": "\nThis is a great, very flavorful soup. Good for serving at luncheons or special gatherings with a quiche. To make this soup a little fancier, add 1 cup sliced mushrooms and 1 cup white wine with the onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F306621.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["½ cup butter", "1  onion, chopped", "1 (16 ounce) package frozen chopped broccoli", "4 (14.5 ounce) cans chicken broth", "1 (1 pound) loaf processed cheese food, cubed", "2 cups milk", "1 tablespoon garlic powder", "⅔ cup cornstarch", "1 cup water"], "direction": ["In a stockpot, melt butter over medium heat. Cook onion in butter until softened. Stir in broccoli, and cover with chicken broth. Simmer until broccoli is tender, 10 to 15 minutes.", "Reduce heat, and stir in cheese cubes until melted. Mix in milk and garlic powder.", "In a small bowl, stir cornstarch into water until dissolved. Stir into soup; cook, stirring frequently, until thick."], "facts": "265 calories; protein 10g 20% DV; carbohydrates 15.1g 5% DV; fat 18.2g 28% DV; cholesterol 56.5mg 19% DV; sodium 1136.4mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/20519/best-ever-popcorn-balls/", "name": "Best Ever Popcorn Balls", "summary": "\nSweet, crunchy balls of popcorn. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2721791.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "20"], ["Yield:", "20 popcorn balls"]], "ingredients": ["¾ cup light corn syrup", "¼ cup margarine", "2 teaspoons cold water", "2 ⅝ cups confectioners' sugar", "1 cup marshmallows", "5 quarts plain popped popcorn"], "direction": ["In a saucepan over medium heat, combine the corn syrup, margarine, cold water, confectioners' sugar and marshmallows. Heat and stir until the mixture comes to a boil. Carefully combine the hot mixture with the popcorn, coating each kernel.", "Grease hands with vegetable shortening and quickly shape the coated popcorn into balls before it cools. Wrap with cellophane or plastic wrap and store at room temperature."], "facts": "191 calories; protein 0.9g 2% DV; carbohydrates 32.8g 11% DV; fat 7g 11% DV; cholesterol 0mg; sodium 151.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/87013/hash-brown-and-egg-casserole/", "name": "Hash Brown and Egg Casserole", "summary": "\nThis is my family's recipe that has been handed down through the years.  We've always used the maple flavored pork sausage but any kind is good.  This casserole is a nice and cozy breakfast or brunch meal that everyone will enjoy.  It's got the perfect taste with lots of cheese. Yum! Be sure to use a baking dish that is deep enough to cover with aluminum foil. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2331971.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "1 - 8x8 inch casserole"]], "ingredients": ["1 (2 pound) package frozen hash brown potatoes, thawed", "1 pound pork sausage", "1 small onion, diced", "5  eggs", "½ cup milk", "½ teaspoon onion powder", "⅛ teaspoon garlic powder", "salt and ground black pepper to taste", "12 ounces shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.", "Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.", "Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."], "facts": "616 calories; protein 33.5g 67% DV; carbohydrates 30.4g 10% DV; fat 48.9g 75% DV; cholesterol 259.5mg 87% DV; sodium 1141.7mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/21220/mashed-sweet-potatoes/", "name": "Mashed Sweet Potatoes", "summary": "\nSimple mashed sweet potatoes flavored with maple syrup and butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4576638.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["additional:", "15 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  sweet potatoes, peeled and cubed", "¾ cup milk", "½ cup butter", "¾ cup maple syrup"], "direction": ["Bring a large pot of salted water to a boil. Add potatoes and cook until tender, 20 to 30 minutes.", "With an electric mixer on low, blend potatoes, slowly adding milk, about 1/2 a cup at a time. Use more or less to achieve desired texture. Add butter and maple syrup to taste. Blend until smooth. Serve warm."], "facts": "353 calories; protein 2.9g 6% DV; carbohydrates 50.9g 16% DV; fat 16.2g 25% DV; cholesterol 43.1mg 14% DV; sodium 160.1mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9487/pecan-pie/", "name": "Pecan Pie", "summary": "\nThis is a wonderfully rich, Southern pie recipe that is the best I've tried! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5819873.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 ¾ cups white sugar", "¼ cup dark corn syrup", "¼ cup butter", "1 tablespoon cold water", "2 teaspoons cornstarch", "3  eggs", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 ¼ cups chopped pecans", "1 (9 inch) unbaked pie shell"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium saucepan, combine the sugar, corn syrup, butter, water, and cornstarch. Bring to a full boil, and remove from heat.", "In a large bowl, beat eggs until frothy. Gradually beat in cooked syrup mixture. Stir in salt, vanilla, and pecans. Pour into pie shell.", "Bake in preheated oven for 45 to 50 minutes, or until filling is set."], "facts": "512 calories; protein 5.4g 11% DV; carbohydrates 65.1g 21% DV; fat 27.3g 42% DV; cholesterol 85mg 28% DV; sodium 272.7mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/221958/chef-johns-perfect-prime-rib/", "name": "Chef John's Perfect Prime Rib", "summary": "\nThis is a specific formula for achieving a perfectly pink prime rib cooked somewhere a shade under medium rare. To use this method you must have a full-sized, modern oven with a digital temperature setting that indicates when it is preheated. Older ovens with manual controls can vary greatly, and the doors may not have the proper insulation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4886145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs 20 mins"], ["additional:", "4 hrs"], ["total:", "6 hrs 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 pounds prime rib roast", "¼ cup unsalted butter, softened", "1 tablespoon freshly ground black pepper", "1 teaspoon herbes de Provence", "kosher salt"], "direction": ["Place rib roast on a plate and bring to room temperature, about 4 hours.", "Preheat an oven to 500 degrees F (260 degrees C).", "Combine butter, pepper, and herbes de Provence in a bowl; mix until well blended. Spread butter mixture evenly over entire roast. Season roast generously with kosher salt.", "Roast the 4-pound prime rib (see footnote if using a larger and smaller roast) in the preheated oven for 20 minutes. Turn the oven off and, leaving the roast in the oven with the door closed, let the roast sit in the oven for 2 hours. Remove roast from the oven, slice, and serve."], "facts": "1757 calories; protein 72.5g 145% DV; carbohydrates 1g; fat 160.6g 247% DV; cholesterol 361.6mg 121% DV; sodium 342.7mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/15820/puppy-chow/", "name": "Puppy Chow", "summary": "\nThis recipe can be used as an appetizer or dessert. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8096737.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "36"], ["Yield:", "2 to 3 dozen"]], "ingredients": ["9 cups crispy rice cereal squares", "½ cup peanut butter", "1 cup semi-sweet chocolate chips", "1 ½ cups confectioners' sugar"], "direction": ["In a saucepan over low heat, melt the chocolate; add peanut butter and mix until smooth.", "Remove from heat, add cereal and stir until coated.", "Pour powdered sugar into large plastic bag, add coated cereal and shake until well coated. Store in airtight container."], "facts": "90 calories; protein 1.7g 3% DV; carbohydrates 14.7g 5% DV; fat 3.2g 5% DV; cholesterol 0mg; sodium 69.9mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9111/cranberry-sauce/", "name": "Cranberry Sauce", "summary": "\nA Thanksgiving classic. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F743657.jpg", "meta": [["Servings:", "11"], ["Yield:", "8 - 12 servings"]], "ingredients": ["12 ounces cranberries", "1 cup white sugar", "1 cup orange juice"], "direction": ["In a medium sized saucepan over medium heat, dissolve the sugar in the orange juice. Stir in the cranberries and cook until the cranberries start to pop (about 10 minutes). Remove from heat and place sauce in a bowl. Cranberry sauce will thicken as it cools."], "facts": "95 calories; protein 0.3g 1% DV; carbohydrates 24.2g 8% DV; fat 0.1g; cholesterol 0mg; sodium 0.8mg."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/7322/favorite-old-fashioned-gingerbread/", "name": "Favorite Old Fashioned Gingerbread", "summary": "\nThis is everyone's holiday favorite, even the busy cook's, because it is so easy to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4558051.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "9"], ["Yield:", "1 9-inch square cake"]], "ingredients": ["½ cup white sugar", "½ cup butter", "1  egg", "1 cup molasses", "2 ½ cups all-purpose flour", "1 ½ teaspoons baking soda", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "½ teaspoon ground cloves", "½ teaspoon salt", "1 cup hot water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square pan.", "In a large bowl, cream together the sugar and butter. Beat in the egg, and mix in the molasses.", "In a bowl, sift together the flour, baking soda, salt, cinnamon, ginger, and cloves. Blend into the creamed mixture. Stir in the hot water. Pour into the prepared pan.", "Bake 1 hour in the preheated oven, until a knife inserted in the center comes out clean. Allow to cool in pan before serving."], "facts": "375 calories; protein 4.4g 9% DV; carbohydrates 65.3g 21% DV; fat 11.2g 17% DV; cholesterol 47.8mg 16% DV; sodium 434.7mg 17% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/240641/salt-dough/", "name": "Salt Dough", "summary": "\nThis recipe is much like Play-Doh®, but can be baked to a permanent finish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2974510.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["additional:", "1 hr"], ["total:", "3 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 cups"]], "ingredients": ["2 cups all-purpose flour", "1 cup salt", "1 cup cold water"], "direction": ["Mix flour and salt together in a bowl. Slowly mix water, a few tablespoons at a time, into flour mixture until dough is smooth and easy to handle. Knead dough for 10 minutes and let rest for 20 minutes.", "Preheat oven to 250 degrees F (120 degrees C).", "Form dough into desired shapes and arrange on a baking sheet.", "Bake in the preheated oven until dry and hard, about 2 hours. Allow to cool completely."], "facts": "228 calories; protein 6.5g 13% DV; carbohydrates 47.7g 16% DV; fat 0.6g 1% DV; cholesterol 0mg; sodium 23354.7mg 973% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/213073/slow-cooker-cocktail-smokies/", "name": "Slow Cooker Cocktail Smokies", "summary": "\nThese addictive little appetizers are so easy to make, and great for potlucks as well. This recipe could easily be changed up to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5950673.jpg", "meta": [["prep:", "5 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 5 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["2 (16 ounce) packages miniature smoked sausage links", "1 (8 ounce) jar grape jelly", "1 (12 ounce) bottle barbeque sauce"], "direction": ["Combine grape jelly and barbeque sauce in a slow cooker. Stir in the miniature smoked sausage links. Cook on High, until heated through, 2 to 3 hours."], "facts": "377 calories; protein 11.1g 22% DV; carbohydrates 28.3g 9% DV; fat 24.6g 38% DV; cholesterol 56.4mg 19% DV; sodium 1278.3mg 51% DV."}, {"type": "By Holidays and Events  ", "package": "christmas_recipes", "link": "https://www.allrecipes.com/recipe/180314/pumpkin-spice-martini/", "name": "Pumpkin Spice Martini", "summary": "\nA fun, delicious cocktail for your next holiday gathering. A good friend shared this great idea! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1054947.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 martini"]], "ingredients": ["1 (1.5 fluid ounce) jigger vanilla flavored vodka (such as Stoli®)", "1 (1.5 fluid ounce) jigger Irish cream liqueur (such as Bailey's®)", "1 (1.5 fluid ounce) jigger pumpkin flavored liqueur (such as Hiram Walker®)", "1 cup ice cubes", "1 pinch ground cinnamon", "1 pinch ground nutmeg"], "direction": ["Pour the vanilla flavored vodka, Irish cream liqueur, and pumpkin flavored liqueur into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass, and garnish with a sprinkle of ground cinnamon and ground nutmeg to serve."], "facts": "427 calories; protein 0.1g; carbohydrates 40.7g 14% DV; fat 0.6g 1% DV; cholesterol 0mg; sodium 13mg 1% DV."}]