[{"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/269467/cheesecake-with-cranberry-glaze-and-sugared-cranberries/", "name": "Cheesecake with Cranberry Glaze and Sugared Cranberries", "summary": "\nCranberries and orange are a natural pairing, and I wanted to combine them in a cheesecake fit for the Thanksgiving table. The cranberry glaze is a really beautiful color, and the sugared cranberries are the perfect topping. Most of the work is done the night before, so it's not even that hard to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6074192.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "8 hrs 30 mins"], ["total:", "9 hrs 50 mins"], ["Servings:", "10"], ["Yield:", "1 9-inch cheesecake"]], "ingredients": ["10  digestive biscuits (such as McVitie's®)", "5 tablespoons butter, melted", "2 tablespoons confectioners' sugar", "⅛ teaspoon salt", "2 (8 ounce) packages cream cheese, softened", "¾ cup white sugar", "3 large eggs", "¼ cup sour cream", "2 teaspoons vanilla extract", "1  orange, zested"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C). Grease the sides of a 9-inch springform pan. Line the bottom with a circle of parchment paper.", "Crush biscuits into crumbs using a food processor. Stir crumbs, butter, confectioners' sugar, and salt together to make the crust. Press into the bottom of the pan. Rinse food processor and set aside for the cranberry glaze.", "Bake crust in the preheated oven until firm, 8 to 10 minutes. Remove the crust from the oven and reduce the temperature to 325 degrees F (165 degrees C). Let crust cool while making the filling.", "Beat cream cheese and sugar together until smooth. Add eggs, sour cream, vanilla, and orange zest. Mix until well combined, stopping to scrape the sides and bottom of the bowl. Spoon batter over the crust.", "Bake until the filling is set but still soft in the center, 30 to 40 minutes. Cool cheesecake to room temperature, about 30 minutes.", "While the cheesecake is cooling, combine 1/3 cup sugar and water in a small saucepan. Bring to a simmer over medium-low heat and stir until sugar is dissolved. Pour into a bowl and cool for 10 minutes. Add cranberries and stir to coat with syrup.", "Refrigerate cheesecake and syrup-coated cranberries, 8 hours to overnight.", "Line a rimmed baking sheet with parchment paper. Place 1/4 cup granulated sugar in a shallow bowl. Drain the cranberries, then roll them in the sugar. Place the sugared cranberries on the prepared baking sheet and allow to dry, 30 minutes to 1 hour.", "In the meantime, make the glaze. Combine cranberries, water, and sugar in a small saucepan. Simmer, crushing cranberries, until jammy, about 8 minutes. Let cool slightly. Transfer to the food processor; add confectioners' sugar, orange juice, corn syrup, vanilla, and salt. Process until smooth.", "Strain cranberry glaze through a fine-mesh sieve and discard solids. Pour over the cheesecake and smooth across the top with a small offset spatula. Garnish with sugared cranberries."], "facts": "448 calories; protein 6.3g 13% DV; carbohydrates 48.2g 16% DV; fat 26.3g 41% DV; cholesterol 122.9mg 41% DV; sodium 368.9mg 15% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/25030/caramel-bars/", "name": "Caramel Bars", "summary": "\nYummy oat bars filled with a gooey layer of caramel, chocolate and nuts! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18081.jpg", "meta": [["prep:", "20 mins"], ["cook:", "12 mins"], ["additional:", "3 mins"], ["total:", "35 mins"], ["Servings:", "24"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["32  individually wrapped caramels, unwrapped", "5 tablespoons heavy cream", "1 cup all-purpose flour", "1 cup rolled oats", "¾ cup brown sugar", "½ teaspoon baking soda", "¼ teaspoon salt", "¾ cup butter, melted", "½ cup semisweet chocolate chips", "½ cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). In a medium saucepan over low heat, melt together the caramels and heavy cream, stirring occasionally until smooth.", "In a medium bowl, stir together the flour, oats, brown sugar, baking soda and salt. Stir in the melted butter until well blended. Press Half of the mixture into the bottom of a 9x13 inch baking pan. Reserve the rest.", "Bake the crust for 8 minutes in the preheated oven. Remove and sprinkle with chocolate chips and walnuts. Pour the caramel mixture over the top and then crumble the remaining crust mixture over everything.", "Return to the oven and bake for an additional 12 minutes, or until the top is lightly toasted. Cut into squares while it is still warm."], "facts": "195 calories; protein 2.2g 5% DV; carbohydrates 23.7g 8% DV; fat 10.9g 17% DV; cholesterol 20.5mg 7% DV; sodium 127.5mg 5% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/246265/almond-milk-chocolate-pudding/", "name": "Almond Milk Chocolate Pudding", "summary": "\nThis is a super easy pudding that can be adapted as needed to be both vegetarian or vegan. It is low-fat and a responsible snack for those watching their diet but seeking a sweet chocolate dessert. A very versatile pudding recipe that is easy to modify.  Can be eaten warm, if preferred. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3292643.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup white sugar, or to taste", "½ cup unsweetened cocoa powder", "⅓ cup cornstarch", "¼ teaspoon salt", "3 cups unsweetened almond milk", "1 teaspoon butter", "1 teaspoon vanilla extract"], "direction": ["Mix sugar, cocoa powder, cornstarch, and salt together in a saucepan; whisk in 1/4 cup almond milk until foamy and smooth. Continue adding almond milk, 1/4 cup at a time, to cocoa mixture until mixture is smooth and foamy each time. Place saucepan over medium-high heat and cook, stirring constantly, until mixture comes to a simmer and starts to thicken, about 5 minutes.", "Remove saucepan from heat and stir in butter until melted and smooth. Add vanilla extract and mix well. Pour pudding into serving bowl and refrigerate until chilled, at least 30 minutes."], "facts": "213 calories; protein 2g 4% DV; carbohydrates 48.1g 16% DV; fat 3g 5% DV; cholesterol 1.8mg 1% DV; sodium 183.8mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/277220/russian-honey-cake/", "name": "Russian Honey Cake", "summary": "\nThere are 3 different ways to make this cake…the hard way, the harder way, and the way we're gonna do it--the hardest way. Because it's that worth it. The tiny amount of bitterness we get from the burnt honey really is the secret here, and the slightly tangy whipped cream frosting provides a bit of acidity and lovely light texture; and unlike other frostings, it's not too sweet. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7287365.jpg", "meta": [["prep:", "45 mins"], ["cook:", "45 mins"], ["additional:", "8 hrs 25 mins"], ["total:", "9 hrs 55 mins"], ["Servings:", "12"], ["Yield:", "1 9-inch cake"]], "ingredients": ["¾ cup wildflower honey", "3 tablespoons cold water"], "direction": ["Pour honey into a deep saucepan over medium heat. Boil until a shade darker and caramel-like in aroma, about 10 minutes. Turn off heat and whisk in cold water.", "Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with a silicone mat (such as Silpat®). Place a mixing bowl and a whisk in the refrigerator.", "Place a large metal bowl over the lowest heat setting on the stovetop. Add butter, sugar, 1/4 cup of the burnt honey, and regular wildflower honey. Let sit until butter melts, 5 to 7 minutes.", "Meanwhile, combine baking soda, salt, and cinnamon in a small bowl.", "Whisk butter mixture and let sit until very warm to the touch. Whisk in eggs. Keep mixture over low heat until it gets very warm again; whisk in baking soda mixture. Remove from heat. Sift in flour in 2 or 3 additions, stirring well after each, until batter is easily spreadable.", "Transfer about 1/2 cup batter onto the prepared baking sheet. Spread into an 8- or 9-inch circle using an offset spatula. Shake and tap the pan to knock out any air bubbles.", "Bake in the preheated oven until lightly browned, 6 to 7 minutes. Remove liner from the pan and let cake layer continue cooling until firm enough to remove, 6 to 7 minutes. Invert cake onto a round of parchment paper.", "Repeat until you have a total of 8 cake layers, letting each cool on an individual parchment round. Trim edges using a pizza wheel to ensure they are the same size; save scraps for crumb mixture.", "Spread remaining batter onto the lined baking sheet. Bake in the preheated oven until edges are dry, about 10 minutes. Remove from the oven and cut into small pieces; toss with reserved cake scraps.", "Return to the oven and continue to bake until browned, 7 to 10 minutes more. Let cool completely, 15 to 20 minutes. Transfer to a resealable bag and beat into fairly fine crumbs using a rolling pin. Set aside.", "Remove the bowl and whisk from the refrigerator. Pour in heavy cream. Whisk until soft peaks form. Add remaining burnt honey and sour cream; continue whisking until stiff peaks form.", "Place a cake layer on a parchment paper round on top of a pizza pan or serving plate. Spread a cup of frosting evenly on top, almost to the edge. Repeat with cake layers and frosting, pressing the layers in smooth-side down. Place last cake layer smooth-side up. Frost the top and sides of the cake. Cover with crumbs; clean any excess crumbs around base.", "Cover with plastic wrap and refrigerate at least 8 hours, to overnight. Transfer to a cake stand using 2 spatulas. Cut and serve."], "facts": "795 calories; protein 9.5g 19% DV; carbohydrates 84.6g 27% DV; fat 48.7g 75% DV; cholesterol 243.6mg 81% DV; sodium 484.7mg 19% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9584/triple-the-ginger-cookies/", "name": "Triple the Ginger Cookies", "summary": "\nThese are a real pain in the butt to make, but they are worth it. The best ginger cookies I have ever eaten. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2743790.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["additional:", "1 hr 55 mins"], ["total:", "2 hrs 30 mins"], ["Servings:", "18"], ["Yield:", "3 dozen"]], "ingredients": ["¾ cup butter", "1 cup packed brown sugar", "1  egg", "¼ cup molasses", "2 ¼ cups all-purpose flour", "2 teaspoons ground ginger", "2 teaspoons baking soda", "½ teaspoon salt", "1 ½ tablespoons minced fresh ginger root", "½ cup chopped crystallized ginger"], "direction": ["In a large bowl, cream together the butter and brown sugar until smooth. Beat in the egg and molasses. Combine the flour, ground ginger, baking soda, and salt; stir into the molasses mixture using a wooden spoon. Mix in the fresh and crystallized gingers. Cover, and refrigerate dough for at least 2 hours, or overnight.", "Preheat oven to 350 degrees F (175 degrees C). Shape dough into 1 inch balls, and place about 2 inches apart onto ungreased cookie sheet.", "Bake for 10 minutes in the preheated oven, or until lightly browned. Cool on wire racks."], "facts": "198 calories; protein 2.1g 4% DV; carbohydrates 29.7g 10% DV; fat 8.1g 13% DV; cholesterol 30.7mg 10% DV; sodium 269.8mg 11% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/262724/authentic-italian-rice-pudding/", "name": "Authentic Italian Rice Pudding", "summary": "\nLet Cooking Italian with Joe show you how to make my grandmother's authentic Italian world's best rice pudding! Truly smooth and silky texture that fills your taste buds with yum.\n Garnish with chopped nuts, cinnamon, and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1827006.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6 cups whole milk", "¾ cup Arborio rice", "¾ cup white sugar, divided", "1 teaspoon vanilla extract", "¼ teaspoon salt", "2  eggs", "2  egg yolks", "1 cup heavy whipping cream"], "direction": ["Mix milk, rice, 1/2 of the sugar, vanilla extract, and salt together in a saucepan over medium-high heat. Bring to a boil.", "Blend remaining sugar with whole eggs and yolks in a bowl to make a creamy custard.", "Reduce heat of the milk mixture. Let simmer, uncovered, until thickened, 30 to 40 minutes. Fold in the custard. Heat until thickened again, about 5 minutes more.", "Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form.", "Remove the milk and custard mixture from heat. Let cool, about 10 minutes. Fold in the whipped cream. Pour pudding into a serving dish, cover, and refrigerate until chilled, at least 2 hours."], "facts": "394 calories; protein 10.2g 20% DV; carbohydrates 45.3g 15% DV; fat 19.3g 30% DV; cholesterol 156.8mg 52% DV; sodium 176.7mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17981/one-bowl-chocolate-cake-iii/", "name": "One Bowl Chocolate Cake III", "summary": "\nThis is a rich and moist chocolate cake. It only takes a few minutes to prepare the batter. Frost with your favorite chocolate frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F708879.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 - 9 inch round cake layers"]], "ingredients": ["2 cups white sugar", "1 ¾ cups all-purpose flour", "¾ cup unsweetened cocoa powder", "1 ½ teaspoons baking powder", "1 ½ teaspoons baking soda", "1 teaspoon salt", "2  eggs", "1 cup milk", "½ cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans.", "In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans.", "Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely."], "facts": "157 calories; protein 2.3g 5% DV; carbohydrates 25.7g 8% DV; fat 5.7g 9% DV; cholesterol 16.3mg 5% DV; sodium 217.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/239483/pumpkin-pie-bread-pudding/", "name": "Pumpkin Pie Bread Pudding", "summary": "\nCombination of 2 classic recipes: bread pudding and pumpkin pie. I put this together on a whim and loved it. Taste is more comforting than sweet. Great served warm or cold and can be complemented with whipped cream or milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2777912.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 10 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 loaf French bread, cut into cubes", "½ cup raisins, or more to taste", "1 teaspoon maple-flavored extract", "1 teaspoon rum-flavored extract", "¼ cup water, or as needed", "3 cups milk", "1 (15 ounce) can pumpkin puree", "1 (14 ounce) can sweetened condensed milk (such as Eagle Brand®)", "3  large eggs", "⅓ cup brown sugar", "⅓ cup butter, melted", "2 tablespoons molasses", "2 teaspoons vanilla extract", "2 teaspoons pumpkin pie spice", "2 teaspoons ground cinnamon", "1 teaspoon ground allspice", "½ teaspoon ground ginger"], "direction": ["Grease a 9x13-inch baking dish.", "Spread bread cubes into the prepared baking dish.", "Mix raisins, maple-flavored extract, and rum-flavored extract together in a bowl; pour in enough water to almost cover raisins. Heat raisin mixture in microwave until raisins are plump, about 1 1/2 minutes; set aside to cool slightly.", "Beat milk, pumpkin puree, sweetened condensed milk, eggs, raisin mixture, brown sugar, butter, molasses, vanilla extract, pumpkin pie spice, cinnamon, allspice, and ginger together in a large bowl until smooth; pour over bread. Set mixture aside until bread has absorbed the liquid, about 1 hour.", "Preheat oven to 350 degrees F (175 degrees C).", "Bake in the preheated oven until a knife inserted in the center comes out clean, 45 to 50 minutes."], "facts": "380 calories; protein 11.3g 23% DV; carbohydrates 59.7g 19% DV; fat 11.3g 17% DV; cholesterol 76mg 25% DV; sodium 456.1mg 18% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/232005/cranberry-sour-cream-kuchen/", "name": "Cranberry Sour Cream Kuchen", "summary": "\nThis is a holiday breakfast favorite in our home. It is equally delicious served warm or cold, and it also freezes well, so you can make it ahead. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4570136.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "12"], ["Yield:", "1 10-inch cake"]], "ingredients": ["½ cup butter", "1 cup white sugar", "1 teaspoon vanilla extract", "3  eggs", "2 cups all-purpose flour", "2 teaspoons baking powder", "½ teaspoon baking soda", "½ teaspoon salt", "1 ¼ cups sour cream", "2 cups chopped fresh cranberries", "¼ cup white sugar", "¼ cup brown sugar", "2 tablespoons all-purpose flour", "2 tablespoons chopped almonds", "1 tablespoon butter", "½ teaspoon ground cinnamon"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch springform pan.", "Beat 1/2 cup butter, 1 cup white sugar, and vanilla extract in a large bowl using an electric mixer until creamy and smooth. Add eggs, 1 at a time, beating in the first egg thoroughly before adding the second. Whisk 2 cups flour, baking powder, baking soda, and salt together in a separate bowl; beat flour mixture into creamed butter mixture in several increments, alternating with sour cream, to make a batter.", "Spread half the batter in the prepared pan. Combine cranberries with 1/4 cup white sugar in a bowl and spread the cranberries over batter; top with remaining batter. Stir brown sugar, 2 tablespoons flour, almonds, 1 tablespoon butter, and cinnamon together in a bowl until the topping looks like crumbs. Sprinkle topping evenly over cake.", "Bake in the preheated oven until the cake is lightly browned and a toothpick inserted into the center comes out clean or with moist crumbs, 50 to 55 minutes."], "facts": "340 calories; protein 5g 10% DV; carbohydrates 46.1g 15% DV; fat 15.6g 24% DV; cholesterol 79.9mg 27% DV; sodium 324.2mg 13% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12383/cranberry-apple-pie-ii/", "name": "Cranberry Apple Pie II", "summary": "\nGreat dessert for Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1080413.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["6  apples", "1 (16 ounce) can whole cranberry sauce", "½ cup packed brown sugar", "⅓ cup all-purpose flour", "1 ½ teaspoons ground cinnamon", "½ teaspoon ground nutmeg", "1 recipe pastry for a 9 inch double crust pie"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Line a pie plate with pastry.", "Peel, core, and slice the apples.", "Combine apples and cranberry sauce in a medium-sized mixing bowl.  Combine brown sugar, flour, cinnamon, and nutmeg; add  to the apple mixture.  Mix thoroughly.  Turn filling into the pastry lined pan.  Cover with top crust.  Crimp edges.  Cut slits in top crust.", "Bake for 1 hour, or until the crust is golden brown and the filling bubbly."], "facts": "435 calories; protein 3.6g 7% DV; carbohydrates 73.5g 24% DV; fat 15.2g 23% DV; cholesterol 0mg; sodium 250.8mg 10% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/174347/quick-and-almost-professional-buttercream-icing/", "name": "Quick and Almost-Professional Buttercream Icing", "summary": "\nAfter failing to find the perfect recipe for buttercream icing, I found one that worked for me and then added my own two cents. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F572806.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["½ cup unsalted butter, softened", "1 ½ teaspoons vanilla extract", "2 cups confectioners' sugar, sifted", "2 tablespoons milk", "3 drops food coloring, or as needed  (Optional)"], "direction": ["Cream room temperature butter with a hand mixer, the paddle attachment of a stand mixer, or a wooden spoon until smooth and fluffy. Gradually beat in confectioners' sugar until fully incorporated. Beat in vanilla extract.", "Pour in milk and beat for an additional 3 to 4 minutes. Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached."], "facts": "228 calories; protein 0.2g 1% DV; carbohydrates 31.5g 10% DV; fat 11.6g 18% DV; cholesterol 30.8mg 10% DV; sodium 83.7mg 3% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/", "name": "Homemade Fresh Pumpkin Pie", "summary": "\nThis recipe is made from fresh pumpkin, not canned. Hope you enjoy it as much as my family does.  Happy Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1071493.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 ⅓ cups all-purpose flour", "½ teaspoon salt", "½ cup shortening", "3 ½ tablespoons cold water"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Prepare pie crust by mixing together the flour and salt. Cut shortening into flour; add cold water 1 tablespoon at a time (you may need only 3 tablespoons, or up to 4 tablespoons). Mix dough and repeat until dough is moist enough to hold together.", "With lightly floured, hands shape dough into a ball. On a lightly floured board roll dough out to about 1/8 inch thickness. With a sharp knife, cut dough 1 1/2 inch larger than the upside-down 8- to 9-inch pie pan. Gently roll the dough around the rolling pin and transfer it right-side up onto the pie pan. Unroll, easing dough into the bottom of the pie pan.", "In a large bowl, beat pumpkin with evaporated milk, eggs, brown sugar, cinnamon, ginger, nutmeg and salt with an electric mixer or immersion blender. Mix well. Pour into a prepared crust. Bake 40 minutes or until when a knife is inserted 1 inch from the edge comes out clean."], "facts": "363 calories; protein 7.4g 15% DV; carbohydrates 44.3g 14% DV; fat 18g 28% DV; cholesterol 60.2mg 20% DV; sodium 365.3mg 15% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10275/classic-peanut-butter-cookies/", "name": "Classic Peanut Butter Cookies", "summary": "\nMakes great cookies! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1078651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup unsalted butter", "1 cup crunchy peanut butter", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 ½ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "1 ½ teaspoons baking soda"], "direction": ["Cream butter, peanut butter, and sugars together in a bowl; beat in eggs.", "In a separate bowl, sift flour, baking powder, baking soda, and salt; stir into butter mixture. Put dough in refrigerator for 1 hour.", "Roll dough into 1 inch balls and put on baking sheets. Flatten each ball with a fork, making a crisscross pattern. Bake in a preheated 375 degrees F oven for about 10 minutes or until cookies begin to brown."], "facts": "252 calories; protein 4.5g 9% DV; carbohydrates 29.7g 10% DV; fat 13.6g 21% DV; cholesterol 35.8mg 12% DV; sodium 209.4mg 8% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/241038/microwave-chocolate-mug-cake/", "name": "Microwave Chocolate Mug Cake", "summary": "\nThis is my own version of the chocolate microwave mug cake. This chocolaty fudgy treat is truly decadent and great for nights when I need a yummy dessert that is ready in less than 10 minutes! Chocolate chips make this recipe even better. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4541090.jpg", "meta": [["prep:", "5 mins"], ["cook:", "2 mins"], ["total:", "7 mins"], ["Servings:", "1"], ["Yield:", "1 cake"]], "ingredients": ["¼ cup all-purpose flour", "¼ cup white sugar", "2 tablespoons unsweetened cocoa powder", "⅛ teaspoon baking soda", "⅛ teaspoon salt", "3 tablespoons milk", "2 tablespoons canola oil", "1 tablespoon water", "¼ teaspoon vanilla extract"], "direction": ["Mix flour, sugar, cocoa powder, baking soda, and salt in a large microwave-safe mug; stir in milk, canola oil, water, and vanilla extract.", "Cook in microwave until cake is done in the middle, about 1 minute 45 seconds."], "facts": "603 calories; protein 6.9g 14% DV; carbohydrates 82g 26% DV; fat 30.4g 47% DV; cholesterol 3.7mg 1% DV; sodium 470.2mg 19% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0ebabff6-3872-4b38-ad70-898e0c409522%2F7df60bf0-b98a-4f9a-9936-8bf1a6a4b885%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "name": "Best Chocolate Chip Cookies", "summary": "\nCrisp edges, chewy middles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F903056c9-3215-407c-920a-d8eb13c1500e%2Fd73859ee-a517-4956-b9a6-970a9cde1e4f%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "½ teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.", "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."], "facts": "298 calories; protein 3.6g 7% DV; carbohydrates 38.9g 13% DV; fat 15.6g 24% DV; cholesterol 35.8mg 12% DV; sodium 165.8mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F92613e3b-5dc0-4beb-a92e-ef11b46d0c37%2F798d87b1-055c-4394-aa01-a67a2d8c63d0%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10549/best-brownies/", "name": "Best Brownies", "summary": "\nThese brownies always turn out! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1f376888-d624-403a-abdf-35491dab7075%2Ffa38d776-07ea-4f87-936d-6a251fe2006a%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["½ cup butter", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "⅓ cup unsweetened cocoa powder", "½ cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking powder"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.", "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.", "Bake in preheated oven for 25 to 30 minutes. Do not overcook.", "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."], "facts": "183 calories; protein 1.8g 4% DV; carbohydrates 25.7g 8% DV; fat 9g 14% DV; cholesterol 44.2mg 15% DV; sodium 109.7mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "name": "Apple Pie by Grandma Ople", "summary": "\nThis was my grandmother's apple pie recipe.  I have never seen another one quite like it.  It will always be my favorite and has won me several first place prizes in local competitions.  I hope it becomes one of your favorites as well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F736203.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "½ cup unsalted butter", "3 tablespoons all-purpose flour", "¼ cup water", "½ cup white sugar", "½ cup packed brown sugar", "8  Granny Smith apples - peeled, cored and sliced"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.", "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.", "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."], "facts": "512 calories; protein 3.6g 7% DV; carbohydrates 67.8g 22% DV; fat 26.7g 41% DV; cholesterol 30.5mg 10% DV; sodium 240.8mg 10% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/", "name": "Apple Crisp II", "summary": "\nA simple dessert that's great served with ice cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277929.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["10 cups all-purpose apples, peeled, cored and sliced", "1 cup white sugar", "1 tablespoon all-purpose flour", "1 teaspoon ground cinnamon", "½ cup water", "1 cup quick-cooking oats", "1 cup all-purpose flour", "1 cup packed brown sugar", "¼ teaspoon baking powder", "¼ teaspoon baking soda", "½ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degree C).", "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.", "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.", "Bake at 350 degrees F (175 degrees C) for about 45 minutes."], "facts": "316 calories; protein 2.4g 5% DV; carbohydrates 60.5g 20% DV; fat 8.4g 13% DV; cholesterol 20.3mg 7% DV; sodium 97.9mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/229088/apple-crisp-with-oat-topping/", "name": "Apple Crisp with Oat Topping", "summary": "\nThis is the best dessert for the early fall when the sweet and firm apples are just in season. Use the best quality cinnamon you can get and get it from a spice merchant or even a store where you can get it bulk; it does make a difference. Within ten minutes of going in the oven the scent will fill the house and neighbors you loaned things to years ago will return them just to invite themselves in and wonder aloud if there is any left (Note: there isn't). Optional accompaniments would be caramel sauce, ice cream, and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2604006.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["6  apples - peeled, cored, and sliced", "2 tablespoons white sugar", "½ teaspoon ground cinnamon", "1 cup brown sugar", "¾ cup old-fashioned oats", "¾ cup all-purpose flour", "1 teaspoon ground cinnamon", "½ cup cold butter"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Toss apples with white sugar and 1/2 teaspoon cinnamon in a medium bowl to coat; pour into a 9-inch square baking dish.", "Mix brown sugar, oats, flour, and 1 teaspoon cinnamon in a separate bowl. Use a pastry cutter or 2 forks to mash cold butter into the oats mixture until the mixture resembles coarse crumbs; spread over the apples to the edges of the baking dish. Pat the topping gently until even.", "Bake in preheated oven until golden brown and sides are bubbling, about 40 minutes."], "facts": "618 calories; protein 5.3g 11% DV; carbohydrates 99.3g 32% DV; fat 24.6g 38% DV; cholesterol 61mg 20% DV; sodium 177.1mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/19247/soft-oatmeal-cookies/", "name": "Soft Oatmeal Cookies", "summary": "\nThese oatmeal cookies are very moist with a good flavor. Add a cup of raisins or nuts if you desire. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3779973.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 35 mins"], ["total:", "2 hrs"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 ½ teaspoons ground cinnamon", "3 cups quick cooking oats"], "direction": ["In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs one at a time, then stir in vanilla. Combine flour, baking soda, salt, and cinnamon; stir into the creamed mixture. Mix in oats. Cover, and chill dough for at least one hour.", "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Roll the dough into walnut sized balls, and place 2 inches apart on cookie sheets. Flatten each cookie with a large fork dipped in sugar.", "Bake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "facts": "218 calories; protein 3g 6% DV; carbohydrates 32.3g 10% DV; fat 8.8g 14% DV; cholesterol 35.8mg 12% DV; sodium 213.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/8379/basic-cream-cheese-frosting/", "name": "Basic Cream Cheese Frosting", "summary": "\nThis recipe delivers a basic cream cheese frosting using just butter, cream cheese, confectioners' sugar, and vanilla. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5348159.jpg", "meta": [["Servings:", "12"], ["Yield:", "2 cups"]], "ingredients": ["½ cup butter, softened", "8 ounces cream cheese", "4 cups confectioners' sugar", "2 teaspoons vanilla extract"], "direction": ["Beat softened butter and cream cheese until well blended.", "Add powdered sugar and vanilla. Beat until creamy."], "facts": "292 calories; protein 1.5g 3% DV; carbohydrates 40.4g 13% DV; fat 14.3g 22% DV; cholesterol 41.1mg 14% DV; sodium 110.9mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/", "name": "Best Big, Fat, Chewy Chocolate Chip Cookie", "summary": "\nThese cookies are the pinnacle of perfection! If you want a big, fat, chewy cookie like the kind you see at bakeries and specialty shops, then these are the cookies for you! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107530.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "15 mins"], ["total:", "40 mins"], ["Servings:", "18"], ["Yield:", "1 1/2 dozen"]], "ingredients": ["2 cups all-purpose flour", "½ teaspoon baking soda", "½ teaspoon salt", "¾ cup unsalted butter, melted", "1 cup packed brown sugar", "½ cup white sugar", "1 tablespoon vanilla extract", "1  egg", "1  egg yolk", "2 cups semisweet chocolate chips"], "direction": ["Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.", "Sift together the flour, baking soda and salt; set aside.", "In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.", "Bake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely."], "facts": "285 calories; protein 2.8g 6% DV; carbohydrates 40.1g 13% DV; fat 13.9g 21% DV; cholesterol 42mg 14% DV; sodium 110.7mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17481/simple-white-cake/", "name": "Simple White Cake", "summary": "\nThis cake was sent home from our children's school. It is the simplest, great tasting cake I've ever made. Great to make with the kids, especially for cupcakes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1437162.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes or 1- 9x9 inch pan"]], "ingredients": ["1 cup white sugar", "½ cup butter", "2  eggs", "2 teaspoons vanilla extract", "1 ½ cups all-purpose flour", "1 ¾ teaspoons baking powder", "½ cup milk"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan or line a muffin pan with paper liners.", "In a medium bowl, cream together the sugar and butter. Beat in the eggs, one at a time, then stir in the vanilla. Combine flour and baking powder, add to the creamed mixture and mix well. Finally stir in the milk until batter is smooth. Pour or spoon batter into the prepared pan.", "Bake for 30 to 40 minutes in the preheated oven. For cupcakes, bake 20 to 25 minutes. Cake is done when it springs back to the touch."], "facts": "209 calories; protein 3.1g 6% DV; carbohydrates 29.4g 10% DV; fat 8.9g 14% DV; cholesterol 52.1mg 17% DV; sodium 141.8mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/7177/bread-pudding-ii/", "name": "Bread Pudding II", "summary": "\nMy family LOVES bread pudding, and this recipe is one that I have fine tuned to their taste. I have to double this recipe, and bake it in a 9x13 inch pan for my family!  It's great for breakfast or dessert and is delicious with milk poured on top! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5941077.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "12"], ["Yield:", "1 8-inch square pan"]], "ingredients": ["6 slices day-old bread", "2 tablespoons butter, melted", "½ cup raisins  (Optional)", "4  eggs, beaten", "2 cups milk", "¾ cup white sugar", "1 teaspoon ground cinnamon", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Break bread into small pieces into an 8 inch square baking pan. Drizzle melted butter or margarine over bread. If desired, sprinkle with raisins.", "In a medium mixing bowl, combine eggs, milk, sugar, cinnamon, and vanilla. Beat until well mixed. Pour over bread, and lightly push down with a fork until bread is covered and soaking up the egg mixture.", "Bake in the preheated oven for 45 minutes, or until the top springs back when lightly tapped."], "facts": "165 calories; protein 4.6g 9% DV; carbohydrates 26.5g 9% DV; fat 4.8g 7% DV; cholesterol 70.3mg 23% DV; sodium 139.6mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17981/one-bowl-chocolate-cake-iii/", "name": "One Bowl Chocolate Cake III", "summary": "\nThis is a rich and moist chocolate cake. It only takes a few minutes to prepare the batter. Frost with your favorite chocolate frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F708879.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 - 9 inch round cake layers"]], "ingredients": ["2 cups white sugar", "1 ¾ cups all-purpose flour", "¾ cup unsweetened cocoa powder", "1 ½ teaspoons baking powder", "1 ½ teaspoons baking soda", "1 teaspoon salt", "2  eggs", "1 cup milk", "½ cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans.", "In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans.", "Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely."], "facts": "157 calories; protein 2.3g 5% DV; carbohydrates 25.7g 8% DV; fat 5.7g 9% DV; cholesterol 16.3mg 5% DV; sodium 217.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/22749/the-best-banana-pudding/", "name": "The Best Banana Pudding", "summary": "\nThe best no bake banana pudding you will ever find (or so I've been told by many). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F771986.jpg", "meta": [["prep:", "25 mins"], ["total:", "25 mins"], ["Servings:", "20"], ["Yield:", "20 servings"]], "ingredients": ["1 (5 ounce) package instant vanilla pudding mix", "2 cups cold milk", "1 (14 ounce) can sweetened condensed milk", "1 tablespoon vanilla extract", "1 (12 ounce) container frozen whipped topping, thawed", "1 (16 ounce) package vanilla wafers", "14  bananas, sliced"], "direction": ["In a large mixing bowl, beat pudding mix and milk 2 minutes.  Blend in condensed milk until smooth.  Stir in vanilla and fold in whipped topping.  Layer wafers, bananas and pudding mixture in a glass serving bowl.  Chill until serving."], "facts": "329 calories; protein 4.2g 8% DV; carbohydrates 56.9g 18% DV; fat 9.6g 15% DV; cholesterol 8.6mg 3% DV; sodium 205.2mg 8% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12104/lemon-cloud-pie-i/", "name": "Lemon Cloud Pie I", "summary": "\nA light, refreshing, and easy to make pie.  It's one of my summer favorites. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8145385.jpg", "meta": [["prep:", "30 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (9 inch) pie crust, baked", "¾ cup white sugar", "3 tablespoons cornstarch", "1 cup water", "1 teaspoon lemon zest", "¼ cup lemon juice", "1 (3 ounce) package cream cheese", "2  eggs", "¼ cup white sugar"], "direction": ["Combine 3/4 cup sugar, cornstarch, water, lemon peel and juice, and egg yolks in a saucepan.  Beat well.  Stir while cooking over medium heat until thick; it will thicken just as it starts to simmer.", "Remove saucepan from heat.  Add cream cheese to lemon mixture, and stir until incorporated.", "In a small bowl, beat egg whites until stiff; add remaining 1/4 cup sugar.  Fold sweetened egg whites into lemon mixture.", "Spoon filling into shell and chill."], "facts": "246 calories; protein 3.1g 6% DV; carbohydrates 36.6g 12% DV; fat 10.1g 16% DV; cholesterol 58.2mg 19% DV; sodium 152.1mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/", "name": "Chewy Chocolate Chip Oatmeal Cookies", "summary": "\nI modified Beatrice's Excellent Oatmeal cookies very slightly. I came up with something that my boyfriend went CRAZY over! I've never seen him enjoy cookies to that extent! He said I blew his mother's recipe away. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F493502.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 mins"], ["additional:", "28 mins"], ["total:", "55 mins"], ["Servings:", "42"], ["Yield:", "3 1/2 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup packed light brown sugar", "½ cup white sugar", "2  eggs", "2 teaspoons vanilla extract", "1 ¼ cups all-purpose flour", "½ teaspoon baking soda", "1 teaspoon salt", "3 cups quick-cooking oats", "1 cup chopped walnuts", "1 cup semisweet chocolate chips"], "direction": ["Preheat the oven to 325 degrees F (165 degrees C).", "In a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in eggs one at a time, then stir in vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture until just blended. Mix in the quick oats, walnuts, and chocolate chips. Drop by heaping spoonfuls onto ungreased baking sheets.", "Bake for 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "facts": "145 calories; protein 2.1g 4% DV; carbohydrates 17.2g 6% DV; fat 8.1g 12% DV; cholesterol 20.5mg 7% DV; sodium 107.2mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/7399/tres-leches-milk-cake/", "name": "Tres Leches (Milk Cake)", "summary": "\nThis cake is made with three layers: Cake, filling, and topping.  There are 4 types of milk in the filling and topping (whole milk, condensed milk, evaporated milk, and heavy cream).  This is an excellent cake for milk lovers! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F384988.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 -9x13 inch cake"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "½ cup unsalted butter", "1 cup white sugar", "5  eggs", "½ teaspoon vanilla extract", "2 cups whole milk", "1 (14 ounce) can sweetened condensed milk", "1 (12 fluid ounce) can evaporated milk", "1 ½ cups heavy whipping cream", "1 cup white sugar", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan.", "Sift flour and baking powder together and set aside.", "Cream butter or margarine and the 1 cup sugar together until fluffy. Add eggs and the 1/2 teaspoon vanilla extract; beat well.", "Add the flour mixture to the butter mixture 2 tablespoons at a time; mix until well blended. Pour batter into prepared pan.", "Bake at 350 degrees F (175 degrees C) for 30 minutes. Pierce cake several times with a fork.", "Combine the whole milk, condensed milk, and evaporated milk together. Pour over the top of the cooled cake.", "Whip whipping cream, the remaining 1 cup of the sugar, and the remaining 1 teaspoon vanilla together until thick. Spread over the top of cake. Be sure and keep cake refrigerated, enjoy!"], "facts": "280 calories; protein 5.5g 11% DV; carbohydrates 34.6g 11% DV; fat 13.7g 21% DV; cholesterol 81.5mg 27% DV; sodium 86.8mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9599/quick-and-easy-brownies/", "name": "Quick and Easy Brownies", "summary": "\nTakes about 45 minutes to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3598901.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "20"], ["Yield:", "20 bars"]], "ingredients": ["1 cup butter, melted", "2 cups white sugar", "½ cup cocoa powder", "1 teaspoon vanilla extract", "4  eggs", "1 ½ cups all-purpose flour", "½ teaspoon baking powder", "½ teaspoon salt", "½ cup walnut halves"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan.", "Combine the melted butter, sugar, cocoa powder, vanilla, eggs, flour, baking powder, and salt. Spread the batter into the prepared pan. Decorate with walnut halves, if desired.", "Bake in preheated oven for 20 to 30 minutes or until a toothpick inserted in the center comes out with crumbs, not wet. Cool on wire rack."], "facts": "229 calories; protein 3.1g 6% DV; carbohydrates 28.8g 9% DV; fat 12.2g 19% DV; cholesterol 61.6mg 21% DV; sodium 150.4mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/11352/three-ingredient-peanut-butter-cookies/", "name": "Three Ingredient Peanut Butter Cookies", "summary": "\nThis recipe has just 3 ingredients. It's fast, easy and the cookies are wonderful! It's great for kids that are just learning to bake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F178805.jpg", "meta": [["Servings:", "6"], ["Yield:", "1 dozen"]], "ingredients": ["1 cup peanut butter", "1 cup white sugar", "1  egg"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.", "Combine the peanut butter, white sugar and egg. Mix until smooth.", "Drop spoonfuls of dough onto the prepared baking sheet. Bake at 350 degrees F (175 degrees C) for 6 to 8 minutes. Do not overbake! These cookies are best when they are still soft and just barely brown on the bottoms."], "facts": "394 calories; protein 11.8g 24% DV; carbohydrates 41.8g 14% DV; fat 22.5g 35% DV; cholesterol 31mg 10% DV; sodium 209mg 8% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/269467/cheesecake-with-cranberry-glaze-and-sugared-cranberries/", "name": "Cheesecake with Cranberry Glaze and Sugared Cranberries", "summary": "\nCranberries and orange are a natural pairing, and I wanted to combine them in a cheesecake fit for the Thanksgiving table. The cranberry glaze is a really beautiful color, and the sugared cranberries are the perfect topping. Most of the work is done the night before, so it's not even that hard to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6074192.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "8 hrs 30 mins"], ["total:", "9 hrs 50 mins"], ["Servings:", "10"], ["Yield:", "1 9-inch cheesecake"]], "ingredients": ["10  digestive biscuits (such as McVitie's®)", "5 tablespoons butter, melted", "2 tablespoons confectioners' sugar", "⅛ teaspoon salt", "2 (8 ounce) packages cream cheese, softened", "¾ cup white sugar", "3 large eggs", "¼ cup sour cream", "2 teaspoons vanilla extract", "1  orange, zested"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C). Grease the sides of a 9-inch springform pan. Line the bottom with a circle of parchment paper.", "Crush biscuits into crumbs using a food processor. Stir crumbs, butter, confectioners' sugar, and salt together to make the crust. Press into the bottom of the pan. Rinse food processor and set aside for the cranberry glaze.", "Bake crust in the preheated oven until firm, 8 to 10 minutes. Remove the crust from the oven and reduce the temperature to 325 degrees F (165 degrees C). Let crust cool while making the filling.", "Beat cream cheese and sugar together until smooth. Add eggs, sour cream, vanilla, and orange zest. Mix until well combined, stopping to scrape the sides and bottom of the bowl. Spoon batter over the crust.", "Bake until the filling is set but still soft in the center, 30 to 40 minutes. Cool cheesecake to room temperature, about 30 minutes.", "While the cheesecake is cooling, combine 1/3 cup sugar and water in a small saucepan. Bring to a simmer over medium-low heat and stir until sugar is dissolved. Pour into a bowl and cool for 10 minutes. Add cranberries and stir to coat with syrup.", "Refrigerate cheesecake and syrup-coated cranberries, 8 hours to overnight.", "Line a rimmed baking sheet with parchment paper. Place 1/4 cup granulated sugar in a shallow bowl. Drain the cranberries, then roll them in the sugar. Place the sugared cranberries on the prepared baking sheet and allow to dry, 30 minutes to 1 hour.", "In the meantime, make the glaze. Combine cranberries, water, and sugar in a small saucepan. Simmer, crushing cranberries, until jammy, about 8 minutes. Let cool slightly. Transfer to the food processor; add confectioners' sugar, orange juice, corn syrup, vanilla, and salt. Process until smooth.", "Strain cranberry glaze through a fine-mesh sieve and discard solids. Pour over the cheesecake and smooth across the top with a small offset spatula. Garnish with sugared cranberries."], "facts": "448 calories; protein 6.3g 13% DV; carbohydrates 48.2g 16% DV; fat 26.3g 41% DV; cholesterol 122.9mg 41% DV; sodium 368.9mg 15% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/25030/caramel-bars/", "name": "Caramel Bars", "summary": "\nYummy oat bars filled with a gooey layer of caramel, chocolate and nuts! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18081.jpg", "meta": [["prep:", "20 mins"], ["cook:", "12 mins"], ["additional:", "3 mins"], ["total:", "35 mins"], ["Servings:", "24"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["32  individually wrapped caramels, unwrapped", "5 tablespoons heavy cream", "1 cup all-purpose flour", "1 cup rolled oats", "¾ cup brown sugar", "½ teaspoon baking soda", "¼ teaspoon salt", "¾ cup butter, melted", "½ cup semisweet chocolate chips", "½ cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). In a medium saucepan over low heat, melt together the caramels and heavy cream, stirring occasionally until smooth.", "In a medium bowl, stir together the flour, oats, brown sugar, baking soda and salt. Stir in the melted butter until well blended. Press Half of the mixture into the bottom of a 9x13 inch baking pan. Reserve the rest.", "Bake the crust for 8 minutes in the preheated oven. Remove and sprinkle with chocolate chips and walnuts. Pour the caramel mixture over the top and then crumble the remaining crust mixture over everything.", "Return to the oven and bake for an additional 12 minutes, or until the top is lightly toasted. Cut into squares while it is still warm."], "facts": "195 calories; protein 2.2g 5% DV; carbohydrates 23.7g 8% DV; fat 10.9g 17% DV; cholesterol 20.5mg 7% DV; sodium 127.5mg 5% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/282203/cranberry-orange-bundt-cake/", "name": "Cranberry-Orange Bundt® Cake", "summary": "\nI bought the cutest little 4.5-cup capacity Bundt® pan to bake smaller cakes for just me and my husband. This recipe fit perfectly in it, and was just the right amount for us. Cranberries and orange peel are finely chopped and beat into the batter, so you get those flavors throughout the cake. Decorating with the sugared cranberries is optional, but makes for a beautiful presentation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8686171.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "20 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 tablespoon vegetable shortening, melted", "2 tablespoons cake flour", "1 medium orange", "½ cup fresh cranberries", "⅔ cup white sugar", "¼ cup butter, softened", "1 large egg", "¼ teaspoon almond extract", "1 ¼ cups cake flour", "½ teaspoon baking soda", "¼ teaspoon salt", "¼ cup buttermilk"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Using a pastry brush, thoroughly brush the insides and center tube of a 4.5-cup fluted tube pan (such as Bundt®) with the melted shortening. Sift 2 tablespoons cake flour over the greased pan, making sure that all surfaces are well coated. Shake out any excess flour over the sink. Set the pan aside.", "Using a sharp paring knife or vegetable peeler, remove the orange part of the orange peel, leaving behind the white bitter pitch. Place the strips of orange zest in the bowl of a food processor. Add cranberries and process until finely chopped. Set aside.", "Cream sugar and butter together in a bowl with an electric mixer until light and fluffy. Beat in egg and almond extract. Add 1 1/4 cups cake flour, baking soda, and salt and mix until just combined. Beat in buttermilk and chopped cranberries and orange zest. Spread batter evenly into the prepared pan.", "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 35 to 37 minutes. Cool for 20 minutes and invert onto a serving platter.", "While cake is cooling, combine cranberries, 3 tablespoons sugar, and water in a small glass bowl. Microwave on high for 1 minute to dissolve sugar and soften cranberries. Stir until all of the cranberries are coated with the sugary mixture. Remove the cranberries with a slotted spoon onto a waxed paper-lined baking sheet. Allow to dry for 30 minutes. Roll the cranberries in the remaining 2 tablespoons of sugar.", "Combine powdered sugar, orange juice, and orange zest in a small bowl. Drizzle glaze over the cooled cake and garnish with the sugared cranberries."], "facts": "614 calories; protein 6.7g 13% DV; carbohydrates 111.6g 36% DV; fat 16.6g 26% DV; cholesterol 77.6mg 26% DV; sodium 419.9mg 17% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/246265/almond-milk-chocolate-pudding/", "name": "Almond Milk Chocolate Pudding", "summary": "\nThis is a super easy pudding that can be adapted as needed to be both vegetarian or vegan. It is low-fat and a responsible snack for those watching their diet but seeking a sweet chocolate dessert. A very versatile pudding recipe that is easy to modify.  Can be eaten warm, if preferred. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3292643.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup white sugar, or to taste", "½ cup unsweetened cocoa powder", "⅓ cup cornstarch", "¼ teaspoon salt", "3 cups unsweetened almond milk", "1 teaspoon butter", "1 teaspoon vanilla extract"], "direction": ["Mix sugar, cocoa powder, cornstarch, and salt together in a saucepan; whisk in 1/4 cup almond milk until foamy and smooth. Continue adding almond milk, 1/4 cup at a time, to cocoa mixture until mixture is smooth and foamy each time. Place saucepan over medium-high heat and cook, stirring constantly, until mixture comes to a simmer and starts to thicken, about 5 minutes.", "Remove saucepan from heat and stir in butter until melted and smooth. Add vanilla extract and mix well. Pour pudding into serving bowl and refrigerate until chilled, at least 30 minutes."], "facts": "213 calories; protein 2g 4% DV; carbohydrates 48.1g 16% DV; fat 3g 5% DV; cholesterol 1.8mg 1% DV; sodium 183.8mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/277220/russian-honey-cake/", "name": "Russian Honey Cake", "summary": "\nThere are 3 different ways to make this cake…the hard way, the harder way, and the way we're gonna do it--the hardest way. Because it's that worth it. The tiny amount of bitterness we get from the burnt honey really is the secret here, and the slightly tangy whipped cream frosting provides a bit of acidity and lovely light texture; and unlike other frostings, it's not too sweet. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7287365.jpg", "meta": [["prep:", "45 mins"], ["cook:", "45 mins"], ["additional:", "8 hrs 25 mins"], ["total:", "9 hrs 55 mins"], ["Servings:", "12"], ["Yield:", "1 9-inch cake"]], "ingredients": ["¾ cup wildflower honey", "3 tablespoons cold water"], "direction": ["Pour honey into a deep saucepan over medium heat. Boil until a shade darker and caramel-like in aroma, about 10 minutes. Turn off heat and whisk in cold water.", "Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with a silicone mat (such as Silpat®). Place a mixing bowl and a whisk in the refrigerator.", "Place a large metal bowl over the lowest heat setting on the stovetop. Add butter, sugar, 1/4 cup of the burnt honey, and regular wildflower honey. Let sit until butter melts, 5 to 7 minutes.", "Meanwhile, combine baking soda, salt, and cinnamon in a small bowl.", "Whisk butter mixture and let sit until very warm to the touch. Whisk in eggs. Keep mixture over low heat until it gets very warm again; whisk in baking soda mixture. Remove from heat. Sift in flour in 2 or 3 additions, stirring well after each, until batter is easily spreadable.", "Transfer about 1/2 cup batter onto the prepared baking sheet. Spread into an 8- or 9-inch circle using an offset spatula. Shake and tap the pan to knock out any air bubbles.", "Bake in the preheated oven until lightly browned, 6 to 7 minutes. Remove liner from the pan and let cake layer continue cooling until firm enough to remove, 6 to 7 minutes. Invert cake onto a round of parchment paper.", "Repeat until you have a total of 8 cake layers, letting each cool on an individual parchment round. Trim edges using a pizza wheel to ensure they are the same size; save scraps for crumb mixture.", "Spread remaining batter onto the lined baking sheet. Bake in the preheated oven until edges are dry, about 10 minutes. Remove from the oven and cut into small pieces; toss with reserved cake scraps.", "Return to the oven and continue to bake until browned, 7 to 10 minutes more. Let cool completely, 15 to 20 minutes. Transfer to a resealable bag and beat into fairly fine crumbs using a rolling pin. Set aside.", "Remove the bowl and whisk from the refrigerator. Pour in heavy cream. Whisk until soft peaks form. Add remaining burnt honey and sour cream; continue whisking until stiff peaks form.", "Place a cake layer on a parchment paper round on top of a pizza pan or serving plate. Spread a cup of frosting evenly on top, almost to the edge. Repeat with cake layers and frosting, pressing the layers in smooth-side down. Place last cake layer smooth-side up. Frost the top and sides of the cake. Cover with crumbs; clean any excess crumbs around base.", "Cover with plastic wrap and refrigerate at least 8 hours, to overnight. Transfer to a cake stand using 2 spatulas. Cut and serve."], "facts": "795 calories; protein 9.5g 19% DV; carbohydrates 84.6g 27% DV; fat 48.7g 75% DV; cholesterol 243.6mg 81% DV; sodium 484.7mg 19% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/282211/pumpkin-spice-latte-coffee-cake/", "name": "Pumpkin Spice Latte Coffee Cake", "summary": "\nTry the beloved fall latte in cake form! The flavor of coffee and pumpkin spice is in every layer--from the crisp streusel topping, to the pumpkin cake itself, and then the surprise little bit of filling in the center. I highly recommend making this cake the day before you need it---the flavors get a chance to meld and are so incredible the next day. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8680962.jpg", "meta": [["prep:", "30 mins"], ["cook:", "55 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch cake"]], "ingredients": ["1 cup all-purpose flour", "1 cup firmly packed dark brown sugar", "2 tablespoons instant espresso powder", "1 tablespoon unsweetened cocoa powder", "1 teaspoon pumpkin pie spice", "1 teaspoon vanilla extract", "1 pinch salt", "½ cup unsalted butter, cut into cubes"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan.", "Prepare streusel topping by combining flour, dark brown sugar, espresso powder, cocoa powder, pumpkin pie spice, vanilla extract, and salt in a large bowl. Cut in butter until mixture resembles coarse crumbs. Set aside.", "Prepare the cake batter by whisking flour, espresso powder, pumpkin pie spice, baking powder, baking soda, and salt together until thoroughly combined. Set aside.", "Cream butter and white sugar together in a large bowl with an electric mixer until light and fluffy. Mix in eggs one at a time, beating well after each addition. Mix in pumpkin puree and vanilla. Stir in 1/3 of the dry ingredients, mixing until just combined. Mix in 1/2 of the cooled coffee and 1/2 of the heavy cream, stirring until just combined. Continue alternating dry ingredients with the coffee and heavy cream, beginning and ending with dry ingredients, mixing until just combined.", "Pour 1/2 of the cake batter into the prepared pan and spread into an even layer. Measure out 1 cup of the streusel mixture and sprinkle evenly over the batter. Carefully pour the remaining batter over the filling, and gently spread to completely cover. Sprinkle the remaining streusel mixture evenly over the top of the cake.", "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out with just a few moist crumbs, 55 to 60 minutes. Allow cake to cool completely before serving."], "facts": "477 calories; protein 5.9g 12% DV; carbohydrates 67.8g 22% DV; fat 20.8g 32% DV; cholesterol 100.8mg 34% DV; sodium 334.6mg 13% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9584/triple-the-ginger-cookies/", "name": "Triple the Ginger Cookies", "summary": "\nThese are a real pain in the butt to make, but they are worth it. The best ginger cookies I have ever eaten. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2743790.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["additional:", "1 hr 55 mins"], ["total:", "2 hrs 30 mins"], ["Servings:", "18"], ["Yield:", "3 dozen"]], "ingredients": ["¾ cup butter", "1 cup packed brown sugar", "1  egg", "¼ cup molasses", "2 ¼ cups all-purpose flour", "2 teaspoons ground ginger", "2 teaspoons baking soda", "½ teaspoon salt", "1 ½ tablespoons minced fresh ginger root", "½ cup chopped crystallized ginger"], "direction": ["In a large bowl, cream together the butter and brown sugar until smooth. Beat in the egg and molasses. Combine the flour, ground ginger, baking soda, and salt; stir into the molasses mixture using a wooden spoon. Mix in the fresh and crystallized gingers. Cover, and refrigerate dough for at least 2 hours, or overnight.", "Preheat oven to 350 degrees F (175 degrees C). Shape dough into 1 inch balls, and place about 2 inches apart onto ungreased cookie sheet.", "Bake for 10 minutes in the preheated oven, or until lightly browned. Cool on wire racks."], "facts": "198 calories; protein 2.1g 4% DV; carbohydrates 29.7g 10% DV; fat 8.1g 13% DV; cholesterol 30.7mg 10% DV; sodium 269.8mg 11% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/262724/authentic-italian-rice-pudding/", "name": "Authentic Italian Rice Pudding", "summary": "\nLet Cooking Italian with Joe show you how to make my grandmother's authentic Italian world's best rice pudding! Truly smooth and silky texture that fills your taste buds with yum.\n Garnish with chopped nuts, cinnamon, and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1827006.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "2 hrs 10 mins"], ["total:", "3 hrs"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6 cups whole milk", "¾ cup Arborio rice", "¾ cup white sugar, divided", "1 teaspoon vanilla extract", "¼ teaspoon salt", "2  eggs", "2  egg yolks", "1 cup heavy whipping cream"], "direction": ["Mix milk, rice, 1/2 of the sugar, vanilla extract, and salt together in a saucepan over medium-high heat. Bring to a boil.", "Blend remaining sugar with whole eggs and yolks in a bowl to make a creamy custard.", "Reduce heat of the milk mixture. Let simmer, uncovered, until thickened, 30 to 40 minutes. Fold in the custard. Heat until thickened again, about 5 minutes more.", "Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form.", "Remove the milk and custard mixture from heat. Let cool, about 10 minutes. Fold in the whipped cream. Pour pudding into a serving dish, cover, and refrigerate until chilled, at least 2 hours."], "facts": "394 calories; protein 10.2g 20% DV; carbohydrates 45.3g 15% DV; fat 19.3g 30% DV; cholesterol 156.8mg 52% DV; sodium 176.7mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17981/one-bowl-chocolate-cake-iii/", "name": "One Bowl Chocolate Cake III", "summary": "\nThis is a rich and moist chocolate cake. It only takes a few minutes to prepare the batter. Frost with your favorite chocolate frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F708879.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 - 9 inch round cake layers"]], "ingredients": ["2 cups white sugar", "1 ¾ cups all-purpose flour", "¾ cup unsweetened cocoa powder", "1 ½ teaspoons baking powder", "1 ½ teaspoons baking soda", "1 teaspoon salt", "2  eggs", "1 cup milk", "½ cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans.", "In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans.", "Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely."], "facts": "157 calories; protein 2.3g 5% DV; carbohydrates 25.7g 8% DV; fat 5.7g 9% DV; cholesterol 16.3mg 5% DV; sodium 217.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/239483/pumpkin-pie-bread-pudding/", "name": "Pumpkin Pie Bread Pudding", "summary": "\nCombination of 2 classic recipes: bread pudding and pumpkin pie. I put this together on a whim and loved it. Taste is more comforting than sweet. Great served warm or cold and can be complemented with whipped cream or milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2777912.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 10 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 loaf French bread, cut into cubes", "½ cup raisins, or more to taste", "1 teaspoon maple-flavored extract", "1 teaspoon rum-flavored extract", "¼ cup water, or as needed", "3 cups milk", "1 (15 ounce) can pumpkin puree", "1 (14 ounce) can sweetened condensed milk (such as Eagle Brand®)", "3  large eggs", "⅓ cup brown sugar", "⅓ cup butter, melted", "2 tablespoons molasses", "2 teaspoons vanilla extract", "2 teaspoons pumpkin pie spice", "2 teaspoons ground cinnamon", "1 teaspoon ground allspice", "½ teaspoon ground ginger"], "direction": ["Grease a 9x13-inch baking dish.", "Spread bread cubes into the prepared baking dish.", "Mix raisins, maple-flavored extract, and rum-flavored extract together in a bowl; pour in enough water to almost cover raisins. Heat raisin mixture in microwave until raisins are plump, about 1 1/2 minutes; set aside to cool slightly.", "Beat milk, pumpkin puree, sweetened condensed milk, eggs, raisin mixture, brown sugar, butter, molasses, vanilla extract, pumpkin pie spice, cinnamon, allspice, and ginger together in a large bowl until smooth; pour over bread. Set mixture aside until bread has absorbed the liquid, about 1 hour.", "Preheat oven to 350 degrees F (175 degrees C).", "Bake in the preheated oven until a knife inserted in the center comes out clean, 45 to 50 minutes."], "facts": "380 calories; protein 11.3g 23% DV; carbohydrates 59.7g 19% DV; fat 11.3g 17% DV; cholesterol 76mg 25% DV; sodium 456.1mg 18% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/232005/cranberry-sour-cream-kuchen/", "name": "Cranberry Sour Cream Kuchen", "summary": "\nThis is a holiday breakfast favorite in our home. It is equally delicious served warm or cold, and it also freezes well, so you can make it ahead. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4570136.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "12"], ["Yield:", "1 10-inch cake"]], "ingredients": ["½ cup butter", "1 cup white sugar", "1 teaspoon vanilla extract", "3  eggs", "2 cups all-purpose flour", "2 teaspoons baking powder", "½ teaspoon baking soda", "½ teaspoon salt", "1 ¼ cups sour cream", "2 cups chopped fresh cranberries", "¼ cup white sugar", "¼ cup brown sugar", "2 tablespoons all-purpose flour", "2 tablespoons chopped almonds", "1 tablespoon butter", "½ teaspoon ground cinnamon"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch springform pan.", "Beat 1/2 cup butter, 1 cup white sugar, and vanilla extract in a large bowl using an electric mixer until creamy and smooth. Add eggs, 1 at a time, beating in the first egg thoroughly before adding the second. Whisk 2 cups flour, baking powder, baking soda, and salt together in a separate bowl; beat flour mixture into creamed butter mixture in several increments, alternating with sour cream, to make a batter.", "Spread half the batter in the prepared pan. Combine cranberries with 1/4 cup white sugar in a bowl and spread the cranberries over batter; top with remaining batter. Stir brown sugar, 2 tablespoons flour, almonds, 1 tablespoon butter, and cinnamon together in a bowl until the topping looks like crumbs. Sprinkle topping evenly over cake.", "Bake in the preheated oven until the cake is lightly browned and a toothpick inserted into the center comes out clean or with moist crumbs, 50 to 55 minutes."], "facts": "340 calories; protein 5g 10% DV; carbohydrates 46.1g 15% DV; fat 15.6g 24% DV; cholesterol 79.9mg 27% DV; sodium 324.2mg 13% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12383/cranberry-apple-pie-ii/", "name": "Cranberry Apple Pie II", "summary": "\nGreat dessert for Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1080413.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["6  apples", "1 (16 ounce) can whole cranberry sauce", "½ cup packed brown sugar", "⅓ cup all-purpose flour", "1 ½ teaspoons ground cinnamon", "½ teaspoon ground nutmeg", "1 recipe pastry for a 9 inch double crust pie"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Line a pie plate with pastry.", "Peel, core, and slice the apples.", "Combine apples and cranberry sauce in a medium-sized mixing bowl.  Combine brown sugar, flour, cinnamon, and nutmeg; add  to the apple mixture.  Mix thoroughly.  Turn filling into the pastry lined pan.  Cover with top crust.  Crimp edges.  Cut slits in top crust.", "Bake for 1 hour, or until the crust is golden brown and the filling bubbly."], "facts": "435 calories; protein 3.6g 7% DV; carbohydrates 73.5g 24% DV; fat 15.2g 23% DV; cholesterol 0mg; sodium 250.8mg 10% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/174347/quick-and-almost-professional-buttercream-icing/", "name": "Quick and Almost-Professional Buttercream Icing", "summary": "\nAfter failing to find the perfect recipe for buttercream icing, I found one that worked for me and then added my own two cents. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F572806.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["½ cup unsalted butter, softened", "1 ½ teaspoons vanilla extract", "2 cups confectioners' sugar, sifted", "2 tablespoons milk", "3 drops food coloring, or as needed  (Optional)"], "direction": ["Cream room temperature butter with a hand mixer, the paddle attachment of a stand mixer, or a wooden spoon until smooth and fluffy. Gradually beat in confectioners' sugar until fully incorporated. Beat in vanilla extract.", "Pour in milk and beat for an additional 3 to 4 minutes. Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached."], "facts": "228 calories; protein 0.2g 1% DV; carbohydrates 31.5g 10% DV; fat 11.6g 18% DV; cholesterol 30.8mg 10% DV; sodium 83.7mg 3% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/", "name": "Homemade Fresh Pumpkin Pie", "summary": "\nThis recipe is made from fresh pumpkin, not canned. Hope you enjoy it as much as my family does.  Happy Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1071493.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 ⅓ cups all-purpose flour", "½ teaspoon salt", "½ cup shortening", "3 ½ tablespoons cold water"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Prepare pie crust by mixing together the flour and salt. Cut shortening into flour; add cold water 1 tablespoon at a time (you may need only 3 tablespoons, or up to 4 tablespoons). Mix dough and repeat until dough is moist enough to hold together.", "With lightly floured, hands shape dough into a ball. On a lightly floured board roll dough out to about 1/8 inch thickness. With a sharp knife, cut dough 1 1/2 inch larger than the upside-down 8- to 9-inch pie pan. Gently roll the dough around the rolling pin and transfer it right-side up onto the pie pan. Unroll, easing dough into the bottom of the pie pan.", "In a large bowl, beat pumpkin with evaporated milk, eggs, brown sugar, cinnamon, ginger, nutmeg and salt with an electric mixer or immersion blender. Mix well. Pour into a prepared crust. Bake 40 minutes or until when a knife is inserted 1 inch from the edge comes out clean."], "facts": "363 calories; protein 7.4g 15% DV; carbohydrates 44.3g 14% DV; fat 18g 28% DV; cholesterol 60.2mg 20% DV; sodium 365.3mg 15% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10275/classic-peanut-butter-cookies/", "name": "Classic Peanut Butter Cookies", "summary": "\nMakes great cookies! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1078651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup unsalted butter", "1 cup crunchy peanut butter", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 ½ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "1 ½ teaspoons baking soda"], "direction": ["Cream butter, peanut butter, and sugars together in a bowl; beat in eggs.", "In a separate bowl, sift flour, baking powder, baking soda, and salt; stir into butter mixture. Put dough in refrigerator for 1 hour.", "Roll dough into 1 inch balls and put on baking sheets. Flatten each ball with a fork, making a crisscross pattern. Bake in a preheated 375 degrees F oven for about 10 minutes or until cookies begin to brown."], "facts": "252 calories; protein 4.5g 9% DV; carbohydrates 29.7g 10% DV; fat 13.6g 21% DV; cholesterol 35.8mg 12% DV; sodium 209.4mg 8% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/241038/microwave-chocolate-mug-cake/", "name": "Microwave Chocolate Mug Cake", "summary": "\nThis is my own version of the chocolate microwave mug cake. This chocolaty fudgy treat is truly decadent and great for nights when I need a yummy dessert that is ready in less than 10 minutes! Chocolate chips make this recipe even better. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4541090.jpg", "meta": [["prep:", "5 mins"], ["cook:", "2 mins"], ["total:", "7 mins"], ["Servings:", "1"], ["Yield:", "1 cake"]], "ingredients": ["¼ cup all-purpose flour", "¼ cup white sugar", "2 tablespoons unsweetened cocoa powder", "⅛ teaspoon baking soda", "⅛ teaspoon salt", "3 tablespoons milk", "2 tablespoons canola oil", "1 tablespoon water", "¼ teaspoon vanilla extract"], "direction": ["Mix flour, sugar, cocoa powder, baking soda, and salt in a large microwave-safe mug; stir in milk, canola oil, water, and vanilla extract.", "Cook in microwave until cake is done in the middle, about 1 minute 45 seconds."], "facts": "603 calories; protein 6.9g 14% DV; carbohydrates 82g 26% DV; fat 30.4g 47% DV; cholesterol 3.7mg 1% DV; sodium 470.2mg 19% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0ebabff6-3872-4b38-ad70-898e0c409522%2F7df60bf0-b98a-4f9a-9936-8bf1a6a4b885%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "name": "Best Chocolate Chip Cookies", "summary": "\nCrisp edges, chewy middles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F903056c9-3215-407c-920a-d8eb13c1500e%2Fd73859ee-a517-4956-b9a6-970a9cde1e4f%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "½ teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.", "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."], "facts": "298 calories; protein 3.6g 7% DV; carbohydrates 38.9g 13% DV; fat 15.6g 24% DV; cholesterol 35.8mg 12% DV; sodium 165.8mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F92613e3b-5dc0-4beb-a92e-ef11b46d0c37%2F798d87b1-055c-4394-aa01-a67a2d8c63d0%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/10549/best-brownies/", "name": "Best Brownies", "summary": "\nThese brownies always turn out! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1f376888-d624-403a-abdf-35491dab7075%2Ffa38d776-07ea-4f87-936d-6a251fe2006a%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["½ cup butter", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "⅓ cup unsweetened cocoa powder", "½ cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking powder"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.", "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.", "Bake in preheated oven for 25 to 30 minutes. Do not overcook.", "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."], "facts": "183 calories; protein 1.8g 4% DV; carbohydrates 25.7g 8% DV; fat 9g 14% DV; cholesterol 44.2mg 15% DV; sodium 109.7mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "name": "Apple Pie by Grandma Ople", "summary": "\nThis was my grandmother's apple pie recipe.  I have never seen another one quite like it.  It will always be my favorite and has won me several first place prizes in local competitions.  I hope it becomes one of your favorites as well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F736203.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "½ cup unsalted butter", "3 tablespoons all-purpose flour", "¼ cup water", "½ cup white sugar", "½ cup packed brown sugar", "8  Granny Smith apples - peeled, cored and sliced"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.", "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.", "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."], "facts": "512 calories; protein 3.6g 7% DV; carbohydrates 67.8g 22% DV; fat 26.7g 41% DV; cholesterol 30.5mg 10% DV; sodium 240.8mg 10% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/", "name": "Apple Crisp II", "summary": "\nA simple dessert that's great served with ice cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277929.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["10 cups all-purpose apples, peeled, cored and sliced", "1 cup white sugar", "1 tablespoon all-purpose flour", "1 teaspoon ground cinnamon", "½ cup water", "1 cup quick-cooking oats", "1 cup all-purpose flour", "1 cup packed brown sugar", "¼ teaspoon baking powder", "¼ teaspoon baking soda", "½ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degree C).", "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.", "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.", "Bake at 350 degrees F (175 degrees C) for about 45 minutes."], "facts": "316 calories; protein 2.4g 5% DV; carbohydrates 60.5g 20% DV; fat 8.4g 13% DV; cholesterol 20.3mg 7% DV; sodium 97.9mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/229088/apple-crisp-with-oat-topping/", "name": "Apple Crisp with Oat Topping", "summary": "\nThis is the best dessert for the early fall when the sweet and firm apples are just in season. Use the best quality cinnamon you can get and get it from a spice merchant or even a store where you can get it bulk; it does make a difference. Within ten minutes of going in the oven the scent will fill the house and neighbors you loaned things to years ago will return them just to invite themselves in and wonder aloud if there is any left (Note: there isn't). Optional accompaniments would be caramel sauce, ice cream, and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2604006.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["6  apples - peeled, cored, and sliced", "2 tablespoons white sugar", "½ teaspoon ground cinnamon", "1 cup brown sugar", "¾ cup old-fashioned oats", "¾ cup all-purpose flour", "1 teaspoon ground cinnamon", "½ cup cold butter"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Toss apples with white sugar and 1/2 teaspoon cinnamon in a medium bowl to coat; pour into a 9-inch square baking dish.", "Mix brown sugar, oats, flour, and 1 teaspoon cinnamon in a separate bowl. Use a pastry cutter or 2 forks to mash cold butter into the oats mixture until the mixture resembles coarse crumbs; spread over the apples to the edges of the baking dish. Pat the topping gently until even.", "Bake in preheated oven until golden brown and sides are bubbling, about 40 minutes."], "facts": "618 calories; protein 5.3g 11% DV; carbohydrates 99.3g 32% DV; fat 24.6g 38% DV; cholesterol 61mg 20% DV; sodium 177.1mg 7% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/19247/soft-oatmeal-cookies/", "name": "Soft Oatmeal Cookies", "summary": "\nThese oatmeal cookies are very moist with a good flavor. Add a cup of raisins or nuts if you desire. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3779973.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 35 mins"], ["total:", "2 hrs"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 ½ teaspoons ground cinnamon", "3 cups quick cooking oats"], "direction": ["In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs one at a time, then stir in vanilla. Combine flour, baking soda, salt, and cinnamon; stir into the creamed mixture. Mix in oats. Cover, and chill dough for at least one hour.", "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Roll the dough into walnut sized balls, and place 2 inches apart on cookie sheets. Flatten each cookie with a large fork dipped in sugar.", "Bake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "facts": "218 calories; protein 3g 6% DV; carbohydrates 32.3g 10% DV; fat 8.8g 14% DV; cholesterol 35.8mg 12% DV; sodium 213.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/8379/basic-cream-cheese-frosting/", "name": "Basic Cream Cheese Frosting", "summary": "\nThis recipe delivers a basic cream cheese frosting using just butter, cream cheese, confectioners' sugar, and vanilla. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5348159.jpg", "meta": [["Servings:", "12"], ["Yield:", "2 cups"]], "ingredients": ["½ cup butter, softened", "8 ounces cream cheese", "4 cups confectioners' sugar", "2 teaspoons vanilla extract"], "direction": ["Beat softened butter and cream cheese until well blended.", "Add powdered sugar and vanilla. Beat until creamy."], "facts": "292 calories; protein 1.5g 3% DV; carbohydrates 40.4g 13% DV; fat 14.3g 22% DV; cholesterol 41.1mg 14% DV; sodium 110.9mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/", "name": "Best Big, Fat, Chewy Chocolate Chip Cookie", "summary": "\nThese cookies are the pinnacle of perfection! If you want a big, fat, chewy cookie like the kind you see at bakeries and specialty shops, then these are the cookies for you! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107530.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "15 mins"], ["total:", "40 mins"], ["Servings:", "18"], ["Yield:", "1 1/2 dozen"]], "ingredients": ["2 cups all-purpose flour", "½ teaspoon baking soda", "½ teaspoon salt", "¾ cup unsalted butter, melted", "1 cup packed brown sugar", "½ cup white sugar", "1 tablespoon vanilla extract", "1  egg", "1  egg yolk", "2 cups semisweet chocolate chips"], "direction": ["Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.", "Sift together the flour, baking soda and salt; set aside.", "In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.", "Bake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely."], "facts": "285 calories; protein 2.8g 6% DV; carbohydrates 40.1g 13% DV; fat 13.9g 21% DV; cholesterol 42mg 14% DV; sodium 110.7mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17481/simple-white-cake/", "name": "Simple White Cake", "summary": "\nThis cake was sent home from our children's school. It is the simplest, great tasting cake I've ever made. Great to make with the kids, especially for cupcakes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1437162.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes or 1- 9x9 inch pan"]], "ingredients": ["1 cup white sugar", "½ cup butter", "2  eggs", "2 teaspoons vanilla extract", "1 ½ cups all-purpose flour", "1 ¾ teaspoons baking powder", "½ cup milk"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan or line a muffin pan with paper liners.", "In a medium bowl, cream together the sugar and butter. Beat in the eggs, one at a time, then stir in the vanilla. Combine flour and baking powder, add to the creamed mixture and mix well. Finally stir in the milk until batter is smooth. Pour or spoon batter into the prepared pan.", "Bake for 30 to 40 minutes in the preheated oven. For cupcakes, bake 20 to 25 minutes. Cake is done when it springs back to the touch."], "facts": "209 calories; protein 3.1g 6% DV; carbohydrates 29.4g 10% DV; fat 8.9g 14% DV; cholesterol 52.1mg 17% DV; sodium 141.8mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/7177/bread-pudding-ii/", "name": "Bread Pudding II", "summary": "\nMy family LOVES bread pudding, and this recipe is one that I have fine tuned to their taste. I have to double this recipe, and bake it in a 9x13 inch pan for my family!  It's great for breakfast or dessert and is delicious with milk poured on top! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5941077.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "12"], ["Yield:", "1 8-inch square pan"]], "ingredients": ["6 slices day-old bread", "2 tablespoons butter, melted", "½ cup raisins  (Optional)", "4  eggs, beaten", "2 cups milk", "¾ cup white sugar", "1 teaspoon ground cinnamon", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Break bread into small pieces into an 8 inch square baking pan. Drizzle melted butter or margarine over bread. If desired, sprinkle with raisins.", "In a medium mixing bowl, combine eggs, milk, sugar, cinnamon, and vanilla. Beat until well mixed. Pour over bread, and lightly push down with a fork until bread is covered and soaking up the egg mixture.", "Bake in the preheated oven for 45 minutes, or until the top springs back when lightly tapped."], "facts": "165 calories; protein 4.6g 9% DV; carbohydrates 26.5g 9% DV; fat 4.8g 7% DV; cholesterol 70.3mg 23% DV; sodium 139.6mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/17981/one-bowl-chocolate-cake-iii/", "name": "One Bowl Chocolate Cake III", "summary": "\nThis is a rich and moist chocolate cake. It only takes a few minutes to prepare the batter. Frost with your favorite chocolate frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F708879.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "2 - 9 inch round cake layers"]], "ingredients": ["2 cups white sugar", "1 ¾ cups all-purpose flour", "¾ cup unsweetened cocoa powder", "1 ½ teaspoons baking powder", "1 ½ teaspoons baking soda", "1 teaspoon salt", "2  eggs", "1 cup milk", "½ cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans.", "In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans.", "Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely."], "facts": "157 calories; protein 2.3g 5% DV; carbohydrates 25.7g 8% DV; fat 5.7g 9% DV; cholesterol 16.3mg 5% DV; sodium 217.1mg 9% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/22749/the-best-banana-pudding/", "name": "The Best Banana Pudding", "summary": "\nThe best no bake banana pudding you will ever find (or so I've been told by many). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F771986.jpg", "meta": [["prep:", "25 mins"], ["total:", "25 mins"], ["Servings:", "20"], ["Yield:", "20 servings"]], "ingredients": ["1 (5 ounce) package instant vanilla pudding mix", "2 cups cold milk", "1 (14 ounce) can sweetened condensed milk", "1 tablespoon vanilla extract", "1 (12 ounce) container frozen whipped topping, thawed", "1 (16 ounce) package vanilla wafers", "14  bananas, sliced"], "direction": ["In a large mixing bowl, beat pudding mix and milk 2 minutes.  Blend in condensed milk until smooth.  Stir in vanilla and fold in whipped topping.  Layer wafers, bananas and pudding mixture in a glass serving bowl.  Chill until serving."], "facts": "329 calories; protein 4.2g 8% DV; carbohydrates 56.9g 18% DV; fat 9.6g 15% DV; cholesterol 8.6mg 3% DV; sodium 205.2mg 8% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/12104/lemon-cloud-pie-i/", "name": "Lemon Cloud Pie I", "summary": "\nA light, refreshing, and easy to make pie.  It's one of my summer favorites. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8145385.jpg", "meta": [["prep:", "30 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (9 inch) pie crust, baked", "¾ cup white sugar", "3 tablespoons cornstarch", "1 cup water", "1 teaspoon lemon zest", "¼ cup lemon juice", "1 (3 ounce) package cream cheese", "2  eggs", "¼ cup white sugar"], "direction": ["Combine 3/4 cup sugar, cornstarch, water, lemon peel and juice, and egg yolks in a saucepan.  Beat well.  Stir while cooking over medium heat until thick; it will thicken just as it starts to simmer.", "Remove saucepan from heat.  Add cream cheese to lemon mixture, and stir until incorporated.", "In a small bowl, beat egg whites until stiff; add remaining 1/4 cup sugar.  Fold sweetened egg whites into lemon mixture.", "Spoon filling into shell and chill."], "facts": "246 calories; protein 3.1g 6% DV; carbohydrates 36.6g 12% DV; fat 10.1g 16% DV; cholesterol 58.2mg 19% DV; sodium 152.1mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/", "name": "Chewy Chocolate Chip Oatmeal Cookies", "summary": "\nI modified Beatrice's Excellent Oatmeal cookies very slightly. I came up with something that my boyfriend went CRAZY over! I've never seen him enjoy cookies to that extent! He said I blew his mother's recipe away. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F493502.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 mins"], ["additional:", "28 mins"], ["total:", "55 mins"], ["Servings:", "42"], ["Yield:", "3 1/2 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup packed light brown sugar", "½ cup white sugar", "2  eggs", "2 teaspoons vanilla extract", "1 ¼ cups all-purpose flour", "½ teaspoon baking soda", "1 teaspoon salt", "3 cups quick-cooking oats", "1 cup chopped walnuts", "1 cup semisweet chocolate chips"], "direction": ["Preheat the oven to 325 degrees F (165 degrees C).", "In a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in eggs one at a time, then stir in vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture until just blended. Mix in the quick oats, walnuts, and chocolate chips. Drop by heaping spoonfuls onto ungreased baking sheets.", "Bake for 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "facts": "145 calories; protein 2.1g 4% DV; carbohydrates 17.2g 6% DV; fat 8.1g 12% DV; cholesterol 20.5mg 7% DV; sodium 107.2mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/7399/tres-leches-milk-cake/", "name": "Tres Leches (Milk Cake)", "summary": "\nThis cake is made with three layers: Cake, filling, and topping.  There are 4 types of milk in the filling and topping (whole milk, condensed milk, evaporated milk, and heavy cream).  This is an excellent cake for milk lovers! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F384988.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 -9x13 inch cake"]], "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking powder", "½ cup unsalted butter", "1 cup white sugar", "5  eggs", "½ teaspoon vanilla extract", "2 cups whole milk", "1 (14 ounce) can sweetened condensed milk", "1 (12 fluid ounce) can evaporated milk", "1 ½ cups heavy whipping cream", "1 cup white sugar", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan.", "Sift flour and baking powder together and set aside.", "Cream butter or margarine and the 1 cup sugar together until fluffy. Add eggs and the 1/2 teaspoon vanilla extract; beat well.", "Add the flour mixture to the butter mixture 2 tablespoons at a time; mix until well blended. Pour batter into prepared pan.", "Bake at 350 degrees F (175 degrees C) for 30 minutes. Pierce cake several times with a fork.", "Combine the whole milk, condensed milk, and evaporated milk together. Pour over the top of the cooled cake.", "Whip whipping cream, the remaining 1 cup of the sugar, and the remaining 1 teaspoon vanilla together until thick. Spread over the top of cake. Be sure and keep cake refrigerated, enjoy!"], "facts": "280 calories; protein 5.5g 11% DV; carbohydrates 34.6g 11% DV; fat 13.7g 21% DV; cholesterol 81.5mg 27% DV; sodium 86.8mg 4% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/9599/quick-and-easy-brownies/", "name": "Quick and Easy Brownies", "summary": "\nTakes about 45 minutes to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3598901.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "20"], ["Yield:", "20 bars"]], "ingredients": ["1 cup butter, melted", "2 cups white sugar", "½ cup cocoa powder", "1 teaspoon vanilla extract", "4  eggs", "1 ½ cups all-purpose flour", "½ teaspoon baking powder", "½ teaspoon salt", "½ cup walnut halves"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan.", "Combine the melted butter, sugar, cocoa powder, vanilla, eggs, flour, baking powder, and salt. Spread the batter into the prepared pan. Decorate with walnut halves, if desired.", "Bake in preheated oven for 20 to 30 minutes or until a toothpick inserted in the center comes out with crumbs, not wet. Cool on wire rack."], "facts": "229 calories; protein 3.1g 6% DV; carbohydrates 28.8g 9% DV; fat 12.2g 19% DV; cholesterol 61.6mg 21% DV; sodium 150.4mg 6% DV."}, {"type": "By Meal ", "package": "dessert_recipes", "link": "https://www.allrecipes.com/recipe/11352/three-ingredient-peanut-butter-cookies/", "name": "Three Ingredient Peanut Butter Cookies", "summary": "\nThis recipe has just 3 ingredients. It's fast, easy and the cookies are wonderful! It's great for kids that are just learning to bake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F178805.jpg", "meta": [["Servings:", "6"], ["Yield:", "1 dozen"]], "ingredients": ["1 cup peanut butter", "1 cup white sugar", "1  egg"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.", "Combine the peanut butter, white sugar and egg. Mix until smooth.", "Drop spoonfuls of dough onto the prepared baking sheet. Bake at 350 degrees F (175 degrees C) for 6 to 8 minutes. Do not overbake! These cookies are best when they are still soft and just barely brown on the bottoms."], "facts": "394 calories; protein 11.8g 24% DV; carbohydrates 41.8g 14% DV; fat 22.5g 35% DV; cholesterol 31mg 10% DV; sodium 209mg 8% DV."}]