[{"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/217178/pull-apart-easter-blossom-bread/", "name": "Pull-Apart Easter Blossom Bread", "summary": "\nA rich eggy dough is twisted into pretty flowers, then filled with jam in this decadent Easter bread. Be sure to look at the pictures for how it is formed. Lemon curd is an option to replace the jam. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F629896.jpg", "meta": [["prep:", "45 mins"], ["cook:", "25 mins"], ["additional:", "2 hrs 40 mins"], ["total:", "3 hrs 50 mins"], ["Servings:", "20"], ["Yield:", "2 10-serving loaves"]], "ingredients": ["6 cups all-purpose flour, or more if needed (divided)", "1 tablespoon rapid rise yeast", "½ cup white sugar", "¼ teaspoon salt", "½ cup unsalted butter", "1 ¾ cups milk", "3  eggs, beaten", "1  lemon, zested and juiced", "1  egg yolk", "1 tablespoon water", "½ cup seedless raspberry jam", "1 cup confectioners' sugar"], "direction": ["In a large bowl, whisk together 4 cups of flour, the yeast, white sugar, and salt. In a saucepan over low heat, melt the unsalted butter with the milk until the mixture is warm, about 110 degrees F (43 degrees C). Gradually whisk about 1/3 of the butter-milk mixture into the beaten eggs, then return the egg mixture back into the remaining milk mixture. Stir the lemon zest into the liquid ingredients (set aside lemon juice for later). Pour the liquid ingredients into the flour mixture, and stir until thoroughly combined.", "Add enough flour to make a soft dough; turn the dough out onto a floured surface, and knead until smooth and elastic, 8 to 10 minutes. Place dough into an oiled bowl, and turn the dough around to cover surface lightly with oil. Cover the bowl with plastic wrap, and allow to rise in a warm place until doubled, about 1 hour. Punch down the dough, and allow to rest for 10 minutes.", "Divide the dough in half, and roll each half into a round ball. On a floured surface, roll out a ball into a 12-inch circle. Place a drinking glass, face down, into the center of the circle to prevent cutting the dough too far into the center. Cut the dough with a knife, from the edge of the dough circle to the rim of the glass, into quarters. Cut each quarter into 5 narrow wedge-shaped strips. (Center of the dough is uncut.) Remove the drinking glass. There are 20 narrow wedge-shaped strips surrounding the uncut center of the dough.", "Pick up two adjacent strips, and twist them together about 4 times; pinch the ends of the two pieces together at the top. Gently coil to form a rough flower shape. Arrange the round into the middle of the circle, where the drinking glass was.", "Pick up two more adjacent strips, and twist and pinch them as before; coil them into a rough round, and arrange the new petal next to the center rosette. Repeat with remaining 16 strips, twisting and pinching them in twos, coiling and arranging them into 8 more petals around the center rosette. Finished bread has 9 petals surrounding the center round. Repeat steps with the second ball of dough to make two breads.", "Grease a baking sheet, or line with parchment paper. Place the shaped breads onto the prepared baking sheet, reshaping them into rounds if needed; cover with a clean kitchen towel, and place into a warm spot to rise until almost doubled, 30 to 45 minutes.", "Preheat oven to 375 degrees F (190 degrees C). Beat the egg yolk with water in a small bowl, and brush the mixture over both the breads.", "Bake in the preheated oven until the breads have turned golden brown, about 25 minutes. Allow to cool.", "Use your fingers to gently deepen the indentations in the center of each petal, and fill each with about 1/2 to 1 teaspoon of raspberry jam. Mix the reserved lemon juice and confectioners' sugar in a bowl to form a glaze; drizzle the glaze in thin lines all over both the breads. Allow glaze to set. To serve, pull the petals apart."], "facts": "269 calories; protein 6g 12% DV; carbohydrates 47.3g 15% DV; fat 6.4g 10% DV; cholesterol 52.1mg 17% DV; sodium 50.6mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/222589/simple-deviled-eggs/", "name": "Simple Deviled Eggs", "summary": "\nThe eggs are delicious, and it's easy to make more for larger gatherings. I've added onion and celery for a little more flavor and texture. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999534.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["6  hard-cooked eggs", "2 tablespoons mayonnaise", "1 teaspoon white sugar", "1 teaspoon white vinegar", "1 teaspoon prepared mustard", "½ teaspoon salt", "1 tablespoon finely chopped onion", "1 tablespoon finely chopped celery", "1 pinch paprika, or to taste"], "direction": ["Slice eggs in half lengthwise and remove yolks; set whites aside. Mash yolks with a fork in a small bowl. Stir in mayonnaise, sugar, vinegar, mustard, salt, onion, and celery; mix well. Stuff or pipe egg yolk mixture into egg whites. Sprinkle with paprika. Refrigerate until serving."], "facts": "328 calories; protein 19.3g 39% DV; carbohydrates 4.7g 2% DV; fat 26g 40% DV; cholesterol 563.2mg 188% DV; sodium 902.3mg 36% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/240752/chef-johns-honey-glazed-ham/", "name": "Chef John's Honey-Glazed Ham", "summary": "\nA great holiday ham glaze needs to have three things: wonderful flavor, gorgeous, shiny appearance, and a crispy, crackling crust you can hear across the room. I'm happy to report this easy-to-make glaze has all those things in abundance. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4253848.jpg", "meta": [["prep:", "15 mins"], ["cook:", "2 hrs 35 mins"], ["total:", "2 hrs 50 mins"], ["Servings:", "16"], ["Yield:", "1 glazed ham"]], "ingredients": ["¾ cup water, or as needed", "2  whole star anise", "12  whole cloves, or more to taste", "1 (7 pound) country-style ham", "1 cup firmly packed light brown sugar", "¼ cup honey", "2 tablespoons Dijon mustard", "2 tablespoons rice vinegar", "1 ½ teaspoons freshly ground black pepper", "½ teaspoon Worcestershire sauce", "1 pinch cayenne pepper"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Pour water, star anise, and cloves into the bottom of a roasting pan. Place a roasting rack into the pan over the water, anise, and cloves; place ham on rack. Cut 1/4-inch deep slashes 1/2-inch apart lengthwise and crosswise across the top of the entire ham.", "Bake ham in the preheated oven for 20 minutes. Whisk brown sugar, honey, mustard, vinegar, black pepper, Worcestershire sauce, and cayenne pepper together in a bowl until glaze has a thick, smooth consistency.", "Brush glaze all over ham. Continue baking ham, brushing glaze on every 20 minutes, until glaze is deep golden and ham is heated through, about 2 hours 10 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).", "Use a kitchen torch to heat the glaze on the ham until it is crispy and caramelized, 2 to 5 minutes."], "facts": "455 calories; protein 34g 68% DV; carbohydrates 18.9g 6% DV; fat 26.4g 41% DV; cholesterol 97.3mg 32% DV; sodium 1918.7mg 77% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/7073/hot-cross-buns-i/", "name": "Hot Cross Buns I", "summary": "\nHot cross buns! Hot cross buns! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999636.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 20 mins"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "12 buns"]], "ingredients": ["¾ cup warm water (110 degrees F/45 degrees C)", "3 tablespoons butter", "1 tablespoon instant powdered milk", "¼ cup white sugar", "⅜ teaspoon salt", "1  egg", "1  egg white", "3 cups all-purpose flour", "1 tablespoon active dry yeast", "¾ cup dried currants", "1 teaspoon ground cinnamon", "1  egg yolk", "2 tablespoons water", "½ cup confectioners' sugar", "¼ teaspoon vanilla extract", "2 teaspoons milk"], "direction": ["Put warm water, butter, skim milk powder, 1/4 cup sugar, salt, egg, egg white, flour, and yeast in bread maker and start on dough program.", "When 5 minutes of kneading are left, add currants and cinnamon. Leave in machine till double.", "Punch down on floured surface, cover, and let rest 10 minutes.", "Shape into 12 balls and place in a greased 9 x 12 inch pan. Cover and let rise in a warm place till double, about 35-40 minutes.", "Mix egg yolk and 2 tablespoons water. Brush on balls.", "Bake at 375 degrees F (190 degrees C) for 20 minutes. Remove from pan immediately and cool on wire rack.", "To make crosses: mix together confectioners' sugar, vanilla, and milk. Place glaze in a piping bag or a sandwich bag with the corner snipped off; pipe a cross onto each roll."], "facts": "217 calories; protein 5.2g 10% DV; carbohydrates 40.5g 13% DV; fat 4g 6% DV; cholesterol 40.3mg 13% DV; sodium 108.7mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/45641/roasted-rack-of-lamb/", "name": "Roasted Rack of Lamb", "summary": "\nI have had this recipe for a long time, and always enjoy making it.  You can also do the same thing with beef or pork. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6433140.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 Servings"]], "ingredients": ["½ cup fresh bread crumbs", "2 tablespoons minced garlic", "2 tablespoons chopped fresh rosemary", "1 teaspoon salt", "¼ teaspoon black pepper", "2 tablespoons olive oil", "1 (7 bone) rack of lamb, trimmed and frenched", "1 teaspoon salt", "1 teaspoon black pepper", "2 tablespoons olive oil", "1 tablespoon Dijon mustard"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). Move oven rack to  the center position.", "In a large bowl, combine bread crumbs, garlic, rosemary, 1 teaspoon salt and 1/4 teaspoon pepper. Toss in 2 tablespoons olive oil to moisten mixture. Set aside.", "Season the rack all over with salt and pepper. Heat 2 tablespoons olive oil in a large heavy oven proof skillet over high heat. Sear rack of lamb for 1 to 2 minutes on all sides. Set aside for a few minutes. Brush rack of lamb with the mustard. Roll in the bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring.", "Arrange the rack bone side down in the skillet. Roast the lamb in preheated oven for 12 to 18 minutes, depending on the degree of doneness you want. With a meat thermometer, take a reading in the center of the meat after 10 to 12 minutes and remove the meat, or let it cook longer, to your taste. Let it rest for 5 to 7 minutes, loosely covered, before carving between the ribs."], "facts": "481 calories; protein 22.2g 44% DV; carbohydrates 5.6g 2% DV; fat 40.8g 63% DV; cholesterol 94.1mg 31% DV; sodium 1368.8mg 55% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17244/braided-easter-egg-bread/", "name": "Braided Easter Egg Bread", "summary": "\nThis decorative Easter bread has whole eggs baked into it! Do not cook the whole eggs, as they will bake at the same time that the bread does. The eggs can also be dyed for extra color. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F379973.jpg", "meta": [["prep:", "45 mins"], ["cook:", "30 mins"], ["additional:", "1 hr 45 mins"], ["total:", "3 hrs"], ["Servings:", "10"], ["Yield:", "1 1-pound loaf"]], "ingredients": ["2 ½ cups all-purpose flour, divided", "¼ cup white sugar", "1 teaspoon salt", "1 (.25 ounce) package active dry yeast", "⅔ cup milk", "2 tablespoons butter", "2  eggs", "5  whole eggs, dyed if desired", "2 tablespoons butter, melted"], "direction": ["In a large bowl, combine 1 cup flour, sugar, salt and yeast; stir well. Combine milk and butter in a small saucepan; heat until milk is warm and butter is softened but not melted.", "Gradually add the milk and butter to the flour mixture; stirring constantly. Add two eggs and 1/2 cup flour; beat well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal size rounds; cover and let rest for 10 minutes. Roll each round into a long roll about 36 inches long and 1 1/2 inches thick. Using the two long pieces of dough, form a loosely braided ring, leaving spaces for the five colored eggs. Seal the ends of the ring together and use your fingers to slide the eggs between the braids of dough.", "Preheat oven to 350 degrees F (175 degrees C). Place loaf on a buttered baking sheet and cover loosely with a damp towel. Place loaf in a warm place and let rise until doubled in bulk, about 45 minutes. Brush risen loaf with melted butter.", "Bake in the preheated oven until golden brown, about 30 minutes."], "facts": "234 calories; protein 8.5g 17% DV; carbohydrates 30.1g 10% DV; fat 8.7g 14% DV; cholesterol 143.7mg 48% DV; sodium 321.9mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15810/carrot-pineapple-cake-i/", "name": "Carrot Pineapple Cake I", "summary": "\nThe carrots and pineapple work together to keep this cake moist and wholesome. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2174192.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "24"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking soda", "1 teaspoon baking powder", "1 teaspoon salt", "2 teaspoons ground cinnamon", "1 ¾ cups white sugar", "1 cup vegetable oil", "3  eggs", "1 teaspoon vanilla extract", "2 cups shredded carrots", "1 cup flaked coconut", "1 cup chopped walnuts", "1 (8 ounce) can crushed pineapple, drained", "1 (8 ounce) package cream cheese", "¼ cup butter, softened", "2 cups confectioners' sugar"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.", "Mix flour, baking soda, baking powder, salt and cinnamon.  Make a well in the center and add sugar, oil, eggs and vanilla.  Mix with wooden spoon until smooth.  Stir in carrots, coconut, walnuts and pineapple.", "Pour into 9x13 inch pan. Bake at 350 degrees for about 45 minutes.  Don't panic, the center will sink a little. Allow to cool.", "To make the frosting: Cream the butter and cream cheese until smooth. Add the confectioners sugar and beat until creamy."], "facts": "329 calories; protein 3.6g 7% DV; carbohydrates 37.6g 12% DV; fat 19.1g 30% DV; cholesterol 38.6mg 13% DV; sodium 287.7mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17315/easter-meat-pie/", "name": "Easter Meat Pie", "summary": "\nThis meat pie is a winner every Easter. Stuffed full of ham, salami, and prosciutto, as well as ricotta, Parmesan, and mozzarella cheeses, this pie really satisfies! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4408891.jpg", "meta": [["prep:", "45 mins"], ["cook:", "1 hr"], ["total:", "1 hr 45 mins"], ["Servings:", "12"], ["Yield:", "2 - 9 inch pies"]], "ingredients": ["4 (9 inch)  unbaked pie crusts", "2 pounds ricotta cheese", "6  eggs", "8 ounces mozzarella cheese, grated", "1 pound cooked ham, chopped", "½ pound Genoa salami, chopped", "¼ pound prosciutto, chopped", "¼ cup grated Parmesan cheese"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Place ricotta in a large mixing bowl and add eggs one at a time while mixing on low speed. Stir in mozzarella, ham, salami, and prosciutto until all ingredients are well combined. Line two 9 inch pans with pastry. Spoon half of mixture into each pan. Sprinkle half of the Parmesan cheese over each pie, then cover with top pastry. Crimp edges and cut steam vents in tops.", "Bake in preheated oven for 1 hour, until crust is golden brown. Cool on racks."], "facts": "727 calories; protein 33.8g 68% DV; carbohydrates 31.2g 10% DV; fat 51.4g 79% DV; cholesterol 193.6mg 65% DV; sodium 1601.6mg 64% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/153459/easter-buttermilk-hot-cross-buns/", "name": "Easter Buttermilk Hot Cross Buns", "summary": "\nThese are a family tradition for Easter brunch. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1121946.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["additional:", "1 hr 45 mins"], ["total:", "2 hrs 20 mins"], ["Servings:", "18"], ["Yield:", "18 buns"]], "ingredients": ["½ cup water", "1 (.25 ounce) package active dry yeast", "1 cup buttermilk, room temperature", "2 tablespoons white sugar", "½ teaspoon baking soda", "1 teaspoon salt", "1 teaspoon ground cinnamon", "⅓ cup margarine, melted", "3 ¼ cups all-purpose flour", "⅔ cup raisins", "½ (16 ounce) container prepared vanilla frosting"], "direction": ["Measure the water into a large bowl and sprinkle the yeast over the top. Let stand about 5 minutes to dissolve the yeast. Stir in the buttermilk, sugar, baking soda, salt, cinnamon and margarine. Mix in 1 cup of flour until well blended, then stir in the raisins. Gradually mix in the remaining flour until the dough is stiff enough to take out of the bowl and knead on a floured surface. Knead the dough until smooth and elastic, about 5 minutes. Place in a greased bowl, turning to coat and cover with a towel. Let rise in a warm place until doubled in size, about 1 hour.", "Turn the dough out onto a floured surface and divide into 18 pieces. Shape each piece into a ball and place in a greased 9x13 inch baking dish. Cover loosely with a towel and allow to rise again until your finger leaves an impression when you poke the dough gently, about 45 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Remove the towel from the buns. Bake in the preheated oven until golden brown, about 20 minutes. Spoon the frosting into a small sandwich bag or pastry bag. Snip off the corner and squeeze out frosting to make a cross on top of the buns when cool."], "facts": "194 calories; protein 3.2g 6% DV; carbohydrates 32.8g 11% DV; fat 5.7g 9% DV; cholesterol 0.5mg; sodium 241.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/70660/chocolate-covered-easter-eggs/", "name": "Chocolate Covered Easter Eggs", "summary": "\nThis is a great recipe that you can add different ingredients to that will make 4 different kind of eggs...all yummy.  I always get tons of compliments when I make these. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2188092.jpg", "meta": [["prep:", "30 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "48"], ["Yield:", "3 pounds candy"]], "ingredients": ["½ cup butter, softened", "1 teaspoon vanilla extract", "1 (8 ounce) package cream cheese, softened", "2 ½ pounds confectioners' sugar", "1 cup creamy peanut butter  (Optional)", "1 cup flaked coconut  (Optional)", "1 cup unsweetened cocoa powder  (Optional)", "2 cups semisweet chocolate pieces", "1 tablespoon shortening or vegetable oil  (Optional)"], "direction": ["In a large bowl, mix together the butter, vanilla, and cream cheese. Stir in confectioners' sugar to make a workable dough. For best results, use your hands for mixing.", "Divide the dough into four parts. Leave one of the parts plain. To the second part, mix in peanut butter. Mix coconut into the third part, and cocoa powder into the last part. Roll each type of dough into egg shapes, and place on a waxed paper-lined cookie sheet. Refrigerate until hard, at least an hour.", "Melt chocolate chips in a heat-proof bowl over a pan of simmering water. Stir occasionally until smooth. If the chocolate seems too thick for coating, stir in a teaspoon of the shortening or oil until it thins to your desired consistency. Dip the chilled candy eggs in chocolate, and return to the waxed paper lined sheet to set. Refrigerate for 1/2 hour to harden."], "facts": "204 calories; protein 2.4g 5% DV; carbohydrates 30.9g 10% DV; fat 9.3g 14% DV; cholesterol 10.2mg 3% DV; sodium 57.9mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/221109/aunt-connies-coconut-cake/", "name": "Aunt Connie's Coconut Cake", "summary": "\nAunt Connie made this cake for special occasions. It is as wonderful as she was, and I remember her every time I make it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1030817.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 50 mins"], ["Servings:", "16"], ["Yield:", "1 10-inch tube cake"]], "ingredients": ["3 cups all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking soda", "1 ½ cups butter, softened", "3 cups white sugar", "6  eggs", "1 cup sour cream", "1 teaspoon vanilla extract", "1 (7 ounce) package sweetened flaked coconut", "1 cup milk", "2 tablespoons cornstarch", "1 cup white sugar", "½ cup butter, softened", "½ cup solid vegetable shortening", "2 teaspoons vanilla extract", "½ (7 ounce) package sweetened flaked coconut"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Grease a 10-inch tube pan.", "Combine flour, salt, and baking soda in a bowl.", "Beat 1 1/2 cup butter and 3 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color.", "Beat eggs one at a time into butter mixture, allowing each egg to blend completely before adding the next. Beat in sour cream and 1 teaspoon vanilla extract with the last egg.", "Gradually stir flour mixture into egg mixture, mixing until just incorporated.", "Fold in 7 ounces flaked coconut, mixing just enough to evenly combine. Pour the batter into prepared pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 90 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.", "Whisk milk and cornstarch in a saucepan over medium heat until mixture becomes very thick, stirring constantly, about 5 minutes; set aside to cool completely.", "Beat 1 cup sugar, 1/2 cup butter, and shortening with an electric mixer in a bowl until mixture is smooth and creamy.", "Beat cooled milk paste and 2 teaspoons vanilla extract into sugar mixture to achieve a light and creamy frosting.", "Spread frosting over completely cooled cake and sprinkle remaining 3 1/2 ounces flaked coconut over the frosting."], "facts": "694 calories; protein 6.6g 13% DV; carbohydrates 79.9g 26% DV; fat 40g 62% DV; cholesterol 138.3mg 46% DV; sodium 312.6mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12562/torta-rustica/", "name": "Torta Rustica", "summary": "\nThis savory pie is served at room temperature. Two teaspoons dried basil may be substituted for fresh basil. Use ham or prosciutto ham. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F626474.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["2 ¼ cups all-purpose flour", "¾ cup cornmeal", "½ teaspoon salt", "¾ cup butter, diced", "2  eggs", "4 tablespoons cold water", "1 ½ cups ricotta cheese", "4 ounces feta cheese", "1 cup grated Parmesan cheese", "1  egg", "¼ cup chopped parsley", "2 tablespoons chopped fresh basil", "2 teaspoons chopped fresh oregano", "2 cups shredded mozzarella cheese", "½ pound ham slices", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "½ (16 ounce) jar roasted red peppers, drained and patted dry", "1  egg"], "direction": ["Mix flour, cornmeal, and salt in a bowl.  Cut in butter with pastry blender until mixture resembles coarse crumbs.  Beat 2 eggs with 3 tablespoons cold water; stir into flour mixture until dough holds together.  Add another tablespoon water if needed.  Shape 2/3 of the dough into flattened round; repeat with remaining 1/3.  Wrap.  Refrigerate at least 30 minutes, or until firm enough to roll.", "In another bowl, combine ricotta cheese, crumbled feta, Parmesan cheese, 1 egg, parsley, basil, and oregano until well blended.", "Have an 8 or 9 inch springform pan ready.  On a lightly floured surface, roll out the larger portion of dough into a 15 inch diameter circle.  Carefully place in ungreased pan;  press lightly against bottom and sides.  Trim overhanging dough to 1 inch from pan rim.", "Scatter half of the mozzarella over the bottom of the crust. Next arrange half the ham slices in an even layer. Spread with ricotta cheese mixture, then sprinkle with spinach.  Cover with the remaining ham slices.  Press down gently to pack layers.  Add red peppers in a single layer, and  top with the remaining mozzarella. Press down again.", "Roll out remaining dough to 8 or 9 inch circle.  Place over filling to cover.  Moisten edges, and seal crusts together.  Crimp or flute edges.  Crust should not extend above pan rim.  Beat remaining egg, and brush over the crust.  Cut several small vents in top crust for steam to escape.", "Bake at 375 degrees F (190 degrees C) for 1 hour, or until crust is deep golden brown and pulls away from sides.  Cool in pan on wire rack 45 minutes.  Remove pan sides; cool completely.  Cut into 12 wedges.  Serve at room temperature."], "facts": "589 calories; protein 26.4g 53% DV; carbohydrates 41.7g 13% DV; fat 35.5g 55% DV; cholesterol 198.5mg 66% DV; sodium 1293.8mg 52% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/241834/oven-roasted-sweet-potatoes/", "name": "Oven Roasted Sweet Potatoes", "summary": "\nMy Granny made this for Easter dinner. We were all sitting at the table commenting on how delicious it was. She sat down took a bite and sighed, Ahhh, I'll never make this again.  We all told her she was crazy and asked for the recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4540048.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups chopped peeled sweet potato", "1  sweet onions (such as Vidalia®), cut into wedges", "2 cloves garlic, sliced", "3 tablespoons olive oil", "1 tablespoon balsamic vinegar, or more to taste", "1 pinch salt and ground black pepper to taste"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Mix sweet potatoes, sweet onion, and garlic in a bowl. Drizzle olive oil over the mixture and toss to coat; pour into a shallow roasting pan.", "Roast sweet potato mixture in preheated oven, turning frequently, until the vegetables are soft and golden brown, 30 to 35 minutes. Drizzle balsamic vinegar over the vegetables; season with salt and pepper."], "facts": "224 calories; protein 2.6g 5% DV; carbohydrates 31.3g 10% DV; fat 10.2g 16% DV; cholesterol 0mg; sodium 114.8mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12963/greek-lemon-chicken-soup/", "name": "Greek Lemon Chicken Soup", "summary": "\nThis soup is perfect as an introduction to a full Greek meal, or a hearty bowlful for a meal in itself.  Serve with fresh pita triangles, and you'll be sure to please your guests!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5795826.jpg", "meta": [["prep:", "25 mins"], ["cook:", "40 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["8 cups chicken broth", "½ cup fresh lemon juice", "½ cup shredded carrots", "½ cup chopped onion", "½ cup chopped celery", "6 tablespoons chicken soup base", "¼ teaspoon ground white pepper", "¼ cup margarine", "¼ cup all-purpose flour", "1 cup cooked white rice", "1 cup diced, cooked chicken meat", "16 slices  lemon", "8  egg yolks"], "direction": ["In a large pot, combine the chicken broth, lemon juice, carrots, onions, celery, soup base, and white pepper. Bring to a boil on high, then simmer for 20 minutes.", "Blend the butter and the flour together. Then gradually add it to the soup mixture. Simmer for 10 minutes more, stirring frequently.", "Meanwhile, beat the egg yolks until light in color. Gradually add some of the hot soup to the egg yolks, stirring constantly. Return the egg mixture to the soup pot and heat through. Add the rice and chicken. Ladle hot soup into bowls and garnish with lemon slices."], "facts": "124 calories; protein 7.8g 16% DV; carbohydrates 9.1g 3% DV; fat 6.6g 10% DV; cholesterol 110.3mg 37% DV; sodium 1236.8mg 50% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/36927/rosemary-braised-lamb-shanks/", "name": "Rosemary Braised Lamb Shanks", "summary": "\nLamb shanks are slowly simmered with fresh rosemary, garlic, tomatoes, and red wine. Great served with polenta, or my family's favorite--roasted garlic mashed potatoes--as you need something to soak up the wonderful sauce. A fantastic dish for company, as all the prep work is done at the beginning, and then you just have to wait. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5493417.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  lamb shanks", "salt and pepper to taste", "2 tablespoons olive oil", "2  onions, chopped", "3 large carrots, cut into 1/4 inch rounds", "10 cloves garlic, minced", "1 (750 milliliter) bottle red wine", "1 (28 ounce) can whole peeled tomatoes with juice", "1 (10.5 ounce) can condensed chicken broth", "1 (10.5 ounce) can beef broth", "5 teaspoons chopped fresh rosemary", "2 teaspoons chopped fresh thyme"], "direction": ["Sprinkle shanks with salt and pepper. Heat oil in heavy large pot or Dutch oven over medium-high heat. Working in batches, cook shanks until brown on all sides, about 8 minutes. Transfer shanks to plate.", "Add onions, carrots and garlic to pot and saute until golden brown, about 10 minutes. Stir in wine, tomatoes, chicken broth and beef broth. Season with rosemary and thyme. Return shanks to pot, pressing down to submerge. Bring to a boil, then reduce heat to medium-low.  Cover, and simmer until meat is tender, about 2 hours.", "Remove cover from pot. Simmer about 20 minutes longer. Transfer shanks to platter, place in a warm oven. Boil juices in pot until thickened, about 15 minutes.  Spoon over shanks."], "facts": "481 calories; protein 30.3g 61% DV; carbohydrates 17.6g 6% DV; fat 21.8g 34% DV; cholesterol 92.7mg 31% DV; sodium 758.7mg 30% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/18990/banana-pudding-i/", "name": "Banana Pudding I", "summary": "\nThis is a recipe that's been handed down from my grandmother. My whole family loves it and we all grew up on it!  Hope you enjoy it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1121232.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["⅔ cup white sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "3  eggs, beaten", "2 cups milk", "½ teaspoon vanilla extract", "2 tablespoons butter, softened", "2  bananas, peeled and sliced", "½ (12 ounce) package vanilla wafer cookies"], "direction": ["In medium saucepan combine sugar, flour, and salt. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly. When mixture begins to thicken, remove from heat and continue to stir, cooling slightly. Stir in vanilla and butter until smooth.", "Layer pudding with bananas and vanilla wafers in a serving dish. Chill at least one hour in refrigerator before serving."], "facts": "666 calories; protein 13.9g 28% DV; carbohydrates 91.1g 29% DV; fat 28.2g 43% DV; cholesterol 505.4mg 169% DV; sodium 381.8mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/9999/peanut-butter-bars-i/", "name": "Peanut Butter Bars I", "summary": "\nThese peanut butter bars taste just like peanut butter cups. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548869.jpg", "meta": [["prep:", "25 mins"], ["additional:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["1 cup butter or margarine, melted", "2 cups graham cracker crumbs", "2 cups confectioners' sugar", "1 cup peanut butter", "1 ½ cups semisweet chocolate chips", "4 tablespoons peanut butter"], "direction": ["In a medium bowl, mix together the butter or margarine, graham cracker crumbs, confectioners' sugar, and 1 cup peanut butter until well blended. Press evenly into the bottom of an ungreased 9x13 inch pan.", "In a metal bowl over simmering water, or in the microwave, melt the chocolate chips with the 4 tablespoons peanut butter, stirring occasionally until smooth. Spread over the prepared crust. Refrigerate for at least one hour before cutting into squares."], "facts": "532 calories; protein 8.8g 18% DV; carbohydrates 49.2g 16% DV; fat 36.6g 56% DV; cholesterol 40.7mg 14% DV; sodium 319.7mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/109297/cedar-planked-salmon/", "name": "Cedar Planked Salmon", "summary": "\nThis is a dish my brother prepared for me in Seattle. It is by far the best salmon I've ever eaten. I like to serve it with an Asian-inspired rice and roasted asparagus. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2609651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 (12 inch) untreated cedar planks", "⅓ cup vegetable oil", "1 ½ tablespoons rice vinegar", "1 teaspoon sesame oil", "⅓ cup soy sauce", "¼ cup chopped green onions", "1 tablespoon grated fresh ginger root", "1 teaspoon minced garlic", "2 (2 pound) salmon fillets, skin removed"], "direction": ["Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time.", "In a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour.", "Preheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little.", "Place the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill."], "facts": "678 calories; protein 61.3g 123% DV; carbohydrates 1.7g 1% DV; fat 45.8g 70% DV; cholesterol 178.6mg 60% DV; sodium 981.2mg 39% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/147103/delicious-egg-salad-for-sandwiches/", "name": "Delicious Egg Salad for Sandwiches", "summary": "\nThis is a wonderful-tasting egg salad sandwich that you will definitely devour. It's really good on rye. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F191517.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "10 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  eggs", "½ cup mayonnaise", "1 teaspoon prepared yellow mustard", "¼ cup chopped green onion", "salt and pepper to taste", "¼ teaspoon paprika"], "direction": ["Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.", "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."], "facts": "344 calories; protein 13g 26% DV; carbohydrates 2.3g 1% DV; fat 31.9g 49% DV; cholesterol 382.5mg 128% DV; sodium 350.6mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/", "name": "Creamy Au Gratin Potatoes", "summary": "\nThis is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F738814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  russet potatoes, sliced into 1/4 inch slices", "1  onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "½ teaspoon salt", "2 cups milk", "1 ½ cups shredded Cheddar cheese"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.", "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.", "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.", "Bake 1 1/2 hours in the preheated oven."], "facts": "499 calories; protein 19.8g 40% DV; carbohydrates 49.3g 16% DV; fat 25.4g 39% DV; cholesterol 77.2mg 26% DV; sodium 683.4mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/87013/hash-brown-and-egg-casserole/", "name": "Hash Brown and Egg Casserole", "summary": "\nThis is my family's recipe that has been handed down through the years.  We've always used the maple flavored pork sausage but any kind is good.  This casserole is a nice and cozy breakfast or brunch meal that everyone will enjoy.  It's got the perfect taste with lots of cheese. Yum! Be sure to use a baking dish that is deep enough to cover with aluminum foil. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2331971.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "1 - 8x8 inch casserole"]], "ingredients": ["1 (2 pound) package frozen hash brown potatoes, thawed", "1 pound pork sausage", "1 small onion, diced", "5  eggs", "½ cup milk", "½ teaspoon onion powder", "⅛ teaspoon garlic powder", "salt and ground black pepper to taste", "12 ounces shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.", "Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.", "Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."], "facts": "616 calories; protein 33.5g 67% DV; carbohydrates 30.4g 10% DV; fat 48.9g 75% DV; cholesterol 259.5mg 87% DV; sodium 1141.7mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15093/grandmas-lemon-meringue-pie/", "name": "Grandma's Lemon Meringue Pie", "summary": "\nThis is a very fun recipe to follow, because Grandma makes it sweet and simple. This pie is thickened with cornstarch and flour in addition to egg yolks, and contains no milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672049.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 cup white sugar", "2 tablespoons all-purpose flour", "3 tablespoons cornstarch", "¼ teaspoon salt", "1 ½ cups water", "2  lemons, juiced and zested", "2 tablespoons butter", "4  egg yolks, beaten", "1 (9 inch) pie crust, baked", "4  egg whites", "6 tablespoons white sugar"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "To Make Lemon Filling: In a medium saucepan, whisk together 1 cup sugar, flour, cornstarch, and salt. Stir in water, lemon juice and lemon zest. Cook over medium-high heat, stirring frequently, until mixture comes to a boil. Stir in butter. Place egg yolks in a small bowl and gradually whisk in 1/2 cup of hot sugar mixture. Whisk egg yolk mixture back into remaining sugar mixture. Bring to a boil and continue to cook while stirring constantly until thick. Remove from heat. Pour filling into baked pastry shell.", "To Make Meringue: In a large glass or metal bowl, whip egg whites until foamy. Add sugar gradually, and continue to whip until stiff peaks form. Spread meringue over pie, sealing the edges at the crust.", "Bake in preheated oven for 10 minutes, or until meringue is golden brown."], "facts": "298 calories; protein 4.4g 9% DV; carbohydrates 49.7g 16% DV; fat 10.3g 16% DV; cholesterol 110.1mg 37% DV; sodium 229.2mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/7402/carrot-cake-iii/", "name": "Carrot Cake III", "summary": "\nI've tried many carrot cakes, and this is my favorite recipe. If you don't like pecans, feel free to leave them out. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F26%2F1053595-Carrot-Cake-III-7402-sarah-2000.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "30 mins"], ["total:", "2 hrs"], ["Servings:", "18"], ["Yield:", "1 - 9x13 inch cake"]], "ingredients": ["4  eggs", "1 ¼ cups vegetable oil", "2 cups white sugar", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons baking powder", "½ teaspoon salt", "2 teaspoons ground cinnamon", "3 cups grated carrots", "1 cup chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Grease and flour a 9x13 inch pan.", "In a large bowl, beat together eggs, oil, white sugar and 2 teaspoons vanilla. Mix in flour, baking soda, baking powder, salt and cinnamon. Stir in carrots. Fold in pecans.  Pour into prepared pan.", "Bake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.", "To Make Frosting:  In a medium bowl, combine butter, cream cheese, confectioners' sugar and 1 teaspoon vanilla. Beat until the mixture is smooth and creamy. Stir in chopped pecans. Frost the cooled cake."], "facts": "575 calories; protein 5.1g 10% DV; carbohydrates 63.7g 21% DV; fat 34.8g 54% DV; cholesterol 68.8mg 23% DV; sodium 347.2mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/240290/moms-scalloped-potatoes/", "name": "Mom's Scalloped Potatoes", "summary": "\nThis is the way my mother always made her scalloped potatoes. The measurements are taken from other recipes because she always just winged it, but the method is the same. The key is to heat the milk first! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1883772.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds potatoes, thinly sliced", "½  onion, thinly sliced", "9 tablespoons all-purpose flour, divided", "6 tablespoons butter, diced and divided", "salt and ground black pepper to taste", "3 cups whole milk, or as needed"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.", "Spread about 1/3 of the potato slices into the bottom of the prepared baking dish. Top with about 1/3 of the onion slices. Sprinkle 3 tablespoons flour over the potato and onion. Arrange 2 tablespoons butter atop the flour. Season the entire layer with salt and pepper. Repeat layering twice more.", "Heat milk in a saucepan until warm. Pour enough warm milk over the mixture in the baking dish so the top of the liquid is level with the final layer of potatoes.", "Bake in preheated oven until potatoes are tender, 45 to 60 minutes."], "facts": "396 calories; protein 9.9g 20% DV; carbohydrates 55g 18% DV; fat 15.8g 24% DV; cholesterol 42.7mg 14% DV; sodium 170.7mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17393/best-carrot-cake-ever/", "name": "Best Carrot Cake Ever", "summary": "\nA moist and flavorful recipe that makes a large quantity of cake. I have been hounded to make this cake time and time again. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3605684.jpg", "meta": [["prep:", "1 hr 30 mins"], ["cook:", "1 hr"], ["total:", "2 hrs 30 mins"], ["Servings:", "16"], ["Yield:", "2 - 10 inch round layers"]], "ingredients": ["6 cups grated carrots", "1 cup brown sugar", "1 cup raisins", "4  eggs", "1 ½ cups white sugar", "1 cup vegetable oil", "2 teaspoons vanilla extract", "1 cup crushed pineapple, drained", "3 cups all-purpose flour", "1 ½ teaspoons baking soda", "1 teaspoon salt", "4 teaspoons ground cinnamon", "1 cup chopped walnuts"], "direction": ["In a medium bowl, combine grated carrots and brown sugar. Set aside for 60 minutes, then stir in raisins.", "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 10 inch cake pans.", "In a large bowl, beat eggs until light. Gradually beat in the white sugar, oil and vanilla. Stir in the pineapple. Combine the flour, baking soda, salt and cinnamon, stir into the wet mixture until absorbed. Finally stir in the carrot mixture and the walnuts. Pour evenly into the prepared pans.", "Bake for 45 to 50 minutes in the preheated oven, until cake tests done with a toothpick. Cool for 10 minutes before removing from pan. When completely cooled, frost with cream cheese frosting."], "facts": "457 calories; protein 5.9g 12% DV; carbohydrates 66.3g 21% DV; fat 20.2g 31% DV; cholesterol 46.5mg 16% DV; sodium 315.2mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/18417/spanakopita-greek-spinach-pie/", "name": "Spanakopita (Greek Spinach Pie)", "summary": "\nThis is an authentic, really rich pie stuffed with spinach, onions, cheeses and herbs that are all enfolded by crispy, flaky phyllo dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F754051.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "5"], ["Yield:", "1 - 9x9 inch pan"]], "ingredients": ["3 tablespoons olive oil", "1 large onion, chopped", "1 bunch green onions, chopped", "2 cloves garlic, minced", "2 pounds spinach, rinsed and chopped", "½ cup chopped fresh parsley", "2  eggs, lightly beaten", "½ cup ricotta cheese", "1 cup crumbled feta cheese", "8 sheets phyllo dough", "¼ cup olive oil"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x9 inch square baking pan.", "Heat 3 tablespoons olive oil in a large skillet over medium heat. Saute onion, green onions and garlic, until soft and lightly browned. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from heat and set aside to cool.", "In a medium bowl, mix together eggs, ricotta, and feta. Stir in spinach mixture. Lay 1 sheet of phyllo dough in prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top, brush with olive oil, and repeat process with two more sheets of phyllo. The sheets will overlap the pan. Spread spinach and cheese mixture into pan and fold overhanging dough over filling. Brush with oil, then layer remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into pan to seal filling.", "Bake in preheated oven for 30 to 40 minutes, until golden brown. Cut into squares and serve while hot."], "facts": "494 calories; protein 18.2g 36% DV; carbohydrates 31.5g 10% DV; fat 34.7g 53% DV; cholesterol 100.3mg 33% DV; sodium 893.9mg 36% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12481/old-fashioned-coconut-cream-pie/", "name": "Old Fashioned Coconut Cream Pie", "summary": "\nThis is a tried-and-true, old-fashioned coconut cream pie. Took many years of searching and baking to find the right one and this is it! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4899464.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 50 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 cup sweetened flaked coconut", "3 cups half-and-half", "2  eggs, beaten", "¾ cup white sugar", "½ cup all-purpose flour", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 (9 inch) pie shell, baked", "1 cup frozen whipped topping, thawed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Spread the coconut on a baking sheet and bake it, stirring occasionally, until golden brown, about 5 minutes.", "In a medium saucepan, combine the half-and-half, eggs, sugar, flour and salt and mix well. Bring to a boil over low heat, stirring constantly. Cook, stirring constantly, for 2 minutes more. Remove the pan from the heat, and stir in 3/4 cup of the toasted coconut and the vanilla extract. Reserve the remaining coconut to top the pie.", "Pour the filling into the pie shell and chill until firm, about 4 hours.", "Top with whipped topping and with the reserved coconut."], "facts": "423 calories; protein 6.8g 14% DV; carbohydrates 46.1g 15% DV; fat 23.5g 36% DV; cholesterol 80.1mg 27% DV; sodium 275.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/20876/crustless-spinach-quiche/", "name": "Crustless Spinach Quiche", "summary": "\nI serve this in the summer for brunch with a side of sausage links and a fresh fruit bowl! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F451789.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1  onion, chopped", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "5  eggs, beaten", "3 cups shredded Muenster cheese", "¼ teaspoon salt", "⅛ teaspoon ground black pepper"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie pan.", "Heat oil in a large skillet over medium-high heat. Add onions and cook, stirring occasionally, until onions are soft. Stir in spinach and continue cooking until excess moisture has evaporated.", "In a large bowl, combine eggs, cheese, salt and pepper. Add spinach mixture and stir to blend. Scoop into prepared pie pan.", "Bake in preheated oven until eggs have set, about 30 minutes. Let cool for 10 minutes before serving."], "facts": "310 calories; protein 20.4g 41% DV; carbohydrates 4.8g 2% DV; fat 23.7g 36% DV; cholesterol 209.2mg 70% DV; sodium 545.6mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/21461/ooey-gooey-cinnamon-buns/", "name": "Ooey-Gooey Cinnamon Buns", "summary": "\nThese buns are sooo good hot from the oven when they're gooey and warm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F353408.jpg", "meta": [["prep:", "2 hrs 30 mins"], ["cook:", "30 mins"], ["total:", "3 hrs"], ["Servings:", "15"], ["Yield:", "15 servings"]], "ingredients": ["1 teaspoon white sugar", "1 (.25 ounce) package active dry yeast", "½ cup warm water (110 degrees F/45 degrees C)", "½ cup milk", "¼ cup white sugar", "¼ cup butter", "1 teaspoon salt", "2  eggs, beaten", "4 cups all-purpose flour", "¾ cup butter", "¾ cup brown sugar", "1 cup chopped pecans, divided", "¾ cup brown sugar", "1 tablespoon ground cinnamon", "¼ cup melted butter"], "direction": ["In a small bowl, dissolve  1 teaspoon sugar and yeast in warm water. Let stand until creamy, about 10 minutes. Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in 1/4 cup sugar, 1/4 cup butter and salt; stir until melted. Let cool until lukewarm.", "In a large bowl, combine the yeast mixture, milk mixture, eggs and 1 1/2 cup flour; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "While dough is rising, melt 3/4 cup butter in a small saucepan over medium heat. Stir in 3/4 cup brown sugar, whisking until smooth. Pour into greased 9x13 inch baking pan. Sprinkle bottom of pan with 1/2 cup pecans; set aside. Melt remaining butter; set aside. Combine remaining 3/4 cup brown sugar, 1/2 cup pecans, and cinnamon; set aside.", "Turn dough out onto a lightly floured surface, roll  into an 18x14 inch rectangle. Brush with 2 tablespoons melted butter, leaving 1/2 inch border uncovered; sprinkle with brown sugar cinnamon mixture. Starting at long side, tightly roll up, pinching seam to seal. Brush with remaining 2 tablespoons butter. With serrated knife, cut into 15 pieces; place cut side down, in prepared pan. Cover and let rise for 1 hour or until doubled in volume. Meanwhile, preheat oven to 375 degrees F (190 degrees C).", "Bake in preheated oven for 25 to 30 minutes, until golden brown. Let cool in pan for 3 minutes, then invert onto serving platter. Scrape remaining filling from the pan onto the rolls."], "facts": "392 calories; protein 5.6g 11% DV; carbohydrates 45.3g 15% DV; fat 21.7g 34% DV; cholesterol 66.1mg 22% DV; sodium 281.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/", "name": "Macaron (French Macaroon)", "summary": "\nThis is the quintessential macaron (NOT macaroon) recipe. I am a baker's apprentice, and after much trial and error, we (the baker and I) finally perfected the technique. We decided to share with you all. Pipe your choice of filling on a cookie and sandwich another cookie on top. These are like cloud cookie sandwiches and are delicious if done correctly.  If you want to do it the super-easy way, just fill with your favorite flavor of frosting. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7426387.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "16 macarons"]], "ingredients": ["3  egg whites", "¼ cup white sugar", "1 ⅔ cups confectioners' sugar", "1 cup finely ground almonds"], "direction": ["Line a baking sheet with a silicone baking mat.", "Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until whites are foamy; beat in white sugar and continue beating until egg whites are glossy, fluffy, and hold soft peaks. Sift confectioners' sugar and ground almonds in a separate bowl and quickly fold the almond mixture into the egg whites, about 30 strokes.", "Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold the batter a few more times and retest.", "When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe the batter onto the baking sheet in rounds, leaving space between the disks. Let the piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour.", "Preheat oven to 285 degrees F (140 degrees C).", "Bake cookies until set but not browned, about 10 minutes; let cookies cool completely before filling."], "facts": "190 calories; protein 6.9g 14% DV; carbohydrates 36.4g 12% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 22mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/219721/rich-and-creamy-potatoes-au-gratin/", "name": "Rich and Creamy Potatoes Au Gratin", "summary": "\nThese are the easiest, creamiest potatoes au gratin I have ever had... YUM! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F810946.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes, peeled and very thinly sliced", "3 cloves garlic, minced", "¾ teaspoon salt", "1 cup heavy cream, divided", "freshly ground black pepper to taste", "freshly grated nutmeg to taste", "2 cups freshly shredded Gruyere cheese, divided"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place potatoes, garlic, and salt into a large pot, fill with enough water to cover, and bring to a boil. Reduce heat to medium, and simmer the potatoes until tender but not mushy, 8 to 10 minutes. With a slotted spoon, transfer about half the potatoes to a 9x13-inch baking dish.", "Pour half of the cream over the potatoes, season with black pepper and nutmeg, and sprinkle half of the Gruyere cheese onto the mixture. Top with the remaining potatoes; sprinkle again with black pepper and nutmeg. Pour on the remaining cream, and sprinkle with remaining Gruyere cheese.", "Bake in the preheated oven until the cheese topping is crisp and brown on top, about 1 hour."], "facts": "352 calories; protein 12.3g 25% DV; carbohydrates 32.1g 10% DV; fat 20g 31% DV; cholesterol 70.5mg 24% DV; sodium 330.5mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12151/banana-cream-pie-i/", "name": "Banana Cream Pie I", "summary": "\nBanana Cream Pie is one of the yummiest things on earth and this is a great one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3355919.jpg", "meta": [["prep:", "30 mins"], ["cook:", "12 mins"], ["additional:", "1 hr"], ["total:", "1 hr 42 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["¾ cup white sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "2 cups milk", "3  egg yolks, beaten", "2 tablespoons butter", "1 ¼ teaspoons vanilla extract", "1 (9 inch) baked pastry shell, cooled", "4  bananas, sliced"], "direction": ["In a saucepan, combine the sugar, flour, and salt.  Add milk in gradually while stirring gently.  Cook over medium heat, stirring constantly, until the mixture is bubbly.  Keep stirring and cook for about 2 more minutes, and then remove from the burner.", "Stir a small quantity of the hot mixture into the beaten egg yolks, and immediately add egg yolk mixture to the rest of the hot mixture.  Cook for 2 more minutes; remember to keep stirring.  Remove the mixture from the stove, and add butter and vanilla.  Stir until the whole thing has a smooth consistency.", "Slice bananas into the cooled baked pastry shell.  Top with pudding mixture.", "Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes.  Chill for an hour."], "facts": "303 calories; protein 4.9g 10% DV; carbohydrates 47.2g 15% DV; fat 11.1g 17% DV; cholesterol 89.3mg 30% DV; sodium 223.8mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/16664/spinach-quiche/", "name": "Spinach Quiche", "summary": "\nLet me start by saying that I devised this recipe myself, and I just sort of add 'this and that.' This recipe is VERY forgiving, so you can add or remove ingredients according to your taste! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2144550.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "1 - 9 inch quiche"]], "ingredients": ["½ cup butter", "3 cloves garlic, chopped", "1 small onion, chopped", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "1 (4.5 ounce) can mushrooms, drained", "1 (6 ounce) package herb and garlic feta, crumbled", "1 (8 ounce) package shredded Cheddar cheese", "salt and pepper to taste", "1 (9 inch) unbaked deep dish pie crust", "4  eggs, beaten", "1 cup milk", "salt and pepper to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "In a medium skillet, melt butter over medium heat. Saute garlic and onion in butter until lightly browned, about 7 minutes. Stir in spinach, mushrooms, feta and 1/2  cup Cheddar cheese. Season with salt and pepper. Spoon mixture into pie crust.", "In a medium bowl, whisk together eggs and milk. Season with salt and pepper. Pour into the pastry shell, allowing egg mixture to thoroughly combine with spinach mixture.", "Bake in preheated oven for 15 minutes. Sprinkle top with remaining Cheddar cheese, and bake an additional 35 to 40 minutes, until set in center. Allow to stand 10 minutes before serving."], "facts": "613 calories; protein 22.9g 46% DV; carbohydrates 23.9g 8% DV; fat 48.2g 74% DV; cholesterol 232mg 77% DV; sodium 1155.1mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/25202/beef-stroganoff-iii/", "name": "Beef Stroganoff III", "summary": "\nI have been making this recipe for over 20 years. This can be served over either rice or noodles. A little work but worth the effort. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F795486.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "8"], ["Yield:", "6 to 8 servings"]], "ingredients": ["2 pounds beef chuck roast", "½ teaspoon salt", "½ teaspoon ground black pepper", "4 ounces butter", "4  green onions, sliced (white parts only)", "4 tablespoons all-purpose flour", "1 (10.5 ounce) can condensed beef broth", "1 teaspoon prepared mustard", "1 (6 ounce) can sliced mushrooms, drained", "⅓ cup sour cream", "⅓ cup white wine", "salt to taste", "ground black pepper to taste"], "direction": ["Remove any fat and gristle from the roast and cut into strips 1/2 inch thick by 2 inches long. Season with 1/2 teaspoon of both salt and pepper.", "In a large skillet over medium heat, melt the butter and brown the beef strips quickly, then push the beef strips off to one side. Add the onions and cook slowly for 3 to 5 minutes, then push to the side with the beef strips.", "Stir the flour into the juices on the empty side of the pan. Pour in beef broth and bring to a boil, stirring constantly. Lower the heat and stir in mustard. Cover and simmer for 1 hour or until the meat is tender.", "Five minutes before serving, stir in the mushrooms, sour cream, and white wine. Heat briefly then salt and pepper to taste."], "facts": "304 calories; protein 16.6g 33% DV; carbohydrates 5.7g 2% DV; fat 23g 35% DV; cholesterol 82.8mg 28% DV; sodium 619.5mg 25% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/216759/the-perfect-cinnamon-roll-icing/", "name": "The Perfect Cinnamon Roll Icing", "summary": "\nAfter testing many recipes for cinnamon rolls I found that just about any home-made roll can be good if you have the right icing.  In too many recipes the cream cheese flavor overpowers the icing.  Use this recipe for decadent cream cheese icing on your favorite cinnamon roll and you won't be disappointed! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F14%2F1576692_original.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["2 ounces cream cheese, softened", "7 tablespoons butter, softened", "½ teaspoon vanilla extract", "2 tablespoons milk", "1 ½ cups confectioners' sugar, sifted", "¼ teaspoon salt"], "direction": ["Beat together the cream cheese and butter with an electric mixer in a large bowl until creamy. Mix in the vanilla and milk, then gradually mix in the confectioners' sugar and salt until smooth and fluffy."], "facts": "69 calories; protein 0.3g 1% DV; carbohydrates 7.9g 3% DV; fat 4.2g 7% DV; cholesterol 11.6mg 4% DV; sodium 55.7mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/22538/baked-salmon-fillets-dijon/", "name": "Baked Salmon Fillets Dijon", "summary": "\nDelicious baked salmon coated with Dijon-style mustard and seasoned bread crumbs, and topped with butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F265298.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (4 ounce) fillets salmon", "3 tablespoons prepared Dijon-style mustard", "salt and pepper to taste", "¼ cup Italian-style dry bread crumbs", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil.", "Place salmon skin-side down on foil. Spread a thin layer of mustard on the top of each fillet, and season with salt and pepper. Top with bread crumbs, then drizzle with melted butter.", "Bake in a preheated oven for 15 minutes, or until salmon flakes easily with a fork."], "facts": "331 calories; protein 25g 50% DV; carbohydrates 7.5g 2% DV; fat 21.5g 33% DV; cholesterol 106.5mg 36% DV; sodium 552.5mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/34785/mushrooms-and-spinach-italian-style/", "name": "Mushrooms and Spinach Italian Style", "summary": "\nThis recipe is a typical recipe of Southern Italy, specifically Apulia. Spinach and mushrooms are sauteed with onion, garlic, balsamic vinegar, and white wine. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5131325.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 serving"]], "ingredients": ["4 tablespoons olive oil", "1 small onion, chopped", "2 cloves garlic, chopped", "14 ounces fresh mushrooms, sliced", "10 ounces clean fresh spinach, roughly chopped", "2 tablespoons balsamic vinegar", "½ cup white wine", "salt and freshly ground black pepper to taste", "chopped fresh parsley, for garnish"], "direction": ["Heat the olive oil in a large skillet over medium-high heat. Saute onion and garlic in the oil until they start to become tender. Add the mushrooms, and fry until they begin to shrink, about 3 to 4 minutes. Toss in the spinach, and fry, stirring constantly for a few minutes, or until spinach is wilted.", "Add the vinegar, stirring constantly until it is absorbed, then stir in the white wine. Reduce heat to low, and simmer until the wine has almost completely absorbed. Season with salt and pepper to taste, and sprinkle with fresh parsley. Serve hot."], "facts": "199 calories; protein 5.6g 11% DV; carbohydrates 10.3g 3% DV; fat 14.2g 22% DV; cholesterol 0mg; sodium 68.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/21736/pan-seared-salmon-i/", "name": "Pan Seared Salmon I", "summary": "\nSimply seasoned with salt and pepper, these salmon fillets are pan seared with capers, and garnished with slices of lemon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998740.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) fillets salmon", "2 tablespoons olive oil", "2 tablespoons capers", "⅛ teaspoon salt", "⅛ teaspoon ground black pepper", "4 slices  lemon"], "direction": ["Preheat a large heavy skillet over medium heat for 3 minutes.", "Coat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.", "Transfer salmon to individual plates, and garnish with lemon slices."], "facts": "371 calories; protein 33.7g 67% DV; carbohydrates 1.7g 1% DV; fat 25.1g 39% DV; cholesterol 99.1mg 33% DV; sodium 299.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/80525/slow-cooker-ham/", "name": "Slow Cooker Ham", "summary": "\nFor a delicious, no-fuss ham that is juicy and good, try this slow cooker sensation with only two ingredients! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5280017.jpg", "meta": [["prep:", "15 mins"], ["cook:", "8 hrs"], ["total:", "8 hrs 15 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["2 cups packed brown sugar", "1 (8 pound) cured, bone-in picnic ham"], "direction": ["Spread about 1 1/2 cups of brown sugar on the bottom of the slow cooker crock. Place the ham flat side down into the slow cooker - you might have to trim it a little to make it fit. Use your hands to rub the remaining brown sugar onto the ham. Cover, and cook on Low for 8 hours."], "facts": "360 calories; protein 25.8g 52% DV; carbohydrates 18g 6% DV; fat 20.1g 31% DV; cholesterol 74.2mg 25% DV; sodium 1425.1mg 57% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/13717/grandmas-green-bean-casserole/", "name": "Grandma's Green Bean Casserole", "summary": "\nThis recipe is much better than the standard mushroom soup and French fried onion version. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F29335.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["2 tablespoons butter", "2 tablespoons all-purpose flour", "1 teaspoon salt", "1 teaspoon white sugar", "¼ cup onion, diced", "1 cup sour cream", "3 (14.5 ounce) cans French style green beans, drained", "2 cups shredded Cheddar cheese", "½ cup crumbled buttery round crackers", "1 tablespoon butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Melt 2 tablespoons butter in a large skillet over medium heat. Stir in flour until smooth, and cook for one minute. Stir in the salt, sugar, onion, and sour cream. Add green beans, and stir to coat.", "Transfer the mixture to a 2 1/2 quart casserole dish. Spread shredded cheese over the top. In a small bowl, toss together cracker crumbs and remaining butter, and sprinkle over the cheese.", "Bake for 30 minutes in the preheated oven, or until the top is golden and cheese is bubbly."], "facts": "215 calories; protein 7.8g 16% DV; carbohydrates 9.5g 3% DV; fat 16.4g 25% DV; cholesterol 45.1mg 15% DV; sodium 832mg 33% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/25787/coconut-macaroons-iii/", "name": "Coconut Macaroons III", "summary": "\nThis recipe has won many 1st place ribbons at my state fair. They are very simple to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F747272.jpg", "meta": [["prep:", "10 mins"], ["additional:", "15 mins"], ["total:", "25 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["⅔ cup all-purpose flour", "5 ½ cups flaked coconut", "¼ teaspoon salt", "1 (14 ounce) can sweetened condensed milk", "2 teaspoons vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil.", "In a large bowl, stir together the flour, coconut and salt. Stir in the sweetened condensed milk and vanilla using your hands until well blended. Use an ice cream scoop to drop dough onto the prepared cookie sheets. Cookies should be about golf ball size.", "Bake for 12 to 15 minutes in the preheated oven, until coconut is toasted."], "facts": "287 calories; protein 4.4g 9% DV; carbohydrates 40.7g 13% DV; fat 12.4g 19% DV; cholesterol 11.1mg 4% DV; sodium 186.8mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/217178/pull-apart-easter-blossom-bread/", "name": "Pull-Apart Easter Blossom Bread", "summary": "\nA rich eggy dough is twisted into pretty flowers, then filled with jam in this decadent Easter bread. Be sure to look at the pictures for how it is formed. Lemon curd is an option to replace the jam. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F629896.jpg", "meta": [["prep:", "45 mins"], ["cook:", "25 mins"], ["additional:", "2 hrs 40 mins"], ["total:", "3 hrs 50 mins"], ["Servings:", "20"], ["Yield:", "2 10-serving loaves"]], "ingredients": ["6 cups all-purpose flour, or more if needed (divided)", "1 tablespoon rapid rise yeast", "½ cup white sugar", "¼ teaspoon salt", "½ cup unsalted butter", "1 ¾ cups milk", "3  eggs, beaten", "1  lemon, zested and juiced", "1  egg yolk", "1 tablespoon water", "½ cup seedless raspberry jam", "1 cup confectioners' sugar"], "direction": ["In a large bowl, whisk together 4 cups of flour, the yeast, white sugar, and salt. In a saucepan over low heat, melt the unsalted butter with the milk until the mixture is warm, about 110 degrees F (43 degrees C). Gradually whisk about 1/3 of the butter-milk mixture into the beaten eggs, then return the egg mixture back into the remaining milk mixture. Stir the lemon zest into the liquid ingredients (set aside lemon juice for later). Pour the liquid ingredients into the flour mixture, and stir until thoroughly combined.", "Add enough flour to make a soft dough; turn the dough out onto a floured surface, and knead until smooth and elastic, 8 to 10 minutes. Place dough into an oiled bowl, and turn the dough around to cover surface lightly with oil. Cover the bowl with plastic wrap, and allow to rise in a warm place until doubled, about 1 hour. Punch down the dough, and allow to rest for 10 minutes.", "Divide the dough in half, and roll each half into a round ball. On a floured surface, roll out a ball into a 12-inch circle. Place a drinking glass, face down, into the center of the circle to prevent cutting the dough too far into the center. Cut the dough with a knife, from the edge of the dough circle to the rim of the glass, into quarters. Cut each quarter into 5 narrow wedge-shaped strips. (Center of the dough is uncut.) Remove the drinking glass. There are 20 narrow wedge-shaped strips surrounding the uncut center of the dough.", "Pick up two adjacent strips, and twist them together about 4 times; pinch the ends of the two pieces together at the top. Gently coil to form a rough flower shape. Arrange the round into the middle of the circle, where the drinking glass was.", "Pick up two more adjacent strips, and twist and pinch them as before; coil them into a rough round, and arrange the new petal next to the center rosette. Repeat with remaining 16 strips, twisting and pinching them in twos, coiling and arranging them into 8 more petals around the center rosette. Finished bread has 9 petals surrounding the center round. Repeat steps with the second ball of dough to make two breads.", "Grease a baking sheet, or line with parchment paper. Place the shaped breads onto the prepared baking sheet, reshaping them into rounds if needed; cover with a clean kitchen towel, and place into a warm spot to rise until almost doubled, 30 to 45 minutes.", "Preheat oven to 375 degrees F (190 degrees C). Beat the egg yolk with water in a small bowl, and brush the mixture over both the breads.", "Bake in the preheated oven until the breads have turned golden brown, about 25 minutes. Allow to cool.", "Use your fingers to gently deepen the indentations in the center of each petal, and fill each with about 1/2 to 1 teaspoon of raspberry jam. Mix the reserved lemon juice and confectioners' sugar in a bowl to form a glaze; drizzle the glaze in thin lines all over both the breads. Allow glaze to set. To serve, pull the petals apart."], "facts": "269 calories; protein 6g 12% DV; carbohydrates 47.3g 15% DV; fat 6.4g 10% DV; cholesterol 52.1mg 17% DV; sodium 50.6mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/222589/simple-deviled-eggs/", "name": "Simple Deviled Eggs", "summary": "\nThe eggs are delicious, and it's easy to make more for larger gatherings. I've added onion and celery for a little more flavor and texture. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999534.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["6  hard-cooked eggs", "2 tablespoons mayonnaise", "1 teaspoon white sugar", "1 teaspoon white vinegar", "1 teaspoon prepared mustard", "½ teaspoon salt", "1 tablespoon finely chopped onion", "1 tablespoon finely chopped celery", "1 pinch paprika, or to taste"], "direction": ["Slice eggs in half lengthwise and remove yolks; set whites aside. Mash yolks with a fork in a small bowl. Stir in mayonnaise, sugar, vinegar, mustard, salt, onion, and celery; mix well. Stuff or pipe egg yolk mixture into egg whites. Sprinkle with paprika. Refrigerate until serving."], "facts": "328 calories; protein 19.3g 39% DV; carbohydrates 4.7g 2% DV; fat 26g 40% DV; cholesterol 563.2mg 188% DV; sodium 902.3mg 36% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/240752/chef-johns-honey-glazed-ham/", "name": "Chef John's Honey-Glazed Ham", "summary": "\nA great holiday ham glaze needs to have three things: wonderful flavor, gorgeous, shiny appearance, and a crispy, crackling crust you can hear across the room. I'm happy to report this easy-to-make glaze has all those things in abundance. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4253848.jpg", "meta": [["prep:", "15 mins"], ["cook:", "2 hrs 35 mins"], ["total:", "2 hrs 50 mins"], ["Servings:", "16"], ["Yield:", "1 glazed ham"]], "ingredients": ["¾ cup water, or as needed", "2  whole star anise", "12  whole cloves, or more to taste", "1 (7 pound) country-style ham", "1 cup firmly packed light brown sugar", "¼ cup honey", "2 tablespoons Dijon mustard", "2 tablespoons rice vinegar", "1 ½ teaspoons freshly ground black pepper", "½ teaspoon Worcestershire sauce", "1 pinch cayenne pepper"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Pour water, star anise, and cloves into the bottom of a roasting pan. Place a roasting rack into the pan over the water, anise, and cloves; place ham on rack. Cut 1/4-inch deep slashes 1/2-inch apart lengthwise and crosswise across the top of the entire ham.", "Bake ham in the preheated oven for 20 minutes. Whisk brown sugar, honey, mustard, vinegar, black pepper, Worcestershire sauce, and cayenne pepper together in a bowl until glaze has a thick, smooth consistency.", "Brush glaze all over ham. Continue baking ham, brushing glaze on every 20 minutes, until glaze is deep golden and ham is heated through, about 2 hours 10 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).", "Use a kitchen torch to heat the glaze on the ham until it is crispy and caramelized, 2 to 5 minutes."], "facts": "455 calories; protein 34g 68% DV; carbohydrates 18.9g 6% DV; fat 26.4g 41% DV; cholesterol 97.3mg 32% DV; sodium 1918.7mg 77% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/7073/hot-cross-buns-i/", "name": "Hot Cross Buns I", "summary": "\nHot cross buns! Hot cross buns! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999636.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 20 mins"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "12 buns"]], "ingredients": ["¾ cup warm water (110 degrees F/45 degrees C)", "3 tablespoons butter", "1 tablespoon instant powdered milk", "¼ cup white sugar", "⅜ teaspoon salt", "1  egg", "1  egg white", "3 cups all-purpose flour", "1 tablespoon active dry yeast", "¾ cup dried currants", "1 teaspoon ground cinnamon", "1  egg yolk", "2 tablespoons water", "½ cup confectioners' sugar", "¼ teaspoon vanilla extract", "2 teaspoons milk"], "direction": ["Put warm water, butter, skim milk powder, 1/4 cup sugar, salt, egg, egg white, flour, and yeast in bread maker and start on dough program.", "When 5 minutes of kneading are left, add currants and cinnamon. Leave in machine till double.", "Punch down on floured surface, cover, and let rest 10 minutes.", "Shape into 12 balls and place in a greased 9 x 12 inch pan. Cover and let rise in a warm place till double, about 35-40 minutes.", "Mix egg yolk and 2 tablespoons water. Brush on balls.", "Bake at 375 degrees F (190 degrees C) for 20 minutes. Remove from pan immediately and cool on wire rack.", "To make crosses: mix together confectioners' sugar, vanilla, and milk. Place glaze in a piping bag or a sandwich bag with the corner snipped off; pipe a cross onto each roll."], "facts": "217 calories; protein 5.2g 10% DV; carbohydrates 40.5g 13% DV; fat 4g 6% DV; cholesterol 40.3mg 13% DV; sodium 108.7mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/45641/roasted-rack-of-lamb/", "name": "Roasted Rack of Lamb", "summary": "\nI have had this recipe for a long time, and always enjoy making it.  You can also do the same thing with beef or pork. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6433140.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 Servings"]], "ingredients": ["½ cup fresh bread crumbs", "2 tablespoons minced garlic", "2 tablespoons chopped fresh rosemary", "1 teaspoon salt", "¼ teaspoon black pepper", "2 tablespoons olive oil", "1 (7 bone) rack of lamb, trimmed and frenched", "1 teaspoon salt", "1 teaspoon black pepper", "2 tablespoons olive oil", "1 tablespoon Dijon mustard"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). Move oven rack to  the center position.", "In a large bowl, combine bread crumbs, garlic, rosemary, 1 teaspoon salt and 1/4 teaspoon pepper. Toss in 2 tablespoons olive oil to moisten mixture. Set aside.", "Season the rack all over with salt and pepper. Heat 2 tablespoons olive oil in a large heavy oven proof skillet over high heat. Sear rack of lamb for 1 to 2 minutes on all sides. Set aside for a few minutes. Brush rack of lamb with the mustard. Roll in the bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring.", "Arrange the rack bone side down in the skillet. Roast the lamb in preheated oven for 12 to 18 minutes, depending on the degree of doneness you want. With a meat thermometer, take a reading in the center of the meat after 10 to 12 minutes and remove the meat, or let it cook longer, to your taste. Let it rest for 5 to 7 minutes, loosely covered, before carving between the ribs."], "facts": "481 calories; protein 22.2g 44% DV; carbohydrates 5.6g 2% DV; fat 40.8g 63% DV; cholesterol 94.1mg 31% DV; sodium 1368.8mg 55% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17244/braided-easter-egg-bread/", "name": "Braided Easter Egg Bread", "summary": "\nThis decorative Easter bread has whole eggs baked into it! Do not cook the whole eggs, as they will bake at the same time that the bread does. The eggs can also be dyed for extra color. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F379973.jpg", "meta": [["prep:", "45 mins"], ["cook:", "30 mins"], ["additional:", "1 hr 45 mins"], ["total:", "3 hrs"], ["Servings:", "10"], ["Yield:", "1 1-pound loaf"]], "ingredients": ["2 ½ cups all-purpose flour, divided", "¼ cup white sugar", "1 teaspoon salt", "1 (.25 ounce) package active dry yeast", "⅔ cup milk", "2 tablespoons butter", "2  eggs", "5  whole eggs, dyed if desired", "2 tablespoons butter, melted"], "direction": ["In a large bowl, combine 1 cup flour, sugar, salt and yeast; stir well. Combine milk and butter in a small saucepan; heat until milk is warm and butter is softened but not melted.", "Gradually add the milk and butter to the flour mixture; stirring constantly. Add two eggs and 1/2 cup flour; beat well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal size rounds; cover and let rest for 10 minutes. Roll each round into a long roll about 36 inches long and 1 1/2 inches thick. Using the two long pieces of dough, form a loosely braided ring, leaving spaces for the five colored eggs. Seal the ends of the ring together and use your fingers to slide the eggs between the braids of dough.", "Preheat oven to 350 degrees F (175 degrees C). Place loaf on a buttered baking sheet and cover loosely with a damp towel. Place loaf in a warm place and let rise until doubled in bulk, about 45 minutes. Brush risen loaf with melted butter.", "Bake in the preheated oven until golden brown, about 30 minutes."], "facts": "234 calories; protein 8.5g 17% DV; carbohydrates 30.1g 10% DV; fat 8.7g 14% DV; cholesterol 143.7mg 48% DV; sodium 321.9mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15810/carrot-pineapple-cake-i/", "name": "Carrot Pineapple Cake I", "summary": "\nThe carrots and pineapple work together to keep this cake moist and wholesome. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2174192.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "24"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking soda", "1 teaspoon baking powder", "1 teaspoon salt", "2 teaspoons ground cinnamon", "1 ¾ cups white sugar", "1 cup vegetable oil", "3  eggs", "1 teaspoon vanilla extract", "2 cups shredded carrots", "1 cup flaked coconut", "1 cup chopped walnuts", "1 (8 ounce) can crushed pineapple, drained", "1 (8 ounce) package cream cheese", "¼ cup butter, softened", "2 cups confectioners' sugar"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.", "Mix flour, baking soda, baking powder, salt and cinnamon.  Make a well in the center and add sugar, oil, eggs and vanilla.  Mix with wooden spoon until smooth.  Stir in carrots, coconut, walnuts and pineapple.", "Pour into 9x13 inch pan. Bake at 350 degrees for about 45 minutes.  Don't panic, the center will sink a little. Allow to cool.", "To make the frosting: Cream the butter and cream cheese until smooth. Add the confectioners sugar and beat until creamy."], "facts": "329 calories; protein 3.6g 7% DV; carbohydrates 37.6g 12% DV; fat 19.1g 30% DV; cholesterol 38.6mg 13% DV; sodium 287.7mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17315/easter-meat-pie/", "name": "Easter Meat Pie", "summary": "\nThis meat pie is a winner every Easter. Stuffed full of ham, salami, and prosciutto, as well as ricotta, Parmesan, and mozzarella cheeses, this pie really satisfies! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4408891.jpg", "meta": [["prep:", "45 mins"], ["cook:", "1 hr"], ["total:", "1 hr 45 mins"], ["Servings:", "12"], ["Yield:", "2 - 9 inch pies"]], "ingredients": ["4 (9 inch)  unbaked pie crusts", "2 pounds ricotta cheese", "6  eggs", "8 ounces mozzarella cheese, grated", "1 pound cooked ham, chopped", "½ pound Genoa salami, chopped", "¼ pound prosciutto, chopped", "¼ cup grated Parmesan cheese"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Place ricotta in a large mixing bowl and add eggs one at a time while mixing on low speed. Stir in mozzarella, ham, salami, and prosciutto until all ingredients are well combined. Line two 9 inch pans with pastry. Spoon half of mixture into each pan. Sprinkle half of the Parmesan cheese over each pie, then cover with top pastry. Crimp edges and cut steam vents in tops.", "Bake in preheated oven for 1 hour, until crust is golden brown. Cool on racks."], "facts": "727 calories; protein 33.8g 68% DV; carbohydrates 31.2g 10% DV; fat 51.4g 79% DV; cholesterol 193.6mg 65% DV; sodium 1601.6mg 64% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/153459/easter-buttermilk-hot-cross-buns/", "name": "Easter Buttermilk Hot Cross Buns", "summary": "\nThese are a family tradition for Easter brunch. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1121946.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["additional:", "1 hr 45 mins"], ["total:", "2 hrs 20 mins"], ["Servings:", "18"], ["Yield:", "18 buns"]], "ingredients": ["½ cup water", "1 (.25 ounce) package active dry yeast", "1 cup buttermilk, room temperature", "2 tablespoons white sugar", "½ teaspoon baking soda", "1 teaspoon salt", "1 teaspoon ground cinnamon", "⅓ cup margarine, melted", "3 ¼ cups all-purpose flour", "⅔ cup raisins", "½ (16 ounce) container prepared vanilla frosting"], "direction": ["Measure the water into a large bowl and sprinkle the yeast over the top. Let stand about 5 minutes to dissolve the yeast. Stir in the buttermilk, sugar, baking soda, salt, cinnamon and margarine. Mix in 1 cup of flour until well blended, then stir in the raisins. Gradually mix in the remaining flour until the dough is stiff enough to take out of the bowl and knead on a floured surface. Knead the dough until smooth and elastic, about 5 minutes. Place in a greased bowl, turning to coat and cover with a towel. Let rise in a warm place until doubled in size, about 1 hour.", "Turn the dough out onto a floured surface and divide into 18 pieces. Shape each piece into a ball and place in a greased 9x13 inch baking dish. Cover loosely with a towel and allow to rise again until your finger leaves an impression when you poke the dough gently, about 45 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Remove the towel from the buns. Bake in the preheated oven until golden brown, about 20 minutes. Spoon the frosting into a small sandwich bag or pastry bag. Snip off the corner and squeeze out frosting to make a cross on top of the buns when cool."], "facts": "194 calories; protein 3.2g 6% DV; carbohydrates 32.8g 11% DV; fat 5.7g 9% DV; cholesterol 0.5mg; sodium 241.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/70660/chocolate-covered-easter-eggs/", "name": "Chocolate Covered Easter Eggs", "summary": "\nThis is a great recipe that you can add different ingredients to that will make 4 different kind of eggs...all yummy.  I always get tons of compliments when I make these. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2188092.jpg", "meta": [["prep:", "30 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "48"], ["Yield:", "3 pounds candy"]], "ingredients": ["½ cup butter, softened", "1 teaspoon vanilla extract", "1 (8 ounce) package cream cheese, softened", "2 ½ pounds confectioners' sugar", "1 cup creamy peanut butter  (Optional)", "1 cup flaked coconut  (Optional)", "1 cup unsweetened cocoa powder  (Optional)", "2 cups semisweet chocolate pieces", "1 tablespoon shortening or vegetable oil  (Optional)"], "direction": ["In a large bowl, mix together the butter, vanilla, and cream cheese. Stir in confectioners' sugar to make a workable dough. For best results, use your hands for mixing.", "Divide the dough into four parts. Leave one of the parts plain. To the second part, mix in peanut butter. Mix coconut into the third part, and cocoa powder into the last part. Roll each type of dough into egg shapes, and place on a waxed paper-lined cookie sheet. Refrigerate until hard, at least an hour.", "Melt chocolate chips in a heat-proof bowl over a pan of simmering water. Stir occasionally until smooth. If the chocolate seems too thick for coating, stir in a teaspoon of the shortening or oil until it thins to your desired consistency. Dip the chilled candy eggs in chocolate, and return to the waxed paper lined sheet to set. Refrigerate for 1/2 hour to harden."], "facts": "204 calories; protein 2.4g 5% DV; carbohydrates 30.9g 10% DV; fat 9.3g 14% DV; cholesterol 10.2mg 3% DV; sodium 57.9mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/221109/aunt-connies-coconut-cake/", "name": "Aunt Connie's Coconut Cake", "summary": "\nAunt Connie made this cake for special occasions. It is as wonderful as she was, and I remember her every time I make it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1030817.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 50 mins"], ["Servings:", "16"], ["Yield:", "1 10-inch tube cake"]], "ingredients": ["3 cups all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking soda", "1 ½ cups butter, softened", "3 cups white sugar", "6  eggs", "1 cup sour cream", "1 teaspoon vanilla extract", "1 (7 ounce) package sweetened flaked coconut", "1 cup milk", "2 tablespoons cornstarch", "1 cup white sugar", "½ cup butter, softened", "½ cup solid vegetable shortening", "2 teaspoons vanilla extract", "½ (7 ounce) package sweetened flaked coconut"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Grease a 10-inch tube pan.", "Combine flour, salt, and baking soda in a bowl.", "Beat 1 1/2 cup butter and 3 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color.", "Beat eggs one at a time into butter mixture, allowing each egg to blend completely before adding the next. Beat in sour cream and 1 teaspoon vanilla extract with the last egg.", "Gradually stir flour mixture into egg mixture, mixing until just incorporated.", "Fold in 7 ounces flaked coconut, mixing just enough to evenly combine. Pour the batter into prepared pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 90 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.", "Whisk milk and cornstarch in a saucepan over medium heat until mixture becomes very thick, stirring constantly, about 5 minutes; set aside to cool completely.", "Beat 1 cup sugar, 1/2 cup butter, and shortening with an electric mixer in a bowl until mixture is smooth and creamy.", "Beat cooled milk paste and 2 teaspoons vanilla extract into sugar mixture to achieve a light and creamy frosting.", "Spread frosting over completely cooled cake and sprinkle remaining 3 1/2 ounces flaked coconut over the frosting."], "facts": "694 calories; protein 6.6g 13% DV; carbohydrates 79.9g 26% DV; fat 40g 62% DV; cholesterol 138.3mg 46% DV; sodium 312.6mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12562/torta-rustica/", "name": "Torta Rustica", "summary": "\nThis savory pie is served at room temperature. Two teaspoons dried basil may be substituted for fresh basil. Use ham or prosciutto ham. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F626474.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["2 ¼ cups all-purpose flour", "¾ cup cornmeal", "½ teaspoon salt", "¾ cup butter, diced", "2  eggs", "4 tablespoons cold water", "1 ½ cups ricotta cheese", "4 ounces feta cheese", "1 cup grated Parmesan cheese", "1  egg", "¼ cup chopped parsley", "2 tablespoons chopped fresh basil", "2 teaspoons chopped fresh oregano", "2 cups shredded mozzarella cheese", "½ pound ham slices", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "½ (16 ounce) jar roasted red peppers, drained and patted dry", "1  egg"], "direction": ["Mix flour, cornmeal, and salt in a bowl.  Cut in butter with pastry blender until mixture resembles coarse crumbs.  Beat 2 eggs with 3 tablespoons cold water; stir into flour mixture until dough holds together.  Add another tablespoon water if needed.  Shape 2/3 of the dough into flattened round; repeat with remaining 1/3.  Wrap.  Refrigerate at least 30 minutes, or until firm enough to roll.", "In another bowl, combine ricotta cheese, crumbled feta, Parmesan cheese, 1 egg, parsley, basil, and oregano until well blended.", "Have an 8 or 9 inch springform pan ready.  On a lightly floured surface, roll out the larger portion of dough into a 15 inch diameter circle.  Carefully place in ungreased pan;  press lightly against bottom and sides.  Trim overhanging dough to 1 inch from pan rim.", "Scatter half of the mozzarella over the bottom of the crust. Next arrange half the ham slices in an even layer. Spread with ricotta cheese mixture, then sprinkle with spinach.  Cover with the remaining ham slices.  Press down gently to pack layers.  Add red peppers in a single layer, and  top with the remaining mozzarella. Press down again.", "Roll out remaining dough to 8 or 9 inch circle.  Place over filling to cover.  Moisten edges, and seal crusts together.  Crimp or flute edges.  Crust should not extend above pan rim.  Beat remaining egg, and brush over the crust.  Cut several small vents in top crust for steam to escape.", "Bake at 375 degrees F (190 degrees C) for 1 hour, or until crust is deep golden brown and pulls away from sides.  Cool in pan on wire rack 45 minutes.  Remove pan sides; cool completely.  Cut into 12 wedges.  Serve at room temperature."], "facts": "589 calories; protein 26.4g 53% DV; carbohydrates 41.7g 13% DV; fat 35.5g 55% DV; cholesterol 198.5mg 66% DV; sodium 1293.8mg 52% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/241834/oven-roasted-sweet-potatoes/", "name": "Oven Roasted Sweet Potatoes", "summary": "\nMy Granny made this for Easter dinner. We were all sitting at the table commenting on how delicious it was. She sat down took a bite and sighed, Ahhh, I'll never make this again.  We all told her she was crazy and asked for the recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4540048.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups chopped peeled sweet potato", "1  sweet onions (such as Vidalia®), cut into wedges", "2 cloves garlic, sliced", "3 tablespoons olive oil", "1 tablespoon balsamic vinegar, or more to taste", "1 pinch salt and ground black pepper to taste"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Mix sweet potatoes, sweet onion, and garlic in a bowl. Drizzle olive oil over the mixture and toss to coat; pour into a shallow roasting pan.", "Roast sweet potato mixture in preheated oven, turning frequently, until the vegetables are soft and golden brown, 30 to 35 minutes. Drizzle balsamic vinegar over the vegetables; season with salt and pepper."], "facts": "224 calories; protein 2.6g 5% DV; carbohydrates 31.3g 10% DV; fat 10.2g 16% DV; cholesterol 0mg; sodium 114.8mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12963/greek-lemon-chicken-soup/", "name": "Greek Lemon Chicken Soup", "summary": "\nThis soup is perfect as an introduction to a full Greek meal, or a hearty bowlful for a meal in itself.  Serve with fresh pita triangles, and you'll be sure to please your guests!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5795826.jpg", "meta": [["prep:", "25 mins"], ["cook:", "40 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["8 cups chicken broth", "½ cup fresh lemon juice", "½ cup shredded carrots", "½ cup chopped onion", "½ cup chopped celery", "6 tablespoons chicken soup base", "¼ teaspoon ground white pepper", "¼ cup margarine", "¼ cup all-purpose flour", "1 cup cooked white rice", "1 cup diced, cooked chicken meat", "16 slices  lemon", "8  egg yolks"], "direction": ["In a large pot, combine the chicken broth, lemon juice, carrots, onions, celery, soup base, and white pepper. Bring to a boil on high, then simmer for 20 minutes.", "Blend the butter and the flour together. Then gradually add it to the soup mixture. Simmer for 10 minutes more, stirring frequently.", "Meanwhile, beat the egg yolks until light in color. Gradually add some of the hot soup to the egg yolks, stirring constantly. Return the egg mixture to the soup pot and heat through. Add the rice and chicken. Ladle hot soup into bowls and garnish with lemon slices."], "facts": "124 calories; protein 7.8g 16% DV; carbohydrates 9.1g 3% DV; fat 6.6g 10% DV; cholesterol 110.3mg 37% DV; sodium 1236.8mg 50% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/36927/rosemary-braised-lamb-shanks/", "name": "Rosemary Braised Lamb Shanks", "summary": "\nLamb shanks are slowly simmered with fresh rosemary, garlic, tomatoes, and red wine. Great served with polenta, or my family's favorite--roasted garlic mashed potatoes--as you need something to soak up the wonderful sauce. A fantastic dish for company, as all the prep work is done at the beginning, and then you just have to wait. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5493417.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  lamb shanks", "salt and pepper to taste", "2 tablespoons olive oil", "2  onions, chopped", "3 large carrots, cut into 1/4 inch rounds", "10 cloves garlic, minced", "1 (750 milliliter) bottle red wine", "1 (28 ounce) can whole peeled tomatoes with juice", "1 (10.5 ounce) can condensed chicken broth", "1 (10.5 ounce) can beef broth", "5 teaspoons chopped fresh rosemary", "2 teaspoons chopped fresh thyme"], "direction": ["Sprinkle shanks with salt and pepper. Heat oil in heavy large pot or Dutch oven over medium-high heat. Working in batches, cook shanks until brown on all sides, about 8 minutes. Transfer shanks to plate.", "Add onions, carrots and garlic to pot and saute until golden brown, about 10 minutes. Stir in wine, tomatoes, chicken broth and beef broth. Season with rosemary and thyme. Return shanks to pot, pressing down to submerge. Bring to a boil, then reduce heat to medium-low.  Cover, and simmer until meat is tender, about 2 hours.", "Remove cover from pot. Simmer about 20 minutes longer. Transfer shanks to platter, place in a warm oven. Boil juices in pot until thickened, about 15 minutes.  Spoon over shanks."], "facts": "481 calories; protein 30.3g 61% DV; carbohydrates 17.6g 6% DV; fat 21.8g 34% DV; cholesterol 92.7mg 31% DV; sodium 758.7mg 30% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/18990/banana-pudding-i/", "name": "Banana Pudding I", "summary": "\nThis is a recipe that's been handed down from my grandmother. My whole family loves it and we all grew up on it!  Hope you enjoy it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1121232.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["⅔ cup white sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "3  eggs, beaten", "2 cups milk", "½ teaspoon vanilla extract", "2 tablespoons butter, softened", "2  bananas, peeled and sliced", "½ (12 ounce) package vanilla wafer cookies"], "direction": ["In medium saucepan combine sugar, flour, and salt. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly. When mixture begins to thicken, remove from heat and continue to stir, cooling slightly. Stir in vanilla and butter until smooth.", "Layer pudding with bananas and vanilla wafers in a serving dish. Chill at least one hour in refrigerator before serving."], "facts": "666 calories; protein 13.9g 28% DV; carbohydrates 91.1g 29% DV; fat 28.2g 43% DV; cholesterol 505.4mg 169% DV; sodium 381.8mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/9999/peanut-butter-bars-i/", "name": "Peanut Butter Bars I", "summary": "\nThese peanut butter bars taste just like peanut butter cups. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548869.jpg", "meta": [["prep:", "25 mins"], ["additional:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 - 9x13 inch pan"]], "ingredients": ["1 cup butter or margarine, melted", "2 cups graham cracker crumbs", "2 cups confectioners' sugar", "1 cup peanut butter", "1 ½ cups semisweet chocolate chips", "4 tablespoons peanut butter"], "direction": ["In a medium bowl, mix together the butter or margarine, graham cracker crumbs, confectioners' sugar, and 1 cup peanut butter until well blended. Press evenly into the bottom of an ungreased 9x13 inch pan.", "In a metal bowl over simmering water, or in the microwave, melt the chocolate chips with the 4 tablespoons peanut butter, stirring occasionally until smooth. Spread over the prepared crust. Refrigerate for at least one hour before cutting into squares."], "facts": "532 calories; protein 8.8g 18% DV; carbohydrates 49.2g 16% DV; fat 36.6g 56% DV; cholesterol 40.7mg 14% DV; sodium 319.7mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/109297/cedar-planked-salmon/", "name": "Cedar Planked Salmon", "summary": "\nThis is a dish my brother prepared for me in Seattle. It is by far the best salmon I've ever eaten. I like to serve it with an Asian-inspired rice and roasted asparagus. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2609651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 (12 inch) untreated cedar planks", "⅓ cup vegetable oil", "1 ½ tablespoons rice vinegar", "1 teaspoon sesame oil", "⅓ cup soy sauce", "¼ cup chopped green onions", "1 tablespoon grated fresh ginger root", "1 teaspoon minced garlic", "2 (2 pound) salmon fillets, skin removed"], "direction": ["Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time.", "In a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour.", "Preheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little.", "Place the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill."], "facts": "678 calories; protein 61.3g 123% DV; carbohydrates 1.7g 1% DV; fat 45.8g 70% DV; cholesterol 178.6mg 60% DV; sodium 981.2mg 39% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/147103/delicious-egg-salad-for-sandwiches/", "name": "Delicious Egg Salad for Sandwiches", "summary": "\nThis is a wonderful-tasting egg salad sandwich that you will definitely devour. It's really good on rye. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F191517.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "10 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  eggs", "½ cup mayonnaise", "1 teaspoon prepared yellow mustard", "¼ cup chopped green onion", "salt and pepper to taste", "¼ teaspoon paprika"], "direction": ["Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.", "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."], "facts": "344 calories; protein 13g 26% DV; carbohydrates 2.3g 1% DV; fat 31.9g 49% DV; cholesterol 382.5mg 128% DV; sodium 350.6mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/", "name": "Creamy Au Gratin Potatoes", "summary": "\nThis is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F738814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  russet potatoes, sliced into 1/4 inch slices", "1  onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "½ teaspoon salt", "2 cups milk", "1 ½ cups shredded Cheddar cheese"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.", "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.", "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.", "Bake 1 1/2 hours in the preheated oven."], "facts": "499 calories; protein 19.8g 40% DV; carbohydrates 49.3g 16% DV; fat 25.4g 39% DV; cholesterol 77.2mg 26% DV; sodium 683.4mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/87013/hash-brown-and-egg-casserole/", "name": "Hash Brown and Egg Casserole", "summary": "\nThis is my family's recipe that has been handed down through the years.  We've always used the maple flavored pork sausage but any kind is good.  This casserole is a nice and cozy breakfast or brunch meal that everyone will enjoy.  It's got the perfect taste with lots of cheese. Yum! Be sure to use a baking dish that is deep enough to cover with aluminum foil. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2331971.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["additional:", "5 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "1 - 8x8 inch casserole"]], "ingredients": ["1 (2 pound) package frozen hash brown potatoes, thawed", "1 pound pork sausage", "1 small onion, diced", "5  eggs", "½ cup milk", "½ teaspoon onion powder", "⅛ teaspoon garlic powder", "salt and ground black pepper to taste", "12 ounces shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.", "Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.", "Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."], "facts": "616 calories; protein 33.5g 67% DV; carbohydrates 30.4g 10% DV; fat 48.9g 75% DV; cholesterol 259.5mg 87% DV; sodium 1141.7mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/15093/grandmas-lemon-meringue-pie/", "name": "Grandma's Lemon Meringue Pie", "summary": "\nThis is a very fun recipe to follow, because Grandma makes it sweet and simple. This pie is thickened with cornstarch and flour in addition to egg yolks, and contains no milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672049.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 cup white sugar", "2 tablespoons all-purpose flour", "3 tablespoons cornstarch", "¼ teaspoon salt", "1 ½ cups water", "2  lemons, juiced and zested", "2 tablespoons butter", "4  egg yolks, beaten", "1 (9 inch) pie crust, baked", "4  egg whites", "6 tablespoons white sugar"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "To Make Lemon Filling: In a medium saucepan, whisk together 1 cup sugar, flour, cornstarch, and salt. Stir in water, lemon juice and lemon zest. Cook over medium-high heat, stirring frequently, until mixture comes to a boil. Stir in butter. Place egg yolks in a small bowl and gradually whisk in 1/2 cup of hot sugar mixture. Whisk egg yolk mixture back into remaining sugar mixture. Bring to a boil and continue to cook while stirring constantly until thick. Remove from heat. Pour filling into baked pastry shell.", "To Make Meringue: In a large glass or metal bowl, whip egg whites until foamy. Add sugar gradually, and continue to whip until stiff peaks form. Spread meringue over pie, sealing the edges at the crust.", "Bake in preheated oven for 10 minutes, or until meringue is golden brown."], "facts": "298 calories; protein 4.4g 9% DV; carbohydrates 49.7g 16% DV; fat 10.3g 16% DV; cholesterol 110.1mg 37% DV; sodium 229.2mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/7402/carrot-cake-iii/", "name": "Carrot Cake III", "summary": "\nI've tried many carrot cakes, and this is my favorite recipe. If you don't like pecans, feel free to leave them out. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F26%2F1053595-Carrot-Cake-III-7402-sarah-2000.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "30 mins"], ["total:", "2 hrs"], ["Servings:", "18"], ["Yield:", "1 - 9x13 inch cake"]], "ingredients": ["4  eggs", "1 ¼ cups vegetable oil", "2 cups white sugar", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons baking powder", "½ teaspoon salt", "2 teaspoons ground cinnamon", "3 cups grated carrots", "1 cup chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Grease and flour a 9x13 inch pan.", "In a large bowl, beat together eggs, oil, white sugar and 2 teaspoons vanilla. Mix in flour, baking soda, baking powder, salt and cinnamon. Stir in carrots. Fold in pecans.  Pour into prepared pan.", "Bake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.", "To Make Frosting:  In a medium bowl, combine butter, cream cheese, confectioners' sugar and 1 teaspoon vanilla. Beat until the mixture is smooth and creamy. Stir in chopped pecans. Frost the cooled cake."], "facts": "575 calories; protein 5.1g 10% DV; carbohydrates 63.7g 21% DV; fat 34.8g 54% DV; cholesterol 68.8mg 23% DV; sodium 347.2mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/240290/moms-scalloped-potatoes/", "name": "Mom's Scalloped Potatoes", "summary": "\nThis is the way my mother always made her scalloped potatoes. The measurements are taken from other recipes because she always just winged it, but the method is the same. The key is to heat the milk first! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1883772.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds potatoes, thinly sliced", "½  onion, thinly sliced", "9 tablespoons all-purpose flour, divided", "6 tablespoons butter, diced and divided", "salt and ground black pepper to taste", "3 cups whole milk, or as needed"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.", "Spread about 1/3 of the potato slices into the bottom of the prepared baking dish. Top with about 1/3 of the onion slices. Sprinkle 3 tablespoons flour over the potato and onion. Arrange 2 tablespoons butter atop the flour. Season the entire layer with salt and pepper. Repeat layering twice more.", "Heat milk in a saucepan until warm. Pour enough warm milk over the mixture in the baking dish so the top of the liquid is level with the final layer of potatoes.", "Bake in preheated oven until potatoes are tender, 45 to 60 minutes."], "facts": "396 calories; protein 9.9g 20% DV; carbohydrates 55g 18% DV; fat 15.8g 24% DV; cholesterol 42.7mg 14% DV; sodium 170.7mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/17393/best-carrot-cake-ever/", "name": "Best Carrot Cake Ever", "summary": "\nA moist and flavorful recipe that makes a large quantity of cake. I have been hounded to make this cake time and time again. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3605684.jpg", "meta": [["prep:", "1 hr 30 mins"], ["cook:", "1 hr"], ["total:", "2 hrs 30 mins"], ["Servings:", "16"], ["Yield:", "2 - 10 inch round layers"]], "ingredients": ["6 cups grated carrots", "1 cup brown sugar", "1 cup raisins", "4  eggs", "1 ½ cups white sugar", "1 cup vegetable oil", "2 teaspoons vanilla extract", "1 cup crushed pineapple, drained", "3 cups all-purpose flour", "1 ½ teaspoons baking soda", "1 teaspoon salt", "4 teaspoons ground cinnamon", "1 cup chopped walnuts"], "direction": ["In a medium bowl, combine grated carrots and brown sugar. Set aside for 60 minutes, then stir in raisins.", "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 10 inch cake pans.", "In a large bowl, beat eggs until light. Gradually beat in the white sugar, oil and vanilla. Stir in the pineapple. Combine the flour, baking soda, salt and cinnamon, stir into the wet mixture until absorbed. Finally stir in the carrot mixture and the walnuts. Pour evenly into the prepared pans.", "Bake for 45 to 50 minutes in the preheated oven, until cake tests done with a toothpick. Cool for 10 minutes before removing from pan. When completely cooled, frost with cream cheese frosting."], "facts": "457 calories; protein 5.9g 12% DV; carbohydrates 66.3g 21% DV; fat 20.2g 31% DV; cholesterol 46.5mg 16% DV; sodium 315.2mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/18417/spanakopita-greek-spinach-pie/", "name": "Spanakopita (Greek Spinach Pie)", "summary": "\nThis is an authentic, really rich pie stuffed with spinach, onions, cheeses and herbs that are all enfolded by crispy, flaky phyllo dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F754051.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "5"], ["Yield:", "1 - 9x9 inch pan"]], "ingredients": ["3 tablespoons olive oil", "1 large onion, chopped", "1 bunch green onions, chopped", "2 cloves garlic, minced", "2 pounds spinach, rinsed and chopped", "½ cup chopped fresh parsley", "2  eggs, lightly beaten", "½ cup ricotta cheese", "1 cup crumbled feta cheese", "8 sheets phyllo dough", "¼ cup olive oil"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x9 inch square baking pan.", "Heat 3 tablespoons olive oil in a large skillet over medium heat. Saute onion, green onions and garlic, until soft and lightly browned. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from heat and set aside to cool.", "In a medium bowl, mix together eggs, ricotta, and feta. Stir in spinach mixture. Lay 1 sheet of phyllo dough in prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top, brush with olive oil, and repeat process with two more sheets of phyllo. The sheets will overlap the pan. Spread spinach and cheese mixture into pan and fold overhanging dough over filling. Brush with oil, then layer remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into pan to seal filling.", "Bake in preheated oven for 30 to 40 minutes, until golden brown. Cut into squares and serve while hot."], "facts": "494 calories; protein 18.2g 36% DV; carbohydrates 31.5g 10% DV; fat 34.7g 53% DV; cholesterol 100.3mg 33% DV; sodium 893.9mg 36% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12481/old-fashioned-coconut-cream-pie/", "name": "Old Fashioned Coconut Cream Pie", "summary": "\nThis is a tried-and-true, old-fashioned coconut cream pie. Took many years of searching and baking to find the right one and this is it! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4899464.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 50 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 cup sweetened flaked coconut", "3 cups half-and-half", "2  eggs, beaten", "¾ cup white sugar", "½ cup all-purpose flour", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 (9 inch) pie shell, baked", "1 cup frozen whipped topping, thawed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Spread the coconut on a baking sheet and bake it, stirring occasionally, until golden brown, about 5 minutes.", "In a medium saucepan, combine the half-and-half, eggs, sugar, flour and salt and mix well. Bring to a boil over low heat, stirring constantly. Cook, stirring constantly, for 2 minutes more. Remove the pan from the heat, and stir in 3/4 cup of the toasted coconut and the vanilla extract. Reserve the remaining coconut to top the pie.", "Pour the filling into the pie shell and chill until firm, about 4 hours.", "Top with whipped topping and with the reserved coconut."], "facts": "423 calories; protein 6.8g 14% DV; carbohydrates 46.1g 15% DV; fat 23.5g 36% DV; cholesterol 80.1mg 27% DV; sodium 275.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/20876/crustless-spinach-quiche/", "name": "Crustless Spinach Quiche", "summary": "\nI serve this in the summer for brunch with a side of sausage links and a fresh fruit bowl! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F451789.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1  onion, chopped", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "5  eggs, beaten", "3 cups shredded Muenster cheese", "¼ teaspoon salt", "⅛ teaspoon ground black pepper"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie pan.", "Heat oil in a large skillet over medium-high heat. Add onions and cook, stirring occasionally, until onions are soft. Stir in spinach and continue cooking until excess moisture has evaporated.", "In a large bowl, combine eggs, cheese, salt and pepper. Add spinach mixture and stir to blend. Scoop into prepared pie pan.", "Bake in preheated oven until eggs have set, about 30 minutes. Let cool for 10 minutes before serving."], "facts": "310 calories; protein 20.4g 41% DV; carbohydrates 4.8g 2% DV; fat 23.7g 36% DV; cholesterol 209.2mg 70% DV; sodium 545.6mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/21461/ooey-gooey-cinnamon-buns/", "name": "Ooey-Gooey Cinnamon Buns", "summary": "\nThese buns are sooo good hot from the oven when they're gooey and warm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F353408.jpg", "meta": [["prep:", "2 hrs 30 mins"], ["cook:", "30 mins"], ["total:", "3 hrs"], ["Servings:", "15"], ["Yield:", "15 servings"]], "ingredients": ["1 teaspoon white sugar", "1 (.25 ounce) package active dry yeast", "½ cup warm water (110 degrees F/45 degrees C)", "½ cup milk", "¼ cup white sugar", "¼ cup butter", "1 teaspoon salt", "2  eggs, beaten", "4 cups all-purpose flour", "¾ cup butter", "¾ cup brown sugar", "1 cup chopped pecans, divided", "¾ cup brown sugar", "1 tablespoon ground cinnamon", "¼ cup melted butter"], "direction": ["In a small bowl, dissolve  1 teaspoon sugar and yeast in warm water. Let stand until creamy, about 10 minutes. Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in 1/4 cup sugar, 1/4 cup butter and salt; stir until melted. Let cool until lukewarm.", "In a large bowl, combine the yeast mixture, milk mixture, eggs and 1 1/2 cup flour; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.", "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.", "While dough is rising, melt 3/4 cup butter in a small saucepan over medium heat. Stir in 3/4 cup brown sugar, whisking until smooth. Pour into greased 9x13 inch baking pan. Sprinkle bottom of pan with 1/2 cup pecans; set aside. Melt remaining butter; set aside. Combine remaining 3/4 cup brown sugar, 1/2 cup pecans, and cinnamon; set aside.", "Turn dough out onto a lightly floured surface, roll  into an 18x14 inch rectangle. Brush with 2 tablespoons melted butter, leaving 1/2 inch border uncovered; sprinkle with brown sugar cinnamon mixture. Starting at long side, tightly roll up, pinching seam to seal. Brush with remaining 2 tablespoons butter. With serrated knife, cut into 15 pieces; place cut side down, in prepared pan. Cover and let rise for 1 hour or until doubled in volume. Meanwhile, preheat oven to 375 degrees F (190 degrees C).", "Bake in preheated oven for 25 to 30 minutes, until golden brown. Let cool in pan for 3 minutes, then invert onto serving platter. Scrape remaining filling from the pan onto the rolls."], "facts": "392 calories; protein 5.6g 11% DV; carbohydrates 45.3g 15% DV; fat 21.7g 34% DV; cholesterol 66.1mg 22% DV; sodium 281.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/", "name": "Macaron (French Macaroon)", "summary": "\nThis is the quintessential macaron (NOT macaroon) recipe. I am a baker's apprentice, and after much trial and error, we (the baker and I) finally perfected the technique. We decided to share with you all. Pipe your choice of filling on a cookie and sandwich another cookie on top. These are like cloud cookie sandwiches and are delicious if done correctly.  If you want to do it the super-easy way, just fill with your favorite flavor of frosting. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7426387.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "16 macarons"]], "ingredients": ["3  egg whites", "¼ cup white sugar", "1 ⅔ cups confectioners' sugar", "1 cup finely ground almonds"], "direction": ["Line a baking sheet with a silicone baking mat.", "Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until whites are foamy; beat in white sugar and continue beating until egg whites are glossy, fluffy, and hold soft peaks. Sift confectioners' sugar and ground almonds in a separate bowl and quickly fold the almond mixture into the egg whites, about 30 strokes.", "Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold the batter a few more times and retest.", "When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe the batter onto the baking sheet in rounds, leaving space between the disks. Let the piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour.", "Preheat oven to 285 degrees F (140 degrees C).", "Bake cookies until set but not browned, about 10 minutes; let cookies cool completely before filling."], "facts": "190 calories; protein 6.9g 14% DV; carbohydrates 36.4g 12% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 22mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/219721/rich-and-creamy-potatoes-au-gratin/", "name": "Rich and Creamy Potatoes Au Gratin", "summary": "\nThese are the easiest, creamiest potatoes au gratin I have ever had... YUM! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F810946.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes, peeled and very thinly sliced", "3 cloves garlic, minced", "¾ teaspoon salt", "1 cup heavy cream, divided", "freshly ground black pepper to taste", "freshly grated nutmeg to taste", "2 cups freshly shredded Gruyere cheese, divided"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place potatoes, garlic, and salt into a large pot, fill with enough water to cover, and bring to a boil. Reduce heat to medium, and simmer the potatoes until tender but not mushy, 8 to 10 minutes. With a slotted spoon, transfer about half the potatoes to a 9x13-inch baking dish.", "Pour half of the cream over the potatoes, season with black pepper and nutmeg, and sprinkle half of the Gruyere cheese onto the mixture. Top with the remaining potatoes; sprinkle again with black pepper and nutmeg. Pour on the remaining cream, and sprinkle with remaining Gruyere cheese.", "Bake in the preheated oven until the cheese topping is crisp and brown on top, about 1 hour."], "facts": "352 calories; protein 12.3g 25% DV; carbohydrates 32.1g 10% DV; fat 20g 31% DV; cholesterol 70.5mg 24% DV; sodium 330.5mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/12151/banana-cream-pie-i/", "name": "Banana Cream Pie I", "summary": "\nBanana Cream Pie is one of the yummiest things on earth and this is a great one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3355919.jpg", "meta": [["prep:", "30 mins"], ["cook:", "12 mins"], ["additional:", "1 hr"], ["total:", "1 hr 42 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["¾ cup white sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "2 cups milk", "3  egg yolks, beaten", "2 tablespoons butter", "1 ¼ teaspoons vanilla extract", "1 (9 inch) baked pastry shell, cooled", "4  bananas, sliced"], "direction": ["In a saucepan, combine the sugar, flour, and salt.  Add milk in gradually while stirring gently.  Cook over medium heat, stirring constantly, until the mixture is bubbly.  Keep stirring and cook for about 2 more minutes, and then remove from the burner.", "Stir a small quantity of the hot mixture into the beaten egg yolks, and immediately add egg yolk mixture to the rest of the hot mixture.  Cook for 2 more minutes; remember to keep stirring.  Remove the mixture from the stove, and add butter and vanilla.  Stir until the whole thing has a smooth consistency.", "Slice bananas into the cooled baked pastry shell.  Top with pudding mixture.", "Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes.  Chill for an hour."], "facts": "303 calories; protein 4.9g 10% DV; carbohydrates 47.2g 15% DV; fat 11.1g 17% DV; cholesterol 89.3mg 30% DV; sodium 223.8mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/16664/spinach-quiche/", "name": "Spinach Quiche", "summary": "\nLet me start by saying that I devised this recipe myself, and I just sort of add 'this and that.' This recipe is VERY forgiving, so you can add or remove ingredients according to your taste! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2144550.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "1 - 9 inch quiche"]], "ingredients": ["½ cup butter", "3 cloves garlic, chopped", "1 small onion, chopped", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "1 (4.5 ounce) can mushrooms, drained", "1 (6 ounce) package herb and garlic feta, crumbled", "1 (8 ounce) package shredded Cheddar cheese", "salt and pepper to taste", "1 (9 inch) unbaked deep dish pie crust", "4  eggs, beaten", "1 cup milk", "salt and pepper to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "In a medium skillet, melt butter over medium heat. Saute garlic and onion in butter until lightly browned, about 7 minutes. Stir in spinach, mushrooms, feta and 1/2  cup Cheddar cheese. Season with salt and pepper. Spoon mixture into pie crust.", "In a medium bowl, whisk together eggs and milk. Season with salt and pepper. Pour into the pastry shell, allowing egg mixture to thoroughly combine with spinach mixture.", "Bake in preheated oven for 15 minutes. Sprinkle top with remaining Cheddar cheese, and bake an additional 35 to 40 minutes, until set in center. Allow to stand 10 minutes before serving."], "facts": "613 calories; protein 22.9g 46% DV; carbohydrates 23.9g 8% DV; fat 48.2g 74% DV; cholesterol 232mg 77% DV; sodium 1155.1mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/25202/beef-stroganoff-iii/", "name": "Beef Stroganoff III", "summary": "\nI have been making this recipe for over 20 years. This can be served over either rice or noodles. A little work but worth the effort. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F795486.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "8"], ["Yield:", "6 to 8 servings"]], "ingredients": ["2 pounds beef chuck roast", "½ teaspoon salt", "½ teaspoon ground black pepper", "4 ounces butter", "4  green onions, sliced (white parts only)", "4 tablespoons all-purpose flour", "1 (10.5 ounce) can condensed beef broth", "1 teaspoon prepared mustard", "1 (6 ounce) can sliced mushrooms, drained", "⅓ cup sour cream", "⅓ cup white wine", "salt to taste", "ground black pepper to taste"], "direction": ["Remove any fat and gristle from the roast and cut into strips 1/2 inch thick by 2 inches long. Season with 1/2 teaspoon of both salt and pepper.", "In a large skillet over medium heat, melt the butter and brown the beef strips quickly, then push the beef strips off to one side. Add the onions and cook slowly for 3 to 5 minutes, then push to the side with the beef strips.", "Stir the flour into the juices on the empty side of the pan. Pour in beef broth and bring to a boil, stirring constantly. Lower the heat and stir in mustard. Cover and simmer for 1 hour or until the meat is tender.", "Five minutes before serving, stir in the mushrooms, sour cream, and white wine. Heat briefly then salt and pepper to taste."], "facts": "304 calories; protein 16.6g 33% DV; carbohydrates 5.7g 2% DV; fat 23g 35% DV; cholesterol 82.8mg 28% DV; sodium 619.5mg 25% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/216759/the-perfect-cinnamon-roll-icing/", "name": "The Perfect Cinnamon Roll Icing", "summary": "\nAfter testing many recipes for cinnamon rolls I found that just about any home-made roll can be good if you have the right icing.  In too many recipes the cream cheese flavor overpowers the icing.  Use this recipe for decadent cream cheese icing on your favorite cinnamon roll and you won't be disappointed! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F14%2F1576692_original.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["2 ounces cream cheese, softened", "7 tablespoons butter, softened", "½ teaspoon vanilla extract", "2 tablespoons milk", "1 ½ cups confectioners' sugar, sifted", "¼ teaspoon salt"], "direction": ["Beat together the cream cheese and butter with an electric mixer in a large bowl until creamy. Mix in the vanilla and milk, then gradually mix in the confectioners' sugar and salt until smooth and fluffy."], "facts": "69 calories; protein 0.3g 1% DV; carbohydrates 7.9g 3% DV; fat 4.2g 7% DV; cholesterol 11.6mg 4% DV; sodium 55.7mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/22538/baked-salmon-fillets-dijon/", "name": "Baked Salmon Fillets Dijon", "summary": "\nDelicious baked salmon coated with Dijon-style mustard and seasoned bread crumbs, and topped with butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F265298.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (4 ounce) fillets salmon", "3 tablespoons prepared Dijon-style mustard", "salt and pepper to taste", "¼ cup Italian-style dry bread crumbs", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil.", "Place salmon skin-side down on foil. Spread a thin layer of mustard on the top of each fillet, and season with salt and pepper. Top with bread crumbs, then drizzle with melted butter.", "Bake in a preheated oven for 15 minutes, or until salmon flakes easily with a fork."], "facts": "331 calories; protein 25g 50% DV; carbohydrates 7.5g 2% DV; fat 21.5g 33% DV; cholesterol 106.5mg 36% DV; sodium 552.5mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/34785/mushrooms-and-spinach-italian-style/", "name": "Mushrooms and Spinach Italian Style", "summary": "\nThis recipe is a typical recipe of Southern Italy, specifically Apulia. Spinach and mushrooms are sauteed with onion, garlic, balsamic vinegar, and white wine. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5131325.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 serving"]], "ingredients": ["4 tablespoons olive oil", "1 small onion, chopped", "2 cloves garlic, chopped", "14 ounces fresh mushrooms, sliced", "10 ounces clean fresh spinach, roughly chopped", "2 tablespoons balsamic vinegar", "½ cup white wine", "salt and freshly ground black pepper to taste", "chopped fresh parsley, for garnish"], "direction": ["Heat the olive oil in a large skillet over medium-high heat. Saute onion and garlic in the oil until they start to become tender. Add the mushrooms, and fry until they begin to shrink, about 3 to 4 minutes. Toss in the spinach, and fry, stirring constantly for a few minutes, or until spinach is wilted.", "Add the vinegar, stirring constantly until it is absorbed, then stir in the white wine. Reduce heat to low, and simmer until the wine has almost completely absorbed. Season with salt and pepper to taste, and sprinkle with fresh parsley. Serve hot."], "facts": "199 calories; protein 5.6g 11% DV; carbohydrates 10.3g 3% DV; fat 14.2g 22% DV; cholesterol 0mg; sodium 68.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/21736/pan-seared-salmon-i/", "name": "Pan Seared Salmon I", "summary": "\nSimply seasoned with salt and pepper, these salmon fillets are pan seared with capers, and garnished with slices of lemon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998740.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) fillets salmon", "2 tablespoons olive oil", "2 tablespoons capers", "⅛ teaspoon salt", "⅛ teaspoon ground black pepper", "4 slices  lemon"], "direction": ["Preheat a large heavy skillet over medium heat for 3 minutes.", "Coat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.", "Transfer salmon to individual plates, and garnish with lemon slices."], "facts": "371 calories; protein 33.7g 67% DV; carbohydrates 1.7g 1% DV; fat 25.1g 39% DV; cholesterol 99.1mg 33% DV; sodium 299.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/80525/slow-cooker-ham/", "name": "Slow Cooker Ham", "summary": "\nFor a delicious, no-fuss ham that is juicy and good, try this slow cooker sensation with only two ingredients! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5280017.jpg", "meta": [["prep:", "15 mins"], ["cook:", "8 hrs"], ["total:", "8 hrs 15 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["2 cups packed brown sugar", "1 (8 pound) cured, bone-in picnic ham"], "direction": ["Spread about 1 1/2 cups of brown sugar on the bottom of the slow cooker crock. Place the ham flat side down into the slow cooker - you might have to trim it a little to make it fit. Use your hands to rub the remaining brown sugar onto the ham. Cover, and cook on Low for 8 hours."], "facts": "360 calories; protein 25.8g 52% DV; carbohydrates 18g 6% DV; fat 20.1g 31% DV; cholesterol 74.2mg 25% DV; sodium 1425.1mg 57% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/13717/grandmas-green-bean-casserole/", "name": "Grandma's Green Bean Casserole", "summary": "\nThis recipe is much better than the standard mushroom soup and French fried onion version. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F29335.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["2 tablespoons butter", "2 tablespoons all-purpose flour", "1 teaspoon salt", "1 teaspoon white sugar", "¼ cup onion, diced", "1 cup sour cream", "3 (14.5 ounce) cans French style green beans, drained", "2 cups shredded Cheddar cheese", "½ cup crumbled buttery round crackers", "1 tablespoon butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Melt 2 tablespoons butter in a large skillet over medium heat. Stir in flour until smooth, and cook for one minute. Stir in the salt, sugar, onion, and sour cream. Add green beans, and stir to coat.", "Transfer the mixture to a 2 1/2 quart casserole dish. Spread shredded cheese over the top. In a small bowl, toss together cracker crumbs and remaining butter, and sprinkle over the cheese.", "Bake for 30 minutes in the preheated oven, or until the top is golden and cheese is bubbly."], "facts": "215 calories; protein 7.8g 16% DV; carbohydrates 9.5g 3% DV; fat 16.4g 25% DV; cholesterol 45.1mg 15% DV; sodium 832mg 33% DV."}, {"type": "By Holidays and Events  ", "package": "easter_recipes", "link": "https://www.allrecipes.com/recipe/25787/coconut-macaroons-iii/", "name": "Coconut Macaroons III", "summary": "\nThis recipe has won many 1st place ribbons at my state fair. They are very simple to make. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F747272.jpg", "meta": [["prep:", "10 mins"], ["additional:", "15 mins"], ["total:", "25 mins"], ["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["⅔ cup all-purpose flour", "5 ½ cups flaked coconut", "¼ teaspoon salt", "1 (14 ounce) can sweetened condensed milk", "2 teaspoons vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil.", "In a large bowl, stir together the flour, coconut and salt. Stir in the sweetened condensed milk and vanilla using your hands until well blended. Use an ice cream scoop to drop dough onto the prepared cookie sheets. Cookies should be about golf ball size.", "Bake for 12 to 15 minutes in the preheated oven, until coconut is toasted."], "facts": "287 calories; protein 4.4g 9% DV; carbohydrates 40.7g 13% DV; fat 12.4g 19% DV; cholesterol 11.1mg 4% DV; sodium 186.8mg 8% DV."}]