[{"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223506/poulet-de-provencal/", "name": "Poulet de Provencal", "summary": "\nThis always reminds me of an aromatic day in Eze, France. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F971663.jpg", "meta": [["prep:", "20 mins"], ["cook:", "25 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons olive oil", "1 teaspoon butter", "2 ½ tablespoons balsamic vinegar", "2 teaspoons Dijon mustard", "3 large cloves garlic, chopped", "4 (4 ounce) skinless, boneless chicken breast halves, pounded flat", "⅓ cup chicken stock", "1 large shallot, chopped", "2 cups cremini mushrooms, chopped", "⅓ cup chicken stock", "¼ teaspoon herbes de Provence, crumbled", "1 ½ teaspoons balsamic vinegar", "salt and ground black pepper to taste", "2 slices provolone cheese, halved"], "direction": ["Heat olive oil and butter in a large nonstick skillet over medium heat. Mix 2 1/2 tablespoons balsamic vinegar, Dijon mustard, and garlic in a bowl and stir chicken breast halves into the mixture to coat. Transfer chicken with marinade into the skillet and cook, turning occasionally, until chicken is no longer pink inside, 5 to 8 minutes per side. Transfer chicken to a platter and keep warm.", "Pour 1/3 cup chicken stock into skillet and stir to dissolve browned bits of food from the skillet. Cook and stir shallot and mushrooms until mushrooms are tender, about 5 minutes. Stir in 1/3 cup chicken stock, herbes de Provence, and 1 1/2 teaspoons balsamic vinegar. Cook, stirring occasionally, until mushrooms are deep brown in color, about 2 minutes.", "Return chicken breasts to pan and top each with 1/2 slice of provolone cheese. Cover skillet and let cheese melt; serve with mushrooms."], "facts": "249 calories; protein 30.1g 60% DV; carbohydrates 8.1g 3% DV; fat 10g 15% DV; cholesterol 77.2mg 26% DV; sodium 388.3mg 16% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/246439/gratin-dauphinois-de-solange/", "name": "Gratin Dauphinois de Solange", "summary": "\nGratin Dauphinois is the perfect accompaniment to a roast or roast beef. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3500115.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 clove garlic, halved", "2 pounds potatoes, peeled and thinly sliced", "2 ½ cups heavy whipping cream", "2 ¼ cups freshly grated Comte cheese", "salt and freshly ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Rub the cut sides of the garlic over the bottom and sides of an 8-inch baking dish.", "Spread a layer of potato slices in the bottom of dish. Pour in a third of the heavy cream; sprinkle a third of the Comte cheese on top. Season with salt and black pepper. Repeat layers twice more, ending with layers of heavy cream and Comte cheese.", "Bake in the preheated oven until potatoes are tender and cheese is golden brown, about 1 hour."], "facts": "627 calories; protein 17.2g 34% DV; carbohydrates 29.5g 10% DV; fat 49.9g 77% DV; cholesterol 180.4mg 60% DV; sodium 208.8mg 8% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/190997/traditional-layered-french-croissants/", "name": "Traditional Layered French Croissants", "summary": "\nCrisp buttery outer layers and a soft, delicate interior make these delectable croissants melt in your mouth. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6553029.jpg", "meta": [["prep:", "2 hrs 20 mins"], ["cook:", "25 mins"], ["additional:", "1 day"], ["total:", "1 day"], ["Servings:", "24"], ["Yield:", "2 dozen croissants"]], "ingredients": ["2 tablespoons all-purpose flour", "1 ½ cups unsalted butter, at room temperature", "4 cups all-purpose flour, divided", "½ teaspoon salt", "3 tablespoons sugar", "2 (.25 ounce) packages active dry yeast", "¼ cup lukewarm water", "1 cup milk", "½ cup heavy cream", "1  egg", "1 tablespoon water"], "direction": ["Sprinkle 2 tablespoons of flour over the butter and mix it together with your hands in a mixing bowl or on a work surface. Transfer the butter to a length of foil or parchment paper and pat it into a 6 inch square. Fold up the foil to make a packet and refrigerate until chilled, about 2 hours.", "Combine 2 cups of the flour with the salt and sugar in a mixing bowl. Dissolve the yeast in the lukewarm water (100 degrees F/38 degrees C) and set aside until frothy, about 10 minutes. Meanwhile, warm the milk and the heavy cream to lukewarm. Add the yeast, milk, and cream to the flour mixture and stir well. The dough will have a batter-like consistency.", "Stir in the remaining 2 cups of flour 1/4 cup at a time to form a soft dough. It should no longer be sticky. Turn the dough onto a lightly floured work surface and knead until smooth, about 5 minutes. Place the dough in a mixing bowl and cover with plastic wrap. Refrigerate for 1 hour.", "To begin the rolling and folding process, both the butter and the dough should be at a cool room temperature. [See Cook's Note.] Place the dough on a floured surface and roll it into a 10-inch square. Set the block of butter diagonally on the square dough. Bring each point of dough to the center of the butter square; the edges of the dough should overlap. Pinch the edges together to seal.", "Starting from the center of the square and working outward, use a rolling pin to roll the dough out into a rectangle. The butter should be pliable enough to roll smoothly with the dough; if it's too soft and starts to ooze out the corners, wrap the dough in plastic and refrigerate before proceeding. Roll the dough into a long rectangle, approximately 8 by 18 inches. Fold the length of dough into thirds, like a business letter.", "If the dough is still cool, you can continue with another fold. Otherwise, wrap it in plastic and refrigerate for 45 minutes to 1 hour. Remove the dough from the refrigerator and let it warm up for about 10 minutes before you begin rolling it out again.", "Position the dough so that the open ends are at 12 and 6 o'clock.  Roll the dough into a rectangle, working from the center of the dough and pressing outwards. Reposition the dough as necessary to fit your work space. You should have a long rectangle for the \"book fold.\" Fold both ends of the dough into the middle; the ends don't have to be touching, but should be close. Fold the already-folded dough in half; it will look like a thick book. Wrap the dough well with plastic and refrigerate for 1 to 2 hours.", "Remove the dough from the refrigerator and let it rest at room temperature for about 20 minutes. Roll the dough into a rectangle again and fold it into thirds, like a business letter. Wrap it in plastic and refrigerate for 4-6 hours or overnight.", "To shape the croissants, roll the dough into a 10- by 38-inch rectangle on a lightly floured work surface. It should be about 1/4 inch thick. Use a pizza wheel or sharp paring knife to trim the edges of the dough. Divide the rectangle in half so that you have two 5-inch wide strips of dough. Use a clean yardstick to mark each strip into triangles that are 5 inches wide at their bases. Cut the triangles and place them onto parchment-lined baking sheets. Chill for 15 to 20 minutes, if necessary.", "Starting at the base of the triangle, roll the dough up into a log; the tip of the triangle should be under the body of the croissant to prevent it from unraveling. Bend in the corners to form the traditional crescent shape. Repeat with the remaining dough.", "Arrange the croissants on the parchment-lined baking sheets and allow to rise until doubled in size, about 1 to 2 hours.", "Preheat an oven to 425 degrees F (220 degrees C). Beat the egg with the tablespoon of water to make the egg wash. Brush the croissants with egg wash and bake in the preheated oven until deep brown, 22 to 25 minutes. Cool on a rack before serving."], "facts": "213 calories; protein 3.2g 7% DV; carbohydrates 18.8g 6% DV; fat 14g 22% DV; cholesterol 44.9mg 15% DV; sodium 139.6mg 6% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/83905/calis-sinful-creme-brulee/", "name": "Cali's Sinful Creme Brulee", "summary": "\nChocolate lined ramekins filled with absolutely sinful creme brulee. Top with fresh berries when in season.  Perfect for that special dinner, but easy enough to make everyday! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1096736.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup semi-sweet chocolate chips", "2 cups heavy cream", "¼ cup white sugar", "1 pinch salt", "2 teaspoons vanilla extract", "5  egg yolks", "4 tablespoons white sugar"], "direction": ["Preheat the oven to 300 degrees F (150 degrees C).", "Place about 2 tablespoons of the chocolate chips into each of four 6 ounce ramekins. Place them in the microwave, and heat on full power for 30 second intervals. Stir, and continue heating until chocolate has melted. Spread to cover the sides and bottom of each ramekin.", "Bring a large pot of water to a boil.", "Meanwhile, in a saucepan, whisk together the cream, 1/4 cup sugar, and salt. Set over medium heat, and warm until steam rises from the surface. Then in a separate bowl, whisk together the egg yolks and vanilla. When the cream is hot, ladle a little bit into the egg yolks while whisking quickly. Ladle in a bit more to bring the yolks up to a high temperature without scrambling them. Whisk the yolk mixture into the rest of the cream. Ladle into the chocolate lined ramekins.", "Place a towel in the bottom of a baking dish, and place the filled ramekins on top of the towel. Place in the oven, and pour boiling water carefully into the baking dish until it comes half way up the sides of the ramekins. Cover the dish loosely with aluminum foil.", "Bake for 35 to 40 minutes in the preheated oven, just until the custard is set. Remove ramekins from the dish, and refrigerate for 4 to 6 hours.", "Before serving, sprinkle 1 tablespoon of sugar over the top of each creme brulee. Use a kitchen torch or your oven's broiler to caramelize the sugar. It may take 2 to 3 minutes in the broiler. Serve immediately."], "facts": "680 calories; protein 6.6g 13% DV; carbohydrates 42.6g 14% DV; fat 55.8g 86% DV; cholesterol 419.1mg 140% DV; sodium 57.7mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16905/beef-bourguignon-ii/", "name": "Beef Bourguignon II", "summary": "\nHearty, tender beef in a sumptuous red wine sauce. This is an easy and tasty dish. Definitely not the normal casserole. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F282766.jpg", "meta": [["prep:", "20 mins"], ["cook:", "3 hrs"], ["total:", "3 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "2 quart casserole"]], "ingredients": ["¼ cup all-purpose flour", "1 teaspoon salt", "½ teaspoon ground black pepper", "2 pounds cubed stew meat", "4 tablespoons butter", "1  onion, chopped", "2  carrots, chopped", "1 clove garlic, minced", "2 cups red wine", "1  bay leaf", "3 tablespoons chopped fresh parsley", "½ teaspoon dried thyme", "1 (6 ounce) can sliced mushrooms", "1 (16 ounce) can canned onions"], "direction": ["In a small bowl, combine the flour, salt and ground black pepper. Coat the beef cubes with this mixture.", "Melt the butter or margarine in a large skillet over medium high heat. Add the meat and brown well on all sides. Pour this into a 2 quart casserole dish.", "Return the skillet to the heat and add the onion, carrots and garlic to it. Saute for 5 to 10 minutes, or until onion is tender. add the wine, bay leaf, parsley, thyme, and liquid from the mushrooms. Pour over meat.", "Bake, covered, at 350 degrees F (175 degrees C) for 2 1/2 hours. Remove cover, add canned onions and mushroom crowns, and bake for 30 more minutes."], "facts": "583 calories; protein 32.2g 65% DV; carbohydrates 21.9g 7% DV; fat 31g 48% DV; cholesterol 124.8mg 42% DV; sodium 1332.7mg 53% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/222387/chef-johns-creme-fraiche/", "name": "Chef John's Creme Fraiche", "summary": "\nMaking creme fraiche is very easy and, once you taste the magic of homemade sour cream, you'll have a hard time not repeating this esoteric exercise. Sure it takes a couple days, but the effort is minimal and the payoff is marvelous. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4226774.jpg", "meta": [["prep:", "5 mins"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "32"], ["Yield:", "1 pint"]], "ingredients": ["2 cups heavy cream", "3 tablespoons cultured buttermilk"], "direction": ["Combine cream and buttermilk in a glass jar. Cover tightly with cheesecloth (or any breathable material) and let sit at room temperature (70 to 75 degrees F (21 to 24 degrees C)) for 24 hours. Stir, screw on lid, and refrigerate for 24 hours before using."], "facts": "52 calories; protein 0.4g 1% DV; carbohydrates 0.5g; fat 5.5g 9% DV; cholesterol 20.4mg 7% DV; sodium 7.1mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16386/french-onion-soup-v/", "name": "French Onion Soup V", "summary": "\nVery easy and oh, so good. This recipe is submitted from Quebec, Canada. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F140482.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4  onions, chopped", "3 tablespoons butter", "3 tablespoons all-purpose flour", "1 teaspoon ground black pepper", "1 teaspoon white sugar", "3 (10.5 ounce) cans beef broth", "1 ¼ cups water", "½ teaspoon dried parsley", "¼ teaspoon dried thyme", "1 cup white wine", "1  French baguette, cut into 1/2 inch slices", "8 ounces shredded mozzarella cheese"], "direction": ["In a large pot over medium heat, saute the onions in the butter or margarine for 10 minutes, or until onions are tender. Stir in the flour, ground black pepper and the sugar to form a pasty mixture.", "Now add the beef broth, water, parsley and thyme and simmer for 10 minutes, Then add the wine and simmer for 10 more minutes.", "Preheat oven to broil.", "Fill individual oven safe bowls 3/4 full with the soup. Place a slice of bread on top of the soup and cover with the cheese. Place bowls in the oven.", "Broil in the oven until the cheese is melted and bubbly"], "facts": "476 calories; protein 21.8g 44% DV; carbohydrates 56.1g 18% DV; fat 15.2g 23% DV; cholesterol 35.7mg 12% DV; sodium 1223.8mg 49% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/239230/chef-johns-coq-au-vin/", "name": "Chef John's Coq Au Vin", "summary": "\nI like to use bone-in, skin-on chicken thighs instead of an old rooster for my coq au vin. Like all braised dishes, tougher cuts with lots of connective tissue work best, and on a chicken that would be the thigh/leg section. Of course, someone will ask if they can use chicken breasts; please don't. They just will not add that sticky goodness to the braising liquid that the thighs will. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3444908.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 30 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  bone-in, skin-on chicken thighs", "1 pinch kosher salt and freshly ground black pepper to taste", "8 ounces bacon, sliced crosswise into 1/2-inch pieces", "10 large button mushrooms, quartered", "½ large yellow onion, diced", "2  shallots, sliced", "2 teaspoons all-purpose flour", "2 teaspoons butter", "1 ½ cups red wine", "6 sprigs fresh thyme", "1 cup chicken broth"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Season chicken thighs all over with salt and black pepper.", "Place bacon in a large, oven-proof skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon with a slotted spoon to a paper-towel lined plate, leaving drippings in the skillet.", "Increase heat to high and place chicken, skin-side down, into skillet. Cook in hot skillet until browned, 2 to 4 minutes per side. Transfer chicken to a plate; drain and discard all but 1 tablespoon drippings from the skillet.", "Lower heat to medium-high; saute mushrooms, onion, and shallots with a pinch of salt in the hot skillet until golden and caramelized, 7 to 12 minutes.", "Stir flour and butter into vegetable mixture until completely incorporated, about 1 minute.", "Pour red wine into the skillet and bring to a boil while scraping browned bits of food off of the bottom of the pan with a wooden spoon. Stir bacon and thyme into red wine mixture; simmer until wine is about 1/3 reduced, 3 to 5 minutes. Pour chicken broth into wine mixture and set chicken thighs into skillet; bring wine and stock to a simmer.", "Cook chicken in the preheated oven for 30 minutes. Spoon pan juices over the chicken and continue cooking until no longer pink at the bone and the juices run clear, about 30 minutes more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Transfer chicken to a platter.", "Place skillet over high heat and reduce pan juices, skimming fat off the top as necessary, until sauce thickens slightly, about 5 minutes. Season with salt and pepper; remove and discard thyme. Pour sauce over chicken."], "facts": "335 calories; protein 24.2g 49% DV; carbohydrates 7.7g 3% DV; fat 17.9g 28% DV; cholesterol 81.3mg 27% DV; sodium 422.2mg 17% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16383/basic-crepes/", "name": "Basic Crepes", "summary": "\nHere is a simple but delicious crepe batter which can be made in minutes. It's made from ingredients that everyone has on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1266.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "8 crepes"]], "ingredients": ["1 cup all-purpose flour", "2  eggs", "½ cup milk", "½ cup water", "¼ teaspoon salt", "2 tablespoons butter, melted"], "direction": ["In a large mixing bowl, whisk together the flour and the eggs. Gradually add in the milk and water, stirring to combine. Add the salt and butter; beat until smooth.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly.", "Cook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot."], "facts": "216 calories; protein 7.4g 15% DV; carbohydrates 25.5g 8% DV; fat 9.2g 14% DV; cholesterol 110.7mg 37% DV; sodium 235.3mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/13309/rich-and-simple-french-onion-soup/", "name": "Rich and Simple French Onion Soup", "summary": "\nWe have been trying French onion soup in restaurants for years and my family and friends agree none can compare to my recipe for taste and simplicity of preparation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1081318.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup unsalted butter", "2 tablespoons olive oil", "4 cups sliced onions", "4 (10.5 ounce) cans beef broth", "2 tablespoons dry sherry", "1 teaspoon dried thyme", "salt and pepper to taste", "4 slices French bread", "4 slices provolone cheese", "2 slices Swiss cheese, diced", "¼ cup grated Parmesan cheese"], "direction": ["Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions.", "Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes.", "Heat the oven broiler.", "Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly."], "facts": "585 calories; protein 20.9g 42% DV; carbohydrates 27.9g 9% DV; fat 43.9g 68% DV; cholesterol 98mg 33% DV; sodium 1578.3mg 63% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/", "name": "Chicken Cordon Bleu I", "summary": "\nThis entree is easy and delicious!  It's one of my husband's favorites! Try to use the largest chicken breasts you can find so you'll be able to roll them easier. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3508202.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "¼ teaspoon salt", "⅛ teaspoon ground black pepper", "6 slices Swiss cheese", "4 slices cooked ham", "½ cup seasoned bread crumbs"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Coat a 7x11 inch baking dish with nonstick cooking spray.", "Pound chicken breasts to 1/4 inch thickness.", "Sprinkle each piece of chicken on both sides with salt and pepper.  Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick.  Place in baking dish, and sprinkle chicken evenly with bread crumbs.", "Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast.  Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately."], "facts": "419 calories; protein 46.1g 92% DV; carbohydrates 12.6g 4% DV; fat 19.4g 30% DV; cholesterol 123.6mg 41% DV; sodium 931.6mg 37% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/233295/fondant-potatoes/", "name": "Fondant Potatoes", "summary": "\nThe texture this old-school method provides for russet potatoes is unlike anything you get by just roasting: so dense, moist, and rich. The way the crusty, crunchy edges outside contrast with the uniquely rich and creamy inside is truly a magical thing. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7186573.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["additional:", "5 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 large whole russet potatoes", "2 tablespoons high-heat-resistant vegetable oil, such as grapeseed oil", "salt and ground black pepper to taste", "3 tablespoons butter", "4 sprigs thyme, plus more for garnish", "½ cup chicken broth, or more as needed"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Cut off ends of russet potatoes, stand potatoes on end, and peel potatoes from top to bottom with a sharp knife to make each potato into a uniform cylinder. Cut each cylinder in half crosswise to make 6 potato cylinders about 2 inches long.", "Place potatoes into a bowl of cold water for about 5 minutes to remove starch from outsides; pat dry with paper towels.", "Place a heavy oven-proof skillet (such as a cast iron skillet) over high heat. Pour in vegetable oil; heat oil until it shimmers slightly.", "Place potato cylinders with best-looking ends into the hot oil, lower heat to medium-high, and pan-fry potatoes until well-browned, 5 to 6 minutes. Season with salt and black pepper.", "Flip the potatoes onto the opposite ends. As they cook, use a paper towel held with tongs to carefully blot out the oil from the skillet. Add butter and thyme sprigs to skillet.", "Pick up a thyme sprig with tongs and use it to paint butter over the top of the potatoes. Cook until butter foams and foam turns from white to a pale tan color. Season with more salt and pepper. Pour chicken stock into skillet.", "Transfer skillet to preheated oven and cook until potatoes are tender and creamy inside, about 30 minutes. If potatoes aren't tender, add 1/4 cup more stock and let cook 10 more minutes.", "Place potatoes on a serving platter and spoon thyme-scented butter remaining in skillet over potatoes. Garnish with thyme sprigs. Let cool about 5 minutes before serving."], "facts": "239 calories; protein 4.1g 8% DV; carbohydrates 33.5g 11% DV; fat 10.5g 16% DV; cholesterol 15.8mg 5% DV; sodium 173mg 7% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/87386/lobster-thermidor/", "name": "Lobster Thermidor", "summary": "\nThis stunning lobster dish is surprisingly simple to make. Lobster shells are stuffed with cooked lobster in a creamy white wine sauce, then topped with Parmesan cheese and broiled until golden. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3697243.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["total:", "40 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1 medium (1 1/2 pound) cooked lobster", "2 tablespoons butter", "1  shallot, finely chopped", "1 ⅜ cups fresh fish stock", "¼ cup white wine", "¼ cup double cream", "½ teaspoon hot English mustard", "1 tablespoon fresh lemon juice", "2 tablespoons chopped fresh parsley", "salt and freshly ground black pepper to taste", "¼ cup freshly grated Parmesan cheese"], "direction": ["Cut the lobster in half lengthwise, and remove the meat from the claws and tail. Leave to one side. Remove any meat from the head and set aside. Cut the meat up into pieces and place back into the shell.", "Melt the butter in a large skillet over medium heat. Add the shallot; cook and stir until tender. Mix in the fish stock, white wine and double cream. Bring to a boil, and cook until reduced by half. Mix in the mustard, lemon juice, parsley, salt and pepper.", "Preheat your oven's broiler.", "Place the lobster halves on a broiling pan or baking sheet, and spoon the sauce over the lobster meat in the shell. Sprinkle Parmesan cheese over the top.", "Broil for 3 to 4 minutes, just until golden brown. Serve immediately."], "facts": "653 calories; protein 76.7g 154% DV; carbohydrates 13.5g 4% DV; fat 28g 43% DV; cholesterol 322.9mg 108% DV; sodium 2059.6mg 82% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19010/eclairs-ii/", "name": "Eclairs II", "summary": "\nMy family loves these eclairs and request them all the time. I usually make them as dessert whenever we have company coming, they are always a hit! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1530950.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "9"], ["Yield:", "9 eclairs"]], "ingredients": ["½ cup butter", "1 cup water", "1 cup all-purpose flour", "¼ teaspoon salt", "4  eggs", "1 (5 ounce) package instant vanilla pudding mix", "2 ½ cups cold milk", "1 cup heavy cream", "¼ cup confectioners' sugar", "1 teaspoon vanilla extract", "2 (1 ounce) squares semisweet chocolate", "2 tablespoons butter", "1 cup confectioners' sugar", "1 teaspoon vanilla extract", "3 tablespoons hot water"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).  Grease a cookie sheet.", "In a medium saucepan, combine 1/2 cup butter and 1 cup water.  Bring to a boil, stirring until butter melts completely.  Reduce heat to low, and add flour and salt.  Stir vigorously until mixture leaves the sides of the pan and begins to form a stiff ball.  Remove from heat.  Add eggs, one at a time, beating well to incorporate completely after each addition.  With a spoon or a pastry bag fitted with a No. 10, or larger, tip, spoon or pipe dough onto cookie sheet in  1 1/2 x 4 inch strips.", "Bake 15 minutes in the preheated oven, then reduce heat to 325 degrees F (165 degrees C) and bake 20 minutes more, until hollow sounding when lightly tapped on the bottom.  Cool completely on a wire rack.", "For the filling, combine pudding mix and milk in medium bowl according to package directions.  In a separate bowl, beat the cream with an electric mixer until soft peaks form.  Beat in 1/4 cup confectioners' sugar and 1 teaspoon vanilla.  Fold whipped cream into pudding.  Cut tops off of cooled pastry shells with a sharp knife.  Fill shells with pudding mixture and replace tops.", "For the icing, melt the chocolate and 2 tablespoons butter in a medium saucepan over low heat.  Stir in 1 cup confectioners' sugar and 1 teaspoon vanilla.  Stir in hot water, one tablespoon  at a time, until icing is smooth and has reached desired consistency.  Remove from heat, cool slightly, and drizzle over filled eclairs.  Refrigerate until serving."], "facts": "476 calories; protein 7.6g 15% DV; carbohydrates 49.4g 16% DV; fat 28.4g 44% DV; cholesterol 157.8mg 53% DV; sodium 484.9mg 19% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/76043/pastry-cream/", "name": "Pastry Cream", "summary": "\nThis is a classic pastry cream often used in bakeries and restaurants. It can be used as a filling for cakes, pies or pastries. To make a lighter filling, fold in plain whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F874126.jpg", "meta": [["prep:", "15 mins"], ["cook:", "5 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["2 cups milk", "¼ cup white sugar", "2  egg yolks", "1  egg", "¼ cup cornstarch", "⅓ cup white sugar", "2 tablespoons butter", "1 teaspoon vanilla extract"], "direction": ["In a heavy saucepan, stir together the milk and 1/4 cup of sugar. Bring to a boil over medium heat.", "In a medium bowl, whisk together the egg yolks and egg. Stir together the remaining sugar and cornstarch; then stir them into the egg until smooth. When the milk comes to a boil, drizzle it into the bowl in a thin stream while mixing so that you do not cook the eggs. Return the mixture to the saucepan, and slowly bring to a boil, stirring constantly so the eggs don' t curdle or scorch on the bottom.", "When the mixture comes to a boil and thickens, remove from the heat. Stir in the butter and vanilla, mixing until the butter is completely blended in. Pour into a heat-proof container and place a piece of plastic wrap directly on the surface to prevent a skin from forming. Refrigerate until chilled before using."], "facts": "151 calories; protein 3.5g 7% DV; carbohydrates 21.4g 7% DV; fat 5.8g 9% DV; cholesterol 87mg 29% DV; sodium 56.6mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223272/herbs-de-provence/", "name": "Herbs de Provence", "summary": "\nThis is my version of Herbs de Provence after looking at many different recipes. This goes great in salads, fish, chicken, beef and pork. The fragrance is amazing! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060415.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "100"], ["Yield:", "1 cup"]], "ingredients": ["2 tablespoons dried rosemary", "1 tablespoon fennel seed", "2 tablespoons dried savory", "2 tablespoons dried thyme", "2 tablespoons dried basil", "2 tablespoons dried marjoram", "2 tablespoons dried lavender flowers", "2 tablespoons dried Italian parsley", "1 tablespoon dried oregano", "1 tablespoon dried tarragon", "1 teaspoon bay powder"], "direction": ["Grind rosemary and fennel seed in a spice grinder; transfer to a mixing bowl. Stir savory, thyme, basil, marjoram, lavender, parsley, oregano, tarragon, and bay powder with the rosemary and fennel. Store in an air-tight container between uses."], "facts": "2 calories; protein 0.1g; carbohydrates 0.3g; fat 0g; cholesterol 0mg; sodium 0.4mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/17345/buche-de-noel/", "name": "Buche de Noel", "summary": "\nBuche de Noel is the French name for a Christmas cake shaped like a log. This one is a heavenly flourless chocolate cake rolled with chocolate whipped cream. Traditionally, Buche de Noel is decorated with confectioners' sugar to resemble snow on a Yule log. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3023127.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 buche de Noel"]], "ingredients": ["2 cups heavy cream", "½ cup confectioners' sugar", "½ cup unsweetened cocoa powder", "1 teaspoon vanilla extract", "6  egg yolks", "½ cup white sugar", "⅓ cup unsweetened cocoa powder", "1 ½ teaspoons vanilla extract", "⅛ teaspoon salt", "6  egg whites", "¼ cup white sugar", "confectioners' sugar for dusting"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate.", "In a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until thick and pale. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks.  Immediately fold the yolk mixture into the whites. Spread the batter evenly into the prepared pan.", "Bake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes.", "Unroll the cake, and spread the filling to within 1 inch of the edge. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. Dust with confectioners' sugar before serving."], "facts": "276 calories; protein 5.1g 10% DV; carbohydrates 27.6g 9% DV; fat 17.7g 27% DV; cholesterol 156.8mg 52% DV; sodium 72.4mg 3% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/84214/blender-hollandaise-sauce/", "name": "Blender Hollandaise Sauce", "summary": "\nThe easiest way to get perfect Hollandaise sauce is to use a blender. This recipe has all the same ingredients as the classic, but no double boiler and no chance of the sauce separating. I love the lemony flavor on fresh steamed asparagus! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F386365.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3  egg yolks", "¼ teaspoon Dijon mustard", "1 tablespoon lemon juice", "1 dash hot pepper sauce (e.g. Tabasco™)", "½ cup butter"], "direction": ["In the container of a blender, combine the egg yolks, mustard, lemon juice and hot pepper sauce. Cover, and blend for about 5 seconds.", "Place the butter in a glass measuring cup. Heat butter in the microwave for about 1 minute, or until completely melted and hot. Set the blender on high speed, and pour the butter into the egg yolk mixture in a thin stream. It should thicken almost immediately. Keep the sauce warm until serving by placing the blender container in a pan of hot tap water."], "facts": "163 calories; protein 1.5g 3% DV; carbohydrates 0.6g; fat 17.5g 27% DV; cholesterol 143.1mg 48% DV; sodium 119.2mg 5% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/", "name": "Macaron (French Macaroon)", "summary": "\nThis is the quintessential macaron (NOT macaroon) recipe. I am a baker's apprentice, and after much trial and error, we (the baker and I) finally perfected the technique. We decided to share with you all. Pipe your choice of filling on a cookie and sandwich another cookie on top. These are like cloud cookie sandwiches and are delicious if done correctly.  If you want to do it the super-easy way, just fill with your favorite flavor of frosting. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7426387.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "16 macarons"]], "ingredients": ["3  egg whites", "¼ cup white sugar", "1 ⅔ cups confectioners' sugar", "1 cup finely ground almonds"], "direction": ["Line a baking sheet with a silicone baking mat.", "Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until whites are foamy; beat in white sugar and continue beating until egg whites are glossy, fluffy, and hold soft peaks. Sift confectioners' sugar and ground almonds in a separate bowl and quickly fold the almond mixture into the egg whites, about 30 strokes.", "Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold the batter a few more times and retest.", "When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe the batter onto the baking sheet in rounds, leaving space between the disks. Let the piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour.", "Preheat oven to 285 degrees F (140 degrees C).", "Bake cookies until set but not browned, about 10 minutes; let cookies cool completely before filling."], "facts": "190 calories; protein 6.9g 14% DV; carbohydrates 36.4g 12% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 22mg 1% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/219721/rich-and-creamy-potatoes-au-gratin/", "name": "Rich and Creamy Potatoes Au Gratin", "summary": "\nThese are the easiest, creamiest potatoes au gratin I have ever had... YUM! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F810946.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes, peeled and very thinly sliced", "3 cloves garlic, minced", "¾ teaspoon salt", "1 cup heavy cream, divided", "freshly ground black pepper to taste", "freshly grated nutmeg to taste", "2 cups freshly shredded Gruyere cheese, divided"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place potatoes, garlic, and salt into a large pot, fill with enough water to cover, and bring to a boil. Reduce heat to medium, and simmer the potatoes until tender but not mushy, 8 to 10 minutes. With a slotted spoon, transfer about half the potatoes to a 9x13-inch baking dish.", "Pour half of the cream over the potatoes, season with black pepper and nutmeg, and sprinkle half of the Gruyere cheese onto the mixture. Top with the remaining potatoes; sprinkle again with black pepper and nutmeg. Pour on the remaining cream, and sprinkle with remaining Gruyere cheese.", "Bake in the preheated oven until the cheese topping is crisp and brown on top, about 1 hour."], "facts": "352 calories; protein 12.3g 25% DV; carbohydrates 32.1g 10% DV; fat 20g 31% DV; cholesterol 70.5mg 24% DV; sodium 330.5mg 13% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/20931/french-crepes/", "name": "French Crepes", "summary": "\nA good breakfast for weekends and even desserts. Serve rolled up and filled with jam or fruit and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6115660.jpg", "meta": [["prep:", "5 mins"], ["cook:", "30 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 cup all-purpose flour", "1 teaspoon white sugar", "¼ teaspoon salt", "3  eggs", "2 cups milk", "2 tablespoons butter, melted"], "direction": ["Sift together flour, sugar and salt; set aside. In a large bowl, beat eggs and milk together with an electric mixer. Beat in flour mixture until smooth; stir in melted butter.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 2 tablespoons for each crepe. Tip and rotate pan to spread batter as thinly as possible. Brown on both sides and serve hot."], "facts": "94 calories; protein 4g 8% DV; carbohydrates 10.3g 3% DV; fat 4.1g 6% DV; cholesterol 54.8mg 18% DV; sodium 96.5mg 4% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19165/creme-brulee/", "name": "Creme Brulee", "summary": "\nThis is a very nice dessert to serve when entertaining. Delicious served over mangos sprinkled with rum, or strawberries with Grand Marnier® or Cointreau®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5055712.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 40 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["6  egg yolks", "6 tablespoons white sugar, divided", "½ teaspoon vanilla extract", "2 ½ cups heavy cream", "2 tablespoons brown sugar"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Beat egg yolks, 4 tablespoons white sugar and vanilla extract in a mixing bowl until thick and creamy.", "Pour cream into a saucepan and stir over low heat until it almost comes to boil. Remove the cream from heat immediately.  Stir cream into the egg yolk mixture; beat until combined.", "Pour cream mixture into the top pan of a double boiler. Stir over simmering water until mixture lightly coats the back of a spoon, about 3 minutes. Remove mixture from heat immediately and pour into a shallow heat-proof dish.", "Bake in preheated oven for 30 minutes.  Remove from oven and cool to room temperature.  Refrigerate for at least 1 hour or overnight.", "Preheat oven to broil.", "In a small bowl combine remaining 2 tablespoons white sugar and brown sugar.  Sift this mixture evenly over custard.  Place dish under broiler until sugar melts, about 2 minutes.  Watch carefully so as not to burn.", "Remove from heat and allow to cool.  Refrigerate until custard is set again."], "facts": "561 calories; protein 5.8g 12% DV; carbohydrates 24g 8% DV; fat 50.1g 77% DV; cholesterol 416.7mg 139% DV; sodium 55.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/76296/meat-pie/", "name": "Meat Pie", "summary": "\nThis pie is delicious! I got the recipe from my husband's mother.  She is French so I believe this is a French Meat Pie. Beef, pork, and potato are all nicely spiced and baked into a pie.  It's yummy and pretty easy to make too! Best served fresh, but you can also make ahead and freeze or refrigerate. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1672302.jpg", "meta": [["prep:", "25 mins"], ["cook:", "25 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 medium potato, peeled and cubed", "½ pound ground beef", "½ pound ground pork", "⅓ clove garlic, chopped", "½ cup chopped onion", "¼ cup water", "½ teaspoon mustard powder", "½ teaspoon dried thyme", "¼ teaspoon ground cloves", "1 teaspoon salt", "¼ teaspoon ground black pepper", "¼ teaspoon dried sage", "1 (15 ounce) package refrigerated pie crusts"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C). Place the potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside.", "Meanwhile, crumble the ground beef and pork into a large saucepan, and add the garlic, onion and water. Season with mustard powder, thyme, cloves and salt. Cook over medium heat, stirring to crumble the meat and mix in the spices, until the meat is evenly browned. Remove from the heat, and mix in the mashed potato.", "Place one of the pie crusts into a 9 inch pie plate. Fill with the meat mixture, then top with the other pie crust. Prick the top crust a few times with a knife to vent steam. Crimp around the edges using the tines of the fork, and remove any excess dough. Cover the edges of the pie crust with aluminum foil.", "Bake for 25 minutes in the preheated oven, or until the crust has browned. Serve by itself, or with a beef gravy."], "facts": "381 calories; protein 13.5g 27% DV; carbohydrates 28.1g 9% DV; fat 23.7g 37% DV; cholesterol 35.6mg 12% DV; sodium 576.7mg 23% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/33647/chocolate-ganache/", "name": "Chocolate Ganache", "summary": "\nThis is a rich, dark chocolate topping or decoration that has lots of uses. It can be whipped as filling or icing, or just poured over whatever cake you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5472303.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["9 ounces bittersweet chocolate, chopped", "1 cup heavy cream", "1 tablespoon dark rum"], "direction": ["Place the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil, watching very carefully because if it boils for a few seconds, it will boil out of the pot. When the cream has come to a boil, pour over the chopped chocolate, and whisk until smooth. Stir in the rum if desired.", "Allow the ganache to cool slightly before pouring over a cake. Start at the center of the cake and work outward. For a fluffy frosting or chocolate filling, allow it to cool until thick, then whip with a whisk until light and fluffy."], "facts": "142 calories; protein 1.4g 3% DV; carbohydrates 9.4g 3% DV; fat 10.8g 17% DV; cholesterol 21.1mg 7% DV; sodium 6.5mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/228857/restaurant-style-french-onion-soup/", "name": "Restaurant-Style French Onion Soup", "summary": "\nClassic French onion soup, similar to one you can get in a restaurant. Made with wine and sherry to bring out the beef flavor of the broth. Two different cheeses top it off to give it that bubbly, browned, and stretchy topping. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5134375.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["½ cup butter", "8  onions, sliced", "2 cloves garlic, crushed", "½ teaspoon salt, or to taste", "½ teaspoon ground black pepper, or to taste", "1 teaspoon dried thyme", "1 cup red wine", "1 tablespoon sherry", "2 tablespoons all-purpose flour", "2 quarts beef broth", "1  French baguette, cut into 1/2-inch thick slices", "olive oil, or as needed", "6 slices Swiss cheese", "6 slices provolone cheese"], "direction": ["Melt butter in a large soup pot over medium heat. Cook and stir onions, garlic, salt, black pepper, and thyme until onions are soft and brown, about 30 minutes. Pour in red wine and sherry; bring to a boil. Reduce heat to low and simmer until you can no longer smell alcohol cooking off, about 15 more minutes.", "Sprinkle onion mixture with flour and stir until coated; cook for 10 minutes. Pour in broth, stir to blend in flour, and simmer until slightly thickened, about 20 minutes.", "Preheat oven to 350 degrees F (175 degrees C) while soup is simmering. Arrange bread slices on a baking sheet and drizzle with olive oil.", "Toast the baguette slices in the preheated oven until golden brown, 12 to 14 minutes, turning the bread over halfway through cooking. Remove toast and set aside.", "Set an oven rack about 8 inches from the heat source and turn on the oven's broiler.", "Ladle soup into 6 oven-proof crocks, filling them about 3/4 full. Place 1 or 2 bread slices into the bowls and top each with a slice of Swiss cheese and a slice of provolone. Carefully place filled crocks onto a sturdy baking sheet.", "Broil soup until the cheese is browned and bubbling, 3 to 4 minutes."], "facts": "792 calories; protein 31.3g 63% DV; carbohydrates 77.2g 25% DV; fat 37.7g 58% DV; cholesterol 86.3mg 29% DV; sodium 2169.7mg 87% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/222006/disneys-ratatouille/", "name": "Disney's Ratatouille", "summary": "\nThe beautiful ratatouille served up in the movie by the same name. Long and narrow vegetables work best. Serve over a bed of brown rice, couscous, pasta or other starch, or with crusty bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3210754.jpg", "meta": [["prep:", "45 mins"], ["cook:", "45 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (6 ounce) can tomato paste", "½  onion, chopped", "¼ cup minced garlic", "1 tablespoon olive oil", "¾ cup water", "salt and ground black pepper to taste", "1 small eggplant, trimmed and very thinly sliced", "1  zucchini, trimmed and very thinly sliced", "1  yellow squash, trimmed and very thinly sliced", "1  red bell pepper, cored and very thinly sliced", "1  yellow bell pepper, cored and very thinly sliced", "3 tablespoons olive oil, or to taste", "1 teaspoon fresh thyme leaves, or to taste", "3 tablespoons mascarpone cheese"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Spread tomato paste into the bottom of a 10x10-inch baking dish. Sprinkle with onion and garlic and stir in 1 tablespoon olive oil and water until thoroughly combined. Season with salt and black pepper.", "Arrange alternating slices of eggplant, zucchini, yellow squash, red bell pepper, and yellow bell pepper, starting at the outer edge of the dish and working concentrically towards the center. Overlap the slices a little to display the colors. Drizzle the vegetables with 3 tablespoons olive oil and season with salt and black pepper. Sprinkle with thyme leaves. Cover vegetables with a piece of parchment paper cut to fit inside.", "Bake in the preheated oven until vegetables are roasted and tender, about 45 minutes. Serve with dollops of mascarpone cheese."], "facts": "275 calories; protein 5.7g 11% DV; carbohydrates 25g 8% DV; fat 19.1g 29% DV; cholesterol 13.1mg 4% DV; sodium 353mg 14% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/281658/apple-clafoutis/", "name": "Apple Clafoutis", "summary": "\nClafoutis is a French dessert which combines fresh fruit and custard. Just like a souffle, it rises beautifully then it deflates once cooled. It's best made in a cast iron skillet but any oven-proof skillet will work. Sprinkle with powdered sugar just before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8549996.jpg", "meta": [["prep:", "25 mins"], ["cook:", "50 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 large eggs", "¾ cup brown sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "1 ½ cups milk", "1 tablespoon vanilla extract"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "Mix eggs and brown sugar in a bowl until smooth. Whisk in flour and salt. Slowly add milk, stirring constantly until well combined. Stir in vanilla extract and set aside to rest.", "Melt butter, brown sugar, and water in a 10 1/4-inch cast iron skillet over medium-high heat. Stir frequently until mixture starts to boil. Reduce heat to medium; swirl skillet, but do not stir, until mixture starts to thicken, about 2 minutes. Add apples and cinnamon. Cook and stir until apples are crisp-tender and starting to brown, 15 to 18 minutes. Remove from heat.", "Stir egg mixture and pour over the apples in the skillet.", "Bake in the preheated oven until edges are golden brown and custard is set, 28 to 35 minutes."], "facts": "276 calories; protein 5.5g 11% DV; carbohydrates 40.5g 13% DV; fat 10.8g 17% DV; cholesterol 115.7mg 39% DV; sodium 185.2mg 7% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/17515/quiche-lorraine-i/", "name": "Quiche Lorraine I", "summary": "\nBacon, Swiss cheese and onions mingle in perfect harmony amidst the eggs and cream in this timeless classic. Perfect for breakfast, brunch, lunch, dinner or just an indulgent snack! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7274352.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["additional:", "10 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (9 inch) prepared pie crust", "12 slices bacon", "1 cup shredded Swiss cheese", "⅓ cup minced onion", "4  eggs, beaten", "2 cups light cream", "¾ teaspoon salt", "¼ teaspoon white sugar", "⅛ teaspoon cayenne pepper"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Place bacon in a large skillet, and fry over medium-high heat until crisp. Drain on paper towels, then chop coarsely. Sprinkle bacon, cheese and onion into pastry shell.", "In a medium bowl, whisk together eggs, cream, salt, sugar and cayenne pepper. Pour mixture into pastry shell.", "Bake 15 minutes in the preheated oven. Reduce heat to 300 degrees F (150 degrees C), and bake an additional 30 minutes, or until a knife inserted 1 inch from edge comes out clean. Allow quiche to sit 10 minutes before cutting into wedges."], "facts": "761 calories; protein 19.2g 38% DV; carbohydrates 18.7g 6% DV; fat 68.1g 105% DV; cholesterol 267.1mg 89% DV; sodium 1021.7mg 41% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19037/dessert-crepes/", "name": "Dessert Crepes", "summary": "\nEssential crepe recipe.  Sprinkle warm crepes with sugar and lemon, or serve with cream or ice cream and fruit. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4511555.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "8 crepes"]], "ingredients": ["4  eggs, lightly beaten", "1 ⅓ cups milk", "2 tablespoons butter, melted", "1 cup all-purpose flour", "2 tablespoons white sugar", "½ teaspoon salt"], "direction": ["In large bowl, whisk together eggs, milk, melted butter, flour sugar and salt until smooth.", "Heat a medium-sized skillet or crepe pan over medium heat. Grease pan with a small amount of butter or oil applied with a brush or paper towel.  Using a serving spoon or small ladle, spoon about 3 tablespoons crepe batter into hot pan, tilting the pan so that bottom surface is evenly coated.  Cook over medium heat, 1 to 2 minutes on a side, or until golden brown.  Serve immediately."], "facts": "164 calories; protein 6.4g 13% DV; carbohydrates 17.2g 6% DV; fat 7.7g 12% DV; cholesterol 111.1mg 37% DV; sodium 234.5mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/8669/chicken-cordon-bleu-ii/", "name": "Chicken Cordon Bleu II", "summary": "\n'Cordon Bleu' is a French term, literally translated as 'blue ribbon', that originally referred to an award for culinary excellence given to women cooks! The term can now apply to any superior cook (yes, men too), and also to this dish (chicken, ham and Swiss cheese slices, breaded and sauteed). This yummy version adds paprika and a creamy white wine sauce worthy of its own blue ribbon. Two blue ribbon tastes in wedded bliss -- Chicken Cordon Bleu II! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535588.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  skinless, boneless chicken breast halves", "6 slices Swiss cheese", "6 slices ham", "3 tablespoons all-purpose flour", "1 teaspoon paprika", "6 tablespoons butter", "½ cup dry white wine", "1 teaspoon chicken bouillon granules", "1 tablespoon cornstarch", "1 cup heavy whipping cream"], "direction": ["Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.", "Heat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.", "Remove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm."], "facts": "584 calories; protein 41.6g 83% DV; carbohydrates 7.7g 3% DV; fat 40.9g 63% DV; cholesterol 195.3mg 65% DV; sodium 655.3mg 26% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/9954/french-butter-cakes-madeleines/", "name": "French Butter Cakes (Madeleines)", "summary": "\nSponge cake cookie--in shell shaped molds. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6380557.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2  eggs", "¾ teaspoon vanilla extract", "⅛ teaspoon salt", "⅓ cup white sugar", "½ cup all-purpose flour", "1 tablespoon lemon zest", "¼ cup butter", "⅓ cup granulated sugar for decoration"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).    Butter and flour 12 (3 inch) madeleine molds; set aside.", "Melt butter and let cool to room temperature.", "In a small mixing bowl, beat eggs, vanilla and salt at high speed until light.", "Beating constantly, gradually add sugar; and continue beating at high speed until mixture is thick and pale and ribbons form in bowl when beaters are lifted, 5 to 10 minutes.", "Sift flour into egg mixture 1/3 at a time, gently folding after each addition.", "Add lemon zest and pour melted butter around edge of batter.  Quickly but gently fold butter into batter.  Spoon batter into molds; it will mound slightly above tops.", "Bake 14 to 17 minutes, or until cakes are golden and the tops spring back when gently pressed with your fingertip.", "Use the tip of the knife to loosen madeleines from pan; invert onto rack.  Immediately sprinkle warm cookies with granulated sugar.  Madeleines are best eaten the day they're baked.  Leftover madeleines are wonderful when dunked into coffee or tea.", "Variation: Chocolate Madeleines: Omit lemon zest.  Increase sugar to 1/2 cup.  Substitute 1/4 cup unsweetened cocoa powder for 2 tablespoons of the flour; sift into batter with flour."], "facts": "109 calories; protein 1.6g 3% DV; carbohydrates 15.3g 5% DV; fat 4.7g 7% DV; cholesterol 41.2mg 14% DV; sodium 63.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/236780/the-best-lemon-vinaigrette/", "name": "The Best Lemon Vinaigrette", "summary": "\nThis is one of my favorite salad dressings. It works for a simple salad or with crispy Parmesan chicken with a cool salad on top. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3709611.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "8"], ["Yield:", "1 cup"]], "ingredients": ["¼ cup red wine vinegar", "2 tablespoons Dijon mustard", "1 teaspoon dried oregano", "1 clove garlic, minced", "½ teaspoon kosher salt", "¼ teaspoon ground black pepper", "½ cup olive oil", "2 tablespoons fresh lemon juice"], "direction": ["Whisk red wine vinegar, Dijon mustard, oregano, garlic, salt, and black pepper together in a small bowl. Slowly stream olive oil into the vinegar mixture while whisking briskly. Beat lemon juice into the mixture.", "Pour dressing into a sealable jar or bottle, seal, and shake until emulsified."], "facts": "128 calories; protein 0.1g; carbohydrates 1.9g 1% DV; fat 13.5g 21% DV; cholesterol 0mg; sodium 214.2mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/18076/southern-style-french-onion-soup/", "name": "Southern Style French Onion Soup", "summary": "\nThis is a simple, tasty recipe for a homemade French onion soup. With this recipe, you will receive many compliments. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F113580.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 tablespoons butter", "1  onion, sliced", "½ teaspoon dried thyme", "5 (10.5 ounce) cans beef consomme", "6  bay leaves", "½ cup white wine  (Optional)", "1  French baguette, cut into 1/2 inch slices", "2 cups shredded mozzarella cheese"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "Melt the butter in a large skillet over medium high heat. Place the onion in the butter and saute for 5 to 10 minutes, or until tender. Stir in the thyme and remove from heat.", "In a large pot over high heat, combine the consomme, bay leaves and white wine, if desired. Bring to a boil, reduce heat to low, stir in the sauteed onions and allow to heat through, about 10 to 15 minutes.", "Ladle soup into 4 individual oven-safe bowls, filling each about 3/4 of the way. Top each bowl with 2 slices of baguette bread and then cover each with the cheese.", "Bake at 375 degrees F (190 degrees C) for 10 to 15 minutes, or until cheese is melted and bubbly."], "facts": "662 calories; protein 30.5g 61% DV; carbohydrates 69.1g 22% DV; fat 27g 42% DV; cholesterol 74.8mg 25% DV; sodium 2388.6mg 96% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19843/lyonnaise-potatoes/", "name": "Lyonnaise Potatoes", "summary": "\nThis is a classic dish with sliced potatoes and onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F308640.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "4 to 6 servings"]], "ingredients": ["2 pounds russet potatoes", "2 tablespoons olive oil", "4  onions, thinly sliced", "2 tablespoons chopped garlic", "½ cup butter", "salt to taste", "ground white pepper, to taste", "1 tablespoon finely minced fresh parsley"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Peel potatoes and cut into 1/2 inch slices. Place sliced potatoes in a pot and cover with water. Bring to a boil. Allow to boil 2 minutes, then drain and set aside.", "Heat a large ovenproof skillet over medium-high heat. Pour in olive oil, then add onions. Saute until lightly caramelized, 8 to 10 minutes. Stir in garlic and saute until onions are deep brown and garlic is soft. Transfer mixture to a bowl.", "Place skillet back on stove over low heat. Melt butter, then cover bottom of pan with 1/3 of potatoes. Season with salt and pepper. Cover potatoes with 1/2 of onion mixture. Cover with 1/2 of remaining potatoes and season with salt and pepper. Spread with the rest of onion mixture. Cover with remaining potatoes, and season with more salt and pepper.", "Bake in preheated oven for 10 to 12 minutes, or until potatoes are tender and browned on top. Remove from oven and use a spatula to carefully transfer potatoes to a serving platter. Sprinkle with chopped parsley just before serving."], "facts": "325 calories; protein 3.5g 7% DV; carbohydrates 34.6g 11% DV; fat 20.1g 31% DV; cholesterol 40.7mg 14% DV; sodium 118.9mg 5% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/269652/tuscan-pork-tenderloin/", "name": "Tuscan Pork Tenderloin", "summary": "\nThis is a very easy weeknight pork tenderloin recipe that is also keto-friendly. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6155203.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["additional:", "5 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 teaspoons garlic, minced", "2 teaspoons dried rosemary", "2 teaspoons dried oregano", "1 teaspoon salt", "1 teaspoon ground black pepper", "4 pounds pork tenderloin"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C).", "Combine garlic, rosemary, oregano, salt, and pepper in a small bowl. Rub spice mixture all over the pork tenderloin. Place in a baking dish.", "Bake in the preheated oven until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove from oven and let stand for 5 minutes before slicing."], "facts": "183 calories; protein 26.9g 54% DV; carbohydrates 0.7g; fat 7.3g 11% DV; cholesterol 84.2mg 28% DV; sodium 251.5mg 10% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/269557/chocolate-yule-log/", "name": "Chocolate Yule Log", "summary": "\nIf you haven't tried this classic holiday dessert because you thought it required advanced baking and pastry skill, then get ready to buche up this Noel, since the techniques required are actually quite simple. This classic holiday dessert is a showstopper, but it's often better looking than it is tasting, which is not the case here, thanks to a simple-to-make, rich chocolate sponge cake, and mocha buttercream filling. Garnished here with meringue mushrooms and rosemary. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6100205.jpg", "meta": [["prep:", "50 mins"], ["cook:", "10 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs 30 mins"], ["Servings:", "10"], ["Yield:", "1 13-inch Yule log"]], "ingredients": ["1 ⅔ cups powdered sugar", "½ cup butter, at room temperature", "1 ½ tablespoons unsweetened cocoa powder", "1 pinch salt", "2 tablespoons coffee-flavored liqueur", "⅓ cup mascarpone cheese"], "direction": ["Whip powdered sugar, butter, cocoa powder, salt, and coffee liqueur together in the bowl of a stand mixer on high speed. Transfer buttercream into a separate bowl and add mascarpone cheese. Mix until combined; set aside.", "Preheat the oven to 400 degrees F (200 degrees C). Brush a little melted butter over a 13x18-inch rimmed sheet pan. Line pan with parchment paper and brush remaining melted butter on top.", "Combine cocoa powder, salt, and flour together in a bowl; whisk or sift to break up clumps.", "Place eggs in the clean bowl of your stand mixer. Add sugar and whip until fluffy, thick, and very light in color. Add 1/2 of the cocoa powder mixture and vanilla extract; mix on low speed for a few seconds. Beat in remaining cocoa mixture on low for a few seconds. Switch to high speed; stop once mixture is moistened but not fully blended. Pull off the whisk attachment and whisk batter with it until evenly blended.", "Pour batter onto the prepared sheet pan and spread out with a spatula, leaving some room around the edges. Tap pan on the counter to knock out the large bubbles.", "Bake in the preheated oven until top is dry and edges start to pull away from the sides, 8 to 10 minutes.", "Dust a clean kitchen towel with enough powdered sugar to cover an area slightly larger than the sponge cake. Remove cake from the oven. Run a knife around the edges of the pan. Sprinkle some powdered sugar over the top. Run a spatula under the parchment paper to make sure it's not stuck to the pan.", "Quickly flip pan on top of the sugared area to invert the cake. Remove parchment paper and dust cake with more powdered sugar. Gently roll cake up inside the towel; allow to cool for 15 minutes.", "Unroll cake and dollop buttercream on top, reserving some for later. Spread frosting to the edges. Roll cake up over the frosting, using the towel to lift it if needed. Sprinkle more powdered sugar on top. Wrap log in plastic wrap. Refrigerate until firm, about 2 hours.", "Combine chocolate chips and hot cream in a bowl. Let sit for 1 minute. Whisk until chocolate melts.", "Make an angled cut 3 inches from one end of the log. Place log on a parchment-lined sheet pan. Apply some buttercream to the angled slice and attach it to one side. Spread a layer of ganache all over the cake, except for the swirls. Refrigerate for 15 minutes to firm up ganache.", "Carve lines into the ganache using the tip of a knife to create the appearance of tree bark. Refrigerate until completely chilled before serving. Dust with cocoa powder and powdered sugar."], "facts": "526 calories; protein 6.4g 13% DV; carbohydrates 55.7g 18% DV; fat 33.7g 52% DV; cholesterol 165.4mg 55% DV; sodium 245.4mg 10% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/234930/how-to-make-bordelaise-sauce/", "name": "How to Make Bordelaise Sauce", "summary": "\nThis is a simple version of the classic French red wine and shallot reduction sauce. It's fantastic on a steak, roast beef, or whatever! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7681145.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "6"], ["Yield:", "1 cup"]], "ingredients": ["1 teaspoon butter", "4 large shallots, peeled and sliced", "1 pinch salt", "1 cup red wine", "2 cups veal stock", "salt and freshly ground black pepper to taste"], "direction": ["Place butter and shallots into a saucepan with pinch of salt; cook and stir shallots over medium-low heat until caramelized and browned, about 20 minutes. Stir occasionally. Add red wine and bring to a simmer.", "Reduce heat to low; cook until wine is nearly evaporated and pan juices are thick and slightly syrupy. Watch carefully, mixture burns easily. Add veal stock, return to a simmer, and cook until reduced by half and sauce is slightly thickened, about 10 minutes.", "Pour sauce through a fine mesh strainer set over a container. Tap the strainer with a spoon while straining and squeeze out the last remaining drops of sauce from the residue. Season sauce to taste with salt and black pepper."], "facts": "82 calories; protein 2.4g 5% DV; carbohydrates 8.9g 3% DV; fat 1.1g 2% DV; cholesterol 1.8mg 1% DV; sodium 40.4mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/18411/ratatouille/", "name": "Ratatouille", "summary": "\nThis terrific dish is loaded with succulent Mediterranean vegetables. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F818555.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons olive oil", "3 cloves garlic, minced", "2 teaspoons dried parsley", "1  eggplant, cut into 1/2 inch cubes", "salt to taste", "1 cup grated Parmesan cheese", "2  zucchini, sliced", "1 large onion, sliced into rings", "2 cups sliced fresh mushrooms", "1  green bell pepper, sliced", "2 large tomatoes, chopped"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Coat bottom and sides of a 1 1/2 quart casserole dish with 1 tablespoon olive oil.", "Heat remaining 1 tablespoon olive oil in a medium skillet over medium heat. Cook and stir garlic until lightly browned. Mix in parsley and eggplant. Cook and stir until eggplant is soft, about 10 minutes. Season with salt to taste.", "Spread eggplant mixture evenly across bottom of prepared casserole dish. Sprinkle with a few tablespoons of Parmesan cheese. Spread zucchini in an even layer over top. Lightly salt and sprinkle with a little more cheese. Continue layering in this fashion, with onion, mushrooms, bell pepper, and tomatoes, covering each layer with a sprinkling of salt and cheese.", "Bake in preheated oven for 45 minutes."], "facts": "251 calories; protein 12.7g 25% DV; carbohydrates 24.3g 8% DV; fat 13.5g 21% DV; cholesterol 17.6mg 6% DV; sodium 327.4mg 13% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/228041/steelhead-trout-bake-with-dijon-mustard/", "name": "Steelhead Trout Bake with Dijon Mustard", "summary": "\nThis is really yummy - not overpoweringly mustardy! And, after all, any recipe that begins with white wine has to be good! It's not oily or buttery or anything. I've made it with salmon, and it's equally tasty. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3471537.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["cooking spray", "1 pound skinless steelhead trout fillets", "¼ cup dry white wine", "2 ½ tablespoons Dijon mustard", "2 cloves garlic, pressed", "1 tablespoon lemon juice", "1 teaspoon dried dill weed", "1 teaspoon lemon-pepper seasoning"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking dish with cooking spray.", "Arrange trout fillets in the baking dish. Mix white wine, Dijon mustard, garlic, lemon juice, dill, and lemon-pepper seasoning in a bowl; spread over the fillets, letting some run underneath the fish.", "Bake in the preheated oven until the fish is opaque and flakes easily, 10 to 15 minutes."], "facts": "145 calories; protein 19.2g 38% DV; carbohydrates 3.4g 1% DV; fat 4.2g 6% DV; cholesterol 93.8mg 31% DV; sodium 416.9mg 17% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16602/cordon-bleu-chicken-rolls/", "name": "Cordon Bleu Chicken Rolls", "summary": "\nThis is the best Chicken Cordon Bleu recipe! Chicken stuffed with ham and Swiss cheese. I hope you enjoy it as much as I have. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F371879.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 to 8 servings"]], "ingredients": ["8  skinless, boneless chicken breasts", "8 slices cooked ham", "4 slices Swiss cheese, cut into 1 inch pieces", "salt and pepper to taste", "1 teaspoon dried thyme", "¼ cup melted butter", "½ cup cornflakes cereal crumbs", "1 (10.75 ounce) can  condensed cream of chicken soup", "½ cup sour cream", "1 teaspoon lemon juice"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Place each chicken breast half between sheets of plastic wrap and pound with a meat mallet to about 1/8 inch thickness. Place a finger of cheese on each ham slice and sprinkle lightly with thyme and salt and pepper to taste. Roll up seasoned ham and cheese 'jellyroll-style', then roll each chicken breast with ham and cheese inside. Tuck in ends and fasten with toothpicks.", "Place melted butter in a small bowl and place cereal crumbs in a shallow dish or bowl. Dip each chicken roll in butter or margarine, then roll in crumbs, turning to coat thoroughly. Place coated rolls in a lightly greased 9x13 inch baking dish.", "Bake at 400 degrees F (200 degrees C) for about 40 minutes or until chicken is golden brown and juices run clear. Serve with cordon bleu sauce, if desired.", "To Make Cordon Bleu Sauce: In a small saucepan mix together the soup, sour cream and lemon juice. Heat over low heat, stirring occasionally, and serve hot over chicken rolls. Makes about 2 cups; 8 servings of 1/4 cup each."], "facts": "490 calories; protein 50g 100% DV; carbohydrates 14g 5% DV; fat 25.1g 39% DV; cholesterol 162.8mg 54% DV; sodium 1079.8mg 43% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/235275/how-to-make-french-baguettes/", "name": "How to Make French Baguettes", "summary": "\nI always thought you can't make real French baguettes at home, but once I tried it I realized I was wrong. Again. You're going to be fairly shocked when you realize just how simple this is. The only way to make bread this any more French is to put some butter on it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1684614.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["additional:", "14 hrs 30 mins"], ["total:", "15 hrs 5 mins"], ["Servings:", "6"], ["Yield:", "2 large or 4 small baguettes"]], "ingredients": ["¼ teaspoon rapid rise yeast", "1 ½ cups water at room temperature", "1 ¾ teaspoons salt", "4 cups all-purpose flour, or as needed", "½ teaspoon cornmeal, or as needed"], "direction": ["Place yeast into the bottom of a large mixing bowl and stir with water; mix in salt. Beat flour into yeast mixture with a wooden spoon until dough is thick and sticky and pulls flour from the side of the bowl, 5 to 10 minutes.", "Cover bowl with plastic wrap and let stand in a turned-off oven until doubled in size, 12 to 14 hours. Dough will be bubbly and very sticky.", "Place a silicone baking mat onto a baking sheet and dust generously with cornmeal.", "Use a floured spatula to scrape dough out onto a well-floured work surface and dust dough with flour. With well-floured hands, pat dough into a rectangle and cut into 4 equal-size pieces.", "Dust a piece of dough with flour and use your floured fingers to gently roll and stretch it out into a log about 10 inches long and 1 1/2 inches around. Gently transfer to prepared baking sheet. If desired, wipe off excess cornmeal with a damp paper towel. Repeat with another piece of dough. (Reserve remaining dough to bake later or prepare 2 baking sheets to bake all 4 at once). Dust loaves lightly with flour. Dust a large piece of plastic wrap with flour and drape plastic lightly over the baking sheet with floured side down.", "Let loaves rise, covered, until doubled, 1 to 1 1/2 hour.", "Move oven racks to the bottom and middle positions. Preheat oven to 500 degrees F (260 degrees C) or as high as your oven will go. Place an oven-safe baking dish full of water into bottom rack of the oven.", "Use a sharp kitchen shears to cut 4 or 5 angled slashes into the top of each loaf. Poke down the little sharp tips of dough left by the scissors. Spray loaves with water, using a spray bottle.", "Bake in the preheated oven until baguettes are browned, about 15 minutes, spraying loaves with water after 5 minutes and 10 minutes. Turn the pan around on the second spraying.", "Transfer baguettes to a cooling rack and let cool to room temperature before slicing with a serrated knife."], "facts": "305 calories; protein 8.7g 17% DV; carbohydrates 63.8g 21% DV; fat 0.8g 1% DV; cholesterol 0mg; sodium 681.8mg 27% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/12926/french-onion-soup-i/", "name": "French Onion Soup I", "summary": "\nThe best onion soup you will ever have!!!!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1123139.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "3  onions, thinly sliced", "1 teaspoon white sugar", "1 tablespoon all-purpose flour", "2 ½ cups water", "½ cup red wine", "2 (10.5 ounce) cans condensed beef broth", "1  French baguette", "8 ounces sliced Swiss cheese"], "direction": ["Melt butter or margarine in a 4 quart saucepan.  Stir in sugar.  Cook onions over medium heat for 10 minutes, or until golden brown.", "Stir in flour until well blended with the onions and pan juices.  Add water, wine, and beef broth; heat to boiling.  Reduce heat to low.  Cover soup, and simmer for 10 minutes.", "Cut four 1 inch thick slices of bread from the loaf.  Toast the bread slices at  325 degrees F (165 degrees C)  just until browned, about 10 minutes.  Reserve the remaining bread to serve with the soup.", "Ladle soup into four 12 ounce, oven-safe bowls.  Place 1 slice toasted bread on top of the soup in each bowl.  Fold Swiss cheese slices, and fit onto toasted bread slices.  Place soup bowls on a cookie sheet for easier handling.", "Bake at  425 degrees F (220 degrees C) for 10 minutes, or just until cheese is melted"], "facts": "732 calories; protein 33.4g 67% DV; carbohydrates 79.3g 26% DV; fat 29.4g 45% DV; cholesterol 88.6mg 30% DV; sodium 2004.2mg 80% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223506/poulet-de-provencal/", "name": "Poulet de Provencal", "summary": "\nThis always reminds me of an aromatic day in Eze, France. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F971663.jpg", "meta": [["prep:", "20 mins"], ["cook:", "25 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons olive oil", "1 teaspoon butter", "2 ½ tablespoons balsamic vinegar", "2 teaspoons Dijon mustard", "3 large cloves garlic, chopped", "4 (4 ounce) skinless, boneless chicken breast halves, pounded flat", "⅓ cup chicken stock", "1 large shallot, chopped", "2 cups cremini mushrooms, chopped", "⅓ cup chicken stock", "¼ teaspoon herbes de Provence, crumbled", "1 ½ teaspoons balsamic vinegar", "salt and ground black pepper to taste", "2 slices provolone cheese, halved"], "direction": ["Heat olive oil and butter in a large nonstick skillet over medium heat. Mix 2 1/2 tablespoons balsamic vinegar, Dijon mustard, and garlic in a bowl and stir chicken breast halves into the mixture to coat. Transfer chicken with marinade into the skillet and cook, turning occasionally, until chicken is no longer pink inside, 5 to 8 minutes per side. Transfer chicken to a platter and keep warm.", "Pour 1/3 cup chicken stock into skillet and stir to dissolve browned bits of food from the skillet. Cook and stir shallot and mushrooms until mushrooms are tender, about 5 minutes. Stir in 1/3 cup chicken stock, herbes de Provence, and 1 1/2 teaspoons balsamic vinegar. Cook, stirring occasionally, until mushrooms are deep brown in color, about 2 minutes.", "Return chicken breasts to pan and top each with 1/2 slice of provolone cheese. Cover skillet and let cheese melt; serve with mushrooms."], "facts": "249 calories; protein 30.1g 60% DV; carbohydrates 8.1g 3% DV; fat 10g 15% DV; cholesterol 77.2mg 26% DV; sodium 388.3mg 16% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/246439/gratin-dauphinois-de-solange/", "name": "Gratin Dauphinois de Solange", "summary": "\nGratin Dauphinois is the perfect accompaniment to a roast or roast beef. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3500115.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 clove garlic, halved", "2 pounds potatoes, peeled and thinly sliced", "2 ½ cups heavy whipping cream", "2 ¼ cups freshly grated Comte cheese", "salt and freshly ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Rub the cut sides of the garlic over the bottom and sides of an 8-inch baking dish.", "Spread a layer of potato slices in the bottom of dish. Pour in a third of the heavy cream; sprinkle a third of the Comte cheese on top. Season with salt and black pepper. Repeat layers twice more, ending with layers of heavy cream and Comte cheese.", "Bake in the preheated oven until potatoes are tender and cheese is golden brown, about 1 hour."], "facts": "627 calories; protein 17.2g 34% DV; carbohydrates 29.5g 10% DV; fat 49.9g 77% DV; cholesterol 180.4mg 60% DV; sodium 208.8mg 8% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/190997/traditional-layered-french-croissants/", "name": "Traditional Layered French Croissants", "summary": "\nCrisp buttery outer layers and a soft, delicate interior make these delectable croissants melt in your mouth. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6553029.jpg", "meta": [["prep:", "2 hrs 20 mins"], ["cook:", "25 mins"], ["additional:", "1 day"], ["total:", "1 day"], ["Servings:", "24"], ["Yield:", "2 dozen croissants"]], "ingredients": ["2 tablespoons all-purpose flour", "1 ½ cups unsalted butter, at room temperature", "4 cups all-purpose flour, divided", "½ teaspoon salt", "3 tablespoons sugar", "2 (.25 ounce) packages active dry yeast", "¼ cup lukewarm water", "1 cup milk", "½ cup heavy cream", "1  egg", "1 tablespoon water"], "direction": ["Sprinkle 2 tablespoons of flour over the butter and mix it together with your hands in a mixing bowl or on a work surface. Transfer the butter to a length of foil or parchment paper and pat it into a 6 inch square. Fold up the foil to make a packet and refrigerate until chilled, about 2 hours.", "Combine 2 cups of the flour with the salt and sugar in a mixing bowl. Dissolve the yeast in the lukewarm water (100 degrees F/38 degrees C) and set aside until frothy, about 10 minutes. Meanwhile, warm the milk and the heavy cream to lukewarm. Add the yeast, milk, and cream to the flour mixture and stir well. The dough will have a batter-like consistency.", "Stir in the remaining 2 cups of flour 1/4 cup at a time to form a soft dough. It should no longer be sticky. Turn the dough onto a lightly floured work surface and knead until smooth, about 5 minutes. Place the dough in a mixing bowl and cover with plastic wrap. Refrigerate for 1 hour.", "To begin the rolling and folding process, both the butter and the dough should be at a cool room temperature. [See Cook's Note.] Place the dough on a floured surface and roll it into a 10-inch square. Set the block of butter diagonally on the square dough. Bring each point of dough to the center of the butter square; the edges of the dough should overlap. Pinch the edges together to seal.", "Starting from the center of the square and working outward, use a rolling pin to roll the dough out into a rectangle. The butter should be pliable enough to roll smoothly with the dough; if it's too soft and starts to ooze out the corners, wrap the dough in plastic and refrigerate before proceeding. Roll the dough into a long rectangle, approximately 8 by 18 inches. Fold the length of dough into thirds, like a business letter.", "If the dough is still cool, you can continue with another fold. Otherwise, wrap it in plastic and refrigerate for 45 minutes to 1 hour. Remove the dough from the refrigerator and let it warm up for about 10 minutes before you begin rolling it out again.", "Position the dough so that the open ends are at 12 and 6 o'clock.  Roll the dough into a rectangle, working from the center of the dough and pressing outwards. Reposition the dough as necessary to fit your work space. You should have a long rectangle for the \"book fold.\" Fold both ends of the dough into the middle; the ends don't have to be touching, but should be close. Fold the already-folded dough in half; it will look like a thick book. Wrap the dough well with plastic and refrigerate for 1 to 2 hours.", "Remove the dough from the refrigerator and let it rest at room temperature for about 20 minutes. Roll the dough into a rectangle again and fold it into thirds, like a business letter. Wrap it in plastic and refrigerate for 4-6 hours or overnight.", "To shape the croissants, roll the dough into a 10- by 38-inch rectangle on a lightly floured work surface. It should be about 1/4 inch thick. Use a pizza wheel or sharp paring knife to trim the edges of the dough. Divide the rectangle in half so that you have two 5-inch wide strips of dough. Use a clean yardstick to mark each strip into triangles that are 5 inches wide at their bases. Cut the triangles and place them onto parchment-lined baking sheets. Chill for 15 to 20 minutes, if necessary.", "Starting at the base of the triangle, roll the dough up into a log; the tip of the triangle should be under the body of the croissant to prevent it from unraveling. Bend in the corners to form the traditional crescent shape. Repeat with the remaining dough.", "Arrange the croissants on the parchment-lined baking sheets and allow to rise until doubled in size, about 1 to 2 hours.", "Preheat an oven to 425 degrees F (220 degrees C). Beat the egg with the tablespoon of water to make the egg wash. Brush the croissants with egg wash and bake in the preheated oven until deep brown, 22 to 25 minutes. Cool on a rack before serving."], "facts": "213 calories; protein 3.2g 7% DV; carbohydrates 18.8g 6% DV; fat 14g 22% DV; cholesterol 44.9mg 15% DV; sodium 139.6mg 6% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/83905/calis-sinful-creme-brulee/", "name": "Cali's Sinful Creme Brulee", "summary": "\nChocolate lined ramekins filled with absolutely sinful creme brulee. Top with fresh berries when in season.  Perfect for that special dinner, but easy enough to make everyday! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1096736.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["additional:", "6 hrs"], ["total:", "6 hrs 50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup semi-sweet chocolate chips", "2 cups heavy cream", "¼ cup white sugar", "1 pinch salt", "2 teaspoons vanilla extract", "5  egg yolks", "4 tablespoons white sugar"], "direction": ["Preheat the oven to 300 degrees F (150 degrees C).", "Place about 2 tablespoons of the chocolate chips into each of four 6 ounce ramekins. Place them in the microwave, and heat on full power for 30 second intervals. Stir, and continue heating until chocolate has melted. Spread to cover the sides and bottom of each ramekin.", "Bring a large pot of water to a boil.", "Meanwhile, in a saucepan, whisk together the cream, 1/4 cup sugar, and salt. Set over medium heat, and warm until steam rises from the surface. Then in a separate bowl, whisk together the egg yolks and vanilla. When the cream is hot, ladle a little bit into the egg yolks while whisking quickly. Ladle in a bit more to bring the yolks up to a high temperature without scrambling them. Whisk the yolk mixture into the rest of the cream. Ladle into the chocolate lined ramekins.", "Place a towel in the bottom of a baking dish, and place the filled ramekins on top of the towel. Place in the oven, and pour boiling water carefully into the baking dish until it comes half way up the sides of the ramekins. Cover the dish loosely with aluminum foil.", "Bake for 35 to 40 minutes in the preheated oven, just until the custard is set. Remove ramekins from the dish, and refrigerate for 4 to 6 hours.", "Before serving, sprinkle 1 tablespoon of sugar over the top of each creme brulee. Use a kitchen torch or your oven's broiler to caramelize the sugar. It may take 2 to 3 minutes in the broiler. Serve immediately."], "facts": "680 calories; protein 6.6g 13% DV; carbohydrates 42.6g 14% DV; fat 55.8g 86% DV; cholesterol 419.1mg 140% DV; sodium 57.7mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16905/beef-bourguignon-ii/", "name": "Beef Bourguignon II", "summary": "\nHearty, tender beef in a sumptuous red wine sauce. This is an easy and tasty dish. Definitely not the normal casserole. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F282766.jpg", "meta": [["prep:", "20 mins"], ["cook:", "3 hrs"], ["total:", "3 hrs 20 mins"], ["Servings:", "4"], ["Yield:", "2 quart casserole"]], "ingredients": ["¼ cup all-purpose flour", "1 teaspoon salt", "½ teaspoon ground black pepper", "2 pounds cubed stew meat", "4 tablespoons butter", "1  onion, chopped", "2  carrots, chopped", "1 clove garlic, minced", "2 cups red wine", "1  bay leaf", "3 tablespoons chopped fresh parsley", "½ teaspoon dried thyme", "1 (6 ounce) can sliced mushrooms", "1 (16 ounce) can canned onions"], "direction": ["In a small bowl, combine the flour, salt and ground black pepper. Coat the beef cubes with this mixture.", "Melt the butter or margarine in a large skillet over medium high heat. Add the meat and brown well on all sides. Pour this into a 2 quart casserole dish.", "Return the skillet to the heat and add the onion, carrots and garlic to it. Saute for 5 to 10 minutes, or until onion is tender. add the wine, bay leaf, parsley, thyme, and liquid from the mushrooms. Pour over meat.", "Bake, covered, at 350 degrees F (175 degrees C) for 2 1/2 hours. Remove cover, add canned onions and mushroom crowns, and bake for 30 more minutes."], "facts": "583 calories; protein 32.2g 65% DV; carbohydrates 21.9g 7% DV; fat 31g 48% DV; cholesterol 124.8mg 42% DV; sodium 1332.7mg 53% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/222387/chef-johns-creme-fraiche/", "name": "Chef John's Creme Fraiche", "summary": "\nMaking creme fraiche is very easy and, once you taste the magic of homemade sour cream, you'll have a hard time not repeating this esoteric exercise. Sure it takes a couple days, but the effort is minimal and the payoff is marvelous. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4226774.jpg", "meta": [["prep:", "5 mins"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "32"], ["Yield:", "1 pint"]], "ingredients": ["2 cups heavy cream", "3 tablespoons cultured buttermilk"], "direction": ["Combine cream and buttermilk in a glass jar. Cover tightly with cheesecloth (or any breathable material) and let sit at room temperature (70 to 75 degrees F (21 to 24 degrees C)) for 24 hours. Stir, screw on lid, and refrigerate for 24 hours before using."], "facts": "52 calories; protein 0.4g 1% DV; carbohydrates 0.5g; fat 5.5g 9% DV; cholesterol 20.4mg 7% DV; sodium 7.1mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16386/french-onion-soup-v/", "name": "French Onion Soup V", "summary": "\nVery easy and oh, so good. This recipe is submitted from Quebec, Canada. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F140482.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4  onions, chopped", "3 tablespoons butter", "3 tablespoons all-purpose flour", "1 teaspoon ground black pepper", "1 teaspoon white sugar", "3 (10.5 ounce) cans beef broth", "1 ¼ cups water", "½ teaspoon dried parsley", "¼ teaspoon dried thyme", "1 cup white wine", "1  French baguette, cut into 1/2 inch slices", "8 ounces shredded mozzarella cheese"], "direction": ["In a large pot over medium heat, saute the onions in the butter or margarine for 10 minutes, or until onions are tender. Stir in the flour, ground black pepper and the sugar to form a pasty mixture.", "Now add the beef broth, water, parsley and thyme and simmer for 10 minutes, Then add the wine and simmer for 10 more minutes.", "Preheat oven to broil.", "Fill individual oven safe bowls 3/4 full with the soup. Place a slice of bread on top of the soup and cover with the cheese. Place bowls in the oven.", "Broil in the oven until the cheese is melted and bubbly"], "facts": "476 calories; protein 21.8g 44% DV; carbohydrates 56.1g 18% DV; fat 15.2g 23% DV; cholesterol 35.7mg 12% DV; sodium 1223.8mg 49% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/239230/chef-johns-coq-au-vin/", "name": "Chef John's Coq Au Vin", "summary": "\nI like to use bone-in, skin-on chicken thighs instead of an old rooster for my coq au vin. Like all braised dishes, tougher cuts with lots of connective tissue work best, and on a chicken that would be the thigh/leg section. Of course, someone will ask if they can use chicken breasts; please don't. They just will not add that sticky goodness to the braising liquid that the thighs will. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3444908.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 30 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  bone-in, skin-on chicken thighs", "1 pinch kosher salt and freshly ground black pepper to taste", "8 ounces bacon, sliced crosswise into 1/2-inch pieces", "10 large button mushrooms, quartered", "½ large yellow onion, diced", "2  shallots, sliced", "2 teaspoons all-purpose flour", "2 teaspoons butter", "1 ½ cups red wine", "6 sprigs fresh thyme", "1 cup chicken broth"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Season chicken thighs all over with salt and black pepper.", "Place bacon in a large, oven-proof skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon with a slotted spoon to a paper-towel lined plate, leaving drippings in the skillet.", "Increase heat to high and place chicken, skin-side down, into skillet. Cook in hot skillet until browned, 2 to 4 minutes per side. Transfer chicken to a plate; drain and discard all but 1 tablespoon drippings from the skillet.", "Lower heat to medium-high; saute mushrooms, onion, and shallots with a pinch of salt in the hot skillet until golden and caramelized, 7 to 12 minutes.", "Stir flour and butter into vegetable mixture until completely incorporated, about 1 minute.", "Pour red wine into the skillet and bring to a boil while scraping browned bits of food off of the bottom of the pan with a wooden spoon. Stir bacon and thyme into red wine mixture; simmer until wine is about 1/3 reduced, 3 to 5 minutes. Pour chicken broth into wine mixture and set chicken thighs into skillet; bring wine and stock to a simmer.", "Cook chicken in the preheated oven for 30 minutes. Spoon pan juices over the chicken and continue cooking until no longer pink at the bone and the juices run clear, about 30 minutes more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Transfer chicken to a platter.", "Place skillet over high heat and reduce pan juices, skimming fat off the top as necessary, until sauce thickens slightly, about 5 minutes. Season with salt and pepper; remove and discard thyme. Pour sauce over chicken."], "facts": "335 calories; protein 24.2g 49% DV; carbohydrates 7.7g 3% DV; fat 17.9g 28% DV; cholesterol 81.3mg 27% DV; sodium 422.2mg 17% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16383/basic-crepes/", "name": "Basic Crepes", "summary": "\nHere is a simple but delicious crepe batter which can be made in minutes. It's made from ingredients that everyone has on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1266.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "8 crepes"]], "ingredients": ["1 cup all-purpose flour", "2  eggs", "½ cup milk", "½ cup water", "¼ teaspoon salt", "2 tablespoons butter, melted"], "direction": ["In a large mixing bowl, whisk together the flour and the eggs. Gradually add in the milk and water, stirring to combine. Add the salt and butter; beat until smooth.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly.", "Cook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot."], "facts": "216 calories; protein 7.4g 15% DV; carbohydrates 25.5g 8% DV; fat 9.2g 14% DV; cholesterol 110.7mg 37% DV; sodium 235.3mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/13309/rich-and-simple-french-onion-soup/", "name": "Rich and Simple French Onion Soup", "summary": "\nWe have been trying French onion soup in restaurants for years and my family and friends agree none can compare to my recipe for taste and simplicity of preparation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1081318.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup unsalted butter", "2 tablespoons olive oil", "4 cups sliced onions", "4 (10.5 ounce) cans beef broth", "2 tablespoons dry sherry", "1 teaspoon dried thyme", "salt and pepper to taste", "4 slices French bread", "4 slices provolone cheese", "2 slices Swiss cheese, diced", "¼ cup grated Parmesan cheese"], "direction": ["Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions.", "Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes.", "Heat the oven broiler.", "Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly."], "facts": "585 calories; protein 20.9g 42% DV; carbohydrates 27.9g 9% DV; fat 43.9g 68% DV; cholesterol 98mg 33% DV; sodium 1578.3mg 63% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/", "name": "Chicken Cordon Bleu I", "summary": "\nThis entree is easy and delicious!  It's one of my husband's favorites! Try to use the largest chicken breasts you can find so you'll be able to roll them easier. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3508202.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "¼ teaspoon salt", "⅛ teaspoon ground black pepper", "6 slices Swiss cheese", "4 slices cooked ham", "½ cup seasoned bread crumbs"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).  Coat a 7x11 inch baking dish with nonstick cooking spray.", "Pound chicken breasts to 1/4 inch thickness.", "Sprinkle each piece of chicken on both sides with salt and pepper.  Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick.  Place in baking dish, and sprinkle chicken evenly with bread crumbs.", "Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast.  Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately."], "facts": "419 calories; protein 46.1g 92% DV; carbohydrates 12.6g 4% DV; fat 19.4g 30% DV; cholesterol 123.6mg 41% DV; sodium 931.6mg 37% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/233295/fondant-potatoes/", "name": "Fondant Potatoes", "summary": "\nThe texture this old-school method provides for russet potatoes is unlike anything you get by just roasting: so dense, moist, and rich. The way the crusty, crunchy edges outside contrast with the uniquely rich and creamy inside is truly a magical thing. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7186573.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["additional:", "5 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 large whole russet potatoes", "2 tablespoons high-heat-resistant vegetable oil, such as grapeseed oil", "salt and ground black pepper to taste", "3 tablespoons butter", "4 sprigs thyme, plus more for garnish", "½ cup chicken broth, or more as needed"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Cut off ends of russet potatoes, stand potatoes on end, and peel potatoes from top to bottom with a sharp knife to make each potato into a uniform cylinder. Cut each cylinder in half crosswise to make 6 potato cylinders about 2 inches long.", "Place potatoes into a bowl of cold water for about 5 minutes to remove starch from outsides; pat dry with paper towels.", "Place a heavy oven-proof skillet (such as a cast iron skillet) over high heat. Pour in vegetable oil; heat oil until it shimmers slightly.", "Place potato cylinders with best-looking ends into the hot oil, lower heat to medium-high, and pan-fry potatoes until well-browned, 5 to 6 minutes. Season with salt and black pepper.", "Flip the potatoes onto the opposite ends. As they cook, use a paper towel held with tongs to carefully blot out the oil from the skillet. Add butter and thyme sprigs to skillet.", "Pick up a thyme sprig with tongs and use it to paint butter over the top of the potatoes. Cook until butter foams and foam turns from white to a pale tan color. Season with more salt and pepper. Pour chicken stock into skillet.", "Transfer skillet to preheated oven and cook until potatoes are tender and creamy inside, about 30 minutes. If potatoes aren't tender, add 1/4 cup more stock and let cook 10 more minutes.", "Place potatoes on a serving platter and spoon thyme-scented butter remaining in skillet over potatoes. Garnish with thyme sprigs. Let cool about 5 minutes before serving."], "facts": "239 calories; protein 4.1g 8% DV; carbohydrates 33.5g 11% DV; fat 10.5g 16% DV; cholesterol 15.8mg 5% DV; sodium 173mg 7% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/87386/lobster-thermidor/", "name": "Lobster Thermidor", "summary": "\nThis stunning lobster dish is surprisingly simple to make. Lobster shells are stuffed with cooked lobster in a creamy white wine sauce, then topped with Parmesan cheese and broiled until golden. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3697243.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["total:", "40 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1 medium (1 1/2 pound) cooked lobster", "2 tablespoons butter", "1  shallot, finely chopped", "1 ⅜ cups fresh fish stock", "¼ cup white wine", "¼ cup double cream", "½ teaspoon hot English mustard", "1 tablespoon fresh lemon juice", "2 tablespoons chopped fresh parsley", "salt and freshly ground black pepper to taste", "¼ cup freshly grated Parmesan cheese"], "direction": ["Cut the lobster in half lengthwise, and remove the meat from the claws and tail. Leave to one side. Remove any meat from the head and set aside. Cut the meat up into pieces and place back into the shell.", "Melt the butter in a large skillet over medium heat. Add the shallot; cook and stir until tender. Mix in the fish stock, white wine and double cream. Bring to a boil, and cook until reduced by half. Mix in the mustard, lemon juice, parsley, salt and pepper.", "Preheat your oven's broiler.", "Place the lobster halves on a broiling pan or baking sheet, and spoon the sauce over the lobster meat in the shell. Sprinkle Parmesan cheese over the top.", "Broil for 3 to 4 minutes, just until golden brown. Serve immediately."], "facts": "653 calories; protein 76.7g 154% DV; carbohydrates 13.5g 4% DV; fat 28g 43% DV; cholesterol 322.9mg 108% DV; sodium 2059.6mg 82% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19010/eclairs-ii/", "name": "Eclairs II", "summary": "\nMy family loves these eclairs and request them all the time. I usually make them as dessert whenever we have company coming, they are always a hit! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1530950.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "9"], ["Yield:", "9 eclairs"]], "ingredients": ["½ cup butter", "1 cup water", "1 cup all-purpose flour", "¼ teaspoon salt", "4  eggs", "1 (5 ounce) package instant vanilla pudding mix", "2 ½ cups cold milk", "1 cup heavy cream", "¼ cup confectioners' sugar", "1 teaspoon vanilla extract", "2 (1 ounce) squares semisweet chocolate", "2 tablespoons butter", "1 cup confectioners' sugar", "1 teaspoon vanilla extract", "3 tablespoons hot water"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).  Grease a cookie sheet.", "In a medium saucepan, combine 1/2 cup butter and 1 cup water.  Bring to a boil, stirring until butter melts completely.  Reduce heat to low, and add flour and salt.  Stir vigorously until mixture leaves the sides of the pan and begins to form a stiff ball.  Remove from heat.  Add eggs, one at a time, beating well to incorporate completely after each addition.  With a spoon or a pastry bag fitted with a No. 10, or larger, tip, spoon or pipe dough onto cookie sheet in  1 1/2 x 4 inch strips.", "Bake 15 minutes in the preheated oven, then reduce heat to 325 degrees F (165 degrees C) and bake 20 minutes more, until hollow sounding when lightly tapped on the bottom.  Cool completely on a wire rack.", "For the filling, combine pudding mix and milk in medium bowl according to package directions.  In a separate bowl, beat the cream with an electric mixer until soft peaks form.  Beat in 1/4 cup confectioners' sugar and 1 teaspoon vanilla.  Fold whipped cream into pudding.  Cut tops off of cooled pastry shells with a sharp knife.  Fill shells with pudding mixture and replace tops.", "For the icing, melt the chocolate and 2 tablespoons butter in a medium saucepan over low heat.  Stir in 1 cup confectioners' sugar and 1 teaspoon vanilla.  Stir in hot water, one tablespoon  at a time, until icing is smooth and has reached desired consistency.  Remove from heat, cool slightly, and drizzle over filled eclairs.  Refrigerate until serving."], "facts": "476 calories; protein 7.6g 15% DV; carbohydrates 49.4g 16% DV; fat 28.4g 44% DV; cholesterol 157.8mg 53% DV; sodium 484.9mg 19% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/76043/pastry-cream/", "name": "Pastry Cream", "summary": "\nThis is a classic pastry cream often used in bakeries and restaurants. It can be used as a filling for cakes, pies or pastries. To make a lighter filling, fold in plain whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F874126.jpg", "meta": [["prep:", "15 mins"], ["cook:", "5 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["2 cups milk", "¼ cup white sugar", "2  egg yolks", "1  egg", "¼ cup cornstarch", "⅓ cup white sugar", "2 tablespoons butter", "1 teaspoon vanilla extract"], "direction": ["In a heavy saucepan, stir together the milk and 1/4 cup of sugar. Bring to a boil over medium heat.", "In a medium bowl, whisk together the egg yolks and egg. Stir together the remaining sugar and cornstarch; then stir them into the egg until smooth. When the milk comes to a boil, drizzle it into the bowl in a thin stream while mixing so that you do not cook the eggs. Return the mixture to the saucepan, and slowly bring to a boil, stirring constantly so the eggs don' t curdle or scorch on the bottom.", "When the mixture comes to a boil and thickens, remove from the heat. Stir in the butter and vanilla, mixing until the butter is completely blended in. Pour into a heat-proof container and place a piece of plastic wrap directly on the surface to prevent a skin from forming. Refrigerate until chilled before using."], "facts": "151 calories; protein 3.5g 7% DV; carbohydrates 21.4g 7% DV; fat 5.8g 9% DV; cholesterol 87mg 29% DV; sodium 56.6mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223272/herbs-de-provence/", "name": "Herbs de Provence", "summary": "\nThis is my version of Herbs de Provence after looking at many different recipes. This goes great in salads, fish, chicken, beef and pork. The fragrance is amazing! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060415.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "100"], ["Yield:", "1 cup"]], "ingredients": ["2 tablespoons dried rosemary", "1 tablespoon fennel seed", "2 tablespoons dried savory", "2 tablespoons dried thyme", "2 tablespoons dried basil", "2 tablespoons dried marjoram", "2 tablespoons dried lavender flowers", "2 tablespoons dried Italian parsley", "1 tablespoon dried oregano", "1 tablespoon dried tarragon", "1 teaspoon bay powder"], "direction": ["Grind rosemary and fennel seed in a spice grinder; transfer to a mixing bowl. Stir savory, thyme, basil, marjoram, lavender, parsley, oregano, tarragon, and bay powder with the rosemary and fennel. Store in an air-tight container between uses."], "facts": "2 calories; protein 0.1g; carbohydrates 0.3g; fat 0g; cholesterol 0mg; sodium 0.4mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/17345/buche-de-noel/", "name": "Buche de Noel", "summary": "\nBuche de Noel is the French name for a Christmas cake shaped like a log. This one is a heavenly flourless chocolate cake rolled with chocolate whipped cream. Traditionally, Buche de Noel is decorated with confectioners' sugar to resemble snow on a Yule log. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3023127.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "1 buche de Noel"]], "ingredients": ["2 cups heavy cream", "½ cup confectioners' sugar", "½ cup unsweetened cocoa powder", "1 teaspoon vanilla extract", "6  egg yolks", "½ cup white sugar", "⅓ cup unsweetened cocoa powder", "1 ½ teaspoons vanilla extract", "⅛ teaspoon salt", "6  egg whites", "¼ cup white sugar", "confectioners' sugar for dusting"], "direction": ["Preheat oven to 375  degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate.", "In a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until thick and pale. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks.  Immediately fold the yolk mixture into the whites. Spread the batter evenly into the prepared pan.", "Bake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes.", "Unroll the cake, and spread the filling to within 1 inch of the edge. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. Dust with confectioners' sugar before serving."], "facts": "276 calories; protein 5.1g 10% DV; carbohydrates 27.6g 9% DV; fat 17.7g 27% DV; cholesterol 156.8mg 52% DV; sodium 72.4mg 3% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/84214/blender-hollandaise-sauce/", "name": "Blender Hollandaise Sauce", "summary": "\nThe easiest way to get perfect Hollandaise sauce is to use a blender. This recipe has all the same ingredients as the classic, but no double boiler and no chance of the sauce separating. I love the lemony flavor on fresh steamed asparagus! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F386365.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3  egg yolks", "¼ teaspoon Dijon mustard", "1 tablespoon lemon juice", "1 dash hot pepper sauce (e.g. Tabasco™)", "½ cup butter"], "direction": ["In the container of a blender, combine the egg yolks, mustard, lemon juice and hot pepper sauce. Cover, and blend for about 5 seconds.", "Place the butter in a glass measuring cup. Heat butter in the microwave for about 1 minute, or until completely melted and hot. Set the blender on high speed, and pour the butter into the egg yolk mixture in a thin stream. It should thicken almost immediately. Keep the sauce warm until serving by placing the blender container in a pan of hot tap water."], "facts": "163 calories; protein 1.5g 3% DV; carbohydrates 0.6g; fat 17.5g 27% DV; cholesterol 143.1mg 48% DV; sodium 119.2mg 5% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/", "name": "Macaron (French Macaroon)", "summary": "\nThis is the quintessential macaron (NOT macaroon) recipe. I am a baker's apprentice, and after much trial and error, we (the baker and I) finally perfected the technique. We decided to share with you all. Pipe your choice of filling on a cookie and sandwich another cookie on top. These are like cloud cookie sandwiches and are delicious if done correctly.  If you want to do it the super-easy way, just fill with your favorite flavor of frosting. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7426387.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 30 mins"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "16 macarons"]], "ingredients": ["3  egg whites", "¼ cup white sugar", "1 ⅔ cups confectioners' sugar", "1 cup finely ground almonds"], "direction": ["Line a baking sheet with a silicone baking mat.", "Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until whites are foamy; beat in white sugar and continue beating until egg whites are glossy, fluffy, and hold soft peaks. Sift confectioners' sugar and ground almonds in a separate bowl and quickly fold the almond mixture into the egg whites, about 30 strokes.", "Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold the batter a few more times and retest.", "When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe the batter onto the baking sheet in rounds, leaving space between the disks. Let the piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour.", "Preheat oven to 285 degrees F (140 degrees C).", "Bake cookies until set but not browned, about 10 minutes; let cookies cool completely before filling."], "facts": "190 calories; protein 6.9g 14% DV; carbohydrates 36.4g 12% DV; fat 2.6g 4% DV; cholesterol 0mg; sodium 22mg 1% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/219721/rich-and-creamy-potatoes-au-gratin/", "name": "Rich and Creamy Potatoes Au Gratin", "summary": "\nThese are the easiest, creamiest potatoes au gratin I have ever had... YUM! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F810946.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes, peeled and very thinly sliced", "3 cloves garlic, minced", "¾ teaspoon salt", "1 cup heavy cream, divided", "freshly ground black pepper to taste", "freshly grated nutmeg to taste", "2 cups freshly shredded Gruyere cheese, divided"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place potatoes, garlic, and salt into a large pot, fill with enough water to cover, and bring to a boil. Reduce heat to medium, and simmer the potatoes until tender but not mushy, 8 to 10 minutes. With a slotted spoon, transfer about half the potatoes to a 9x13-inch baking dish.", "Pour half of the cream over the potatoes, season with black pepper and nutmeg, and sprinkle half of the Gruyere cheese onto the mixture. Top with the remaining potatoes; sprinkle again with black pepper and nutmeg. Pour on the remaining cream, and sprinkle with remaining Gruyere cheese.", "Bake in the preheated oven until the cheese topping is crisp and brown on top, about 1 hour."], "facts": "352 calories; protein 12.3g 25% DV; carbohydrates 32.1g 10% DV; fat 20g 31% DV; cholesterol 70.5mg 24% DV; sodium 330.5mg 13% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/20931/french-crepes/", "name": "French Crepes", "summary": "\nA good breakfast for weekends and even desserts. Serve rolled up and filled with jam or fruit and whipped cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6115660.jpg", "meta": [["prep:", "5 mins"], ["cook:", "30 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 cup all-purpose flour", "1 teaspoon white sugar", "¼ teaspoon salt", "3  eggs", "2 cups milk", "2 tablespoons butter, melted"], "direction": ["Sift together flour, sugar and salt; set aside. In a large bowl, beat eggs and milk together with an electric mixer. Beat in flour mixture until smooth; stir in melted butter.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 2 tablespoons for each crepe. Tip and rotate pan to spread batter as thinly as possible. Brown on both sides and serve hot."], "facts": "94 calories; protein 4g 8% DV; carbohydrates 10.3g 3% DV; fat 4.1g 6% DV; cholesterol 54.8mg 18% DV; sodium 96.5mg 4% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19165/creme-brulee/", "name": "Creme Brulee", "summary": "\nThis is a very nice dessert to serve when entertaining. Delicious served over mangos sprinkled with rum, or strawberries with Grand Marnier® or Cointreau®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5055712.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 40 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["6  egg yolks", "6 tablespoons white sugar, divided", "½ teaspoon vanilla extract", "2 ½ cups heavy cream", "2 tablespoons brown sugar"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Beat egg yolks, 4 tablespoons white sugar and vanilla extract in a mixing bowl until thick and creamy.", "Pour cream into a saucepan and stir over low heat until it almost comes to boil. Remove the cream from heat immediately.  Stir cream into the egg yolk mixture; beat until combined.", "Pour cream mixture into the top pan of a double boiler. Stir over simmering water until mixture lightly coats the back of a spoon, about 3 minutes. Remove mixture from heat immediately and pour into a shallow heat-proof dish.", "Bake in preheated oven for 30 minutes.  Remove from oven and cool to room temperature.  Refrigerate for at least 1 hour or overnight.", "Preheat oven to broil.", "In a small bowl combine remaining 2 tablespoons white sugar and brown sugar.  Sift this mixture evenly over custard.  Place dish under broiler until sugar melts, about 2 minutes.  Watch carefully so as not to burn.", "Remove from heat and allow to cool.  Refrigerate until custard is set again."], "facts": "561 calories; protein 5.8g 12% DV; carbohydrates 24g 8% DV; fat 50.1g 77% DV; cholesterol 416.7mg 139% DV; sodium 55.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/76296/meat-pie/", "name": "Meat Pie", "summary": "\nThis pie is delicious! I got the recipe from my husband's mother.  She is French so I believe this is a French Meat Pie. Beef, pork, and potato are all nicely spiced and baked into a pie.  It's yummy and pretty easy to make too! Best served fresh, but you can also make ahead and freeze or refrigerate. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1672302.jpg", "meta": [["prep:", "25 mins"], ["cook:", "25 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 medium potato, peeled and cubed", "½ pound ground beef", "½ pound ground pork", "⅓ clove garlic, chopped", "½ cup chopped onion", "¼ cup water", "½ teaspoon mustard powder", "½ teaspoon dried thyme", "¼ teaspoon ground cloves", "1 teaspoon salt", "¼ teaspoon ground black pepper", "¼ teaspoon dried sage", "1 (15 ounce) package refrigerated pie crusts"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C). Place the potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside.", "Meanwhile, crumble the ground beef and pork into a large saucepan, and add the garlic, onion and water. Season with mustard powder, thyme, cloves and salt. Cook over medium heat, stirring to crumble the meat and mix in the spices, until the meat is evenly browned. Remove from the heat, and mix in the mashed potato.", "Place one of the pie crusts into a 9 inch pie plate. Fill with the meat mixture, then top with the other pie crust. Prick the top crust a few times with a knife to vent steam. Crimp around the edges using the tines of the fork, and remove any excess dough. Cover the edges of the pie crust with aluminum foil.", "Bake for 25 minutes in the preheated oven, or until the crust has browned. Serve by itself, or with a beef gravy."], "facts": "381 calories; protein 13.5g 27% DV; carbohydrates 28.1g 9% DV; fat 23.7g 37% DV; cholesterol 35.6mg 12% DV; sodium 576.7mg 23% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/33647/chocolate-ganache/", "name": "Chocolate Ganache", "summary": "\nThis is a rich, dark chocolate topping or decoration that has lots of uses. It can be whipped as filling or icing, or just poured over whatever cake you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5472303.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["9 ounces bittersweet chocolate, chopped", "1 cup heavy cream", "1 tablespoon dark rum"], "direction": ["Place the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil, watching very carefully because if it boils for a few seconds, it will boil out of the pot. When the cream has come to a boil, pour over the chopped chocolate, and whisk until smooth. Stir in the rum if desired.", "Allow the ganache to cool slightly before pouring over a cake. Start at the center of the cake and work outward. For a fluffy frosting or chocolate filling, allow it to cool until thick, then whip with a whisk until light and fluffy."], "facts": "142 calories; protein 1.4g 3% DV; carbohydrates 9.4g 3% DV; fat 10.8g 17% DV; cholesterol 21.1mg 7% DV; sodium 6.5mg."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/228857/restaurant-style-french-onion-soup/", "name": "Restaurant-Style French Onion Soup", "summary": "\nClassic French onion soup, similar to one you can get in a restaurant. Made with wine and sherry to bring out the beef flavor of the broth. Two different cheeses top it off to give it that bubbly, browned, and stretchy topping. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5134375.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["½ cup butter", "8  onions, sliced", "2 cloves garlic, crushed", "½ teaspoon salt, or to taste", "½ teaspoon ground black pepper, or to taste", "1 teaspoon dried thyme", "1 cup red wine", "1 tablespoon sherry", "2 tablespoons all-purpose flour", "2 quarts beef broth", "1  French baguette, cut into 1/2-inch thick slices", "olive oil, or as needed", "6 slices Swiss cheese", "6 slices provolone cheese"], "direction": ["Melt butter in a large soup pot over medium heat. Cook and stir onions, garlic, salt, black pepper, and thyme until onions are soft and brown, about 30 minutes. Pour in red wine and sherry; bring to a boil. Reduce heat to low and simmer until you can no longer smell alcohol cooking off, about 15 more minutes.", "Sprinkle onion mixture with flour and stir until coated; cook for 10 minutes. Pour in broth, stir to blend in flour, and simmer until slightly thickened, about 20 minutes.", "Preheat oven to 350 degrees F (175 degrees C) while soup is simmering. Arrange bread slices on a baking sheet and drizzle with olive oil.", "Toast the baguette slices in the preheated oven until golden brown, 12 to 14 minutes, turning the bread over halfway through cooking. Remove toast and set aside.", "Set an oven rack about 8 inches from the heat source and turn on the oven's broiler.", "Ladle soup into 6 oven-proof crocks, filling them about 3/4 full. Place 1 or 2 bread slices into the bowls and top each with a slice of Swiss cheese and a slice of provolone. Carefully place filled crocks onto a sturdy baking sheet.", "Broil soup until the cheese is browned and bubbling, 3 to 4 minutes."], "facts": "792 calories; protein 31.3g 63% DV; carbohydrates 77.2g 25% DV; fat 37.7g 58% DV; cholesterol 86.3mg 29% DV; sodium 2169.7mg 87% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/222006/disneys-ratatouille/", "name": "Disney's Ratatouille", "summary": "\nThe beautiful ratatouille served up in the movie by the same name. Long and narrow vegetables work best. Serve over a bed of brown rice, couscous, pasta or other starch, or with crusty bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3210754.jpg", "meta": [["prep:", "45 mins"], ["cook:", "45 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (6 ounce) can tomato paste", "½  onion, chopped", "¼ cup minced garlic", "1 tablespoon olive oil", "¾ cup water", "salt and ground black pepper to taste", "1 small eggplant, trimmed and very thinly sliced", "1  zucchini, trimmed and very thinly sliced", "1  yellow squash, trimmed and very thinly sliced", "1  red bell pepper, cored and very thinly sliced", "1  yellow bell pepper, cored and very thinly sliced", "3 tablespoons olive oil, or to taste", "1 teaspoon fresh thyme leaves, or to taste", "3 tablespoons mascarpone cheese"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Spread tomato paste into the bottom of a 10x10-inch baking dish. Sprinkle with onion and garlic and stir in 1 tablespoon olive oil and water until thoroughly combined. Season with salt and black pepper.", "Arrange alternating slices of eggplant, zucchini, yellow squash, red bell pepper, and yellow bell pepper, starting at the outer edge of the dish and working concentrically towards the center. Overlap the slices a little to display the colors. Drizzle the vegetables with 3 tablespoons olive oil and season with salt and black pepper. Sprinkle with thyme leaves. Cover vegetables with a piece of parchment paper cut to fit inside.", "Bake in the preheated oven until vegetables are roasted and tender, about 45 minutes. Serve with dollops of mascarpone cheese."], "facts": "275 calories; protein 5.7g 11% DV; carbohydrates 25g 8% DV; fat 19.1g 29% DV; cholesterol 13.1mg 4% DV; sodium 353mg 14% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/281658/apple-clafoutis/", "name": "Apple Clafoutis", "summary": "\nClafoutis is a French dessert which combines fresh fruit and custard. Just like a souffle, it rises beautifully then it deflates once cooled. It's best made in a cast iron skillet but any oven-proof skillet will work. Sprinkle with powdered sugar just before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8549996.jpg", "meta": [["prep:", "25 mins"], ["cook:", "50 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 large eggs", "¾ cup brown sugar", "⅓ cup all-purpose flour", "¼ teaspoon salt", "1 ½ cups milk", "1 tablespoon vanilla extract"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "Mix eggs and brown sugar in a bowl until smooth. Whisk in flour and salt. Slowly add milk, stirring constantly until well combined. Stir in vanilla extract and set aside to rest.", "Melt butter, brown sugar, and water in a 10 1/4-inch cast iron skillet over medium-high heat. Stir frequently until mixture starts to boil. Reduce heat to medium; swirl skillet, but do not stir, until mixture starts to thicken, about 2 minutes. Add apples and cinnamon. Cook and stir until apples are crisp-tender and starting to brown, 15 to 18 minutes. Remove from heat.", "Stir egg mixture and pour over the apples in the skillet.", "Bake in the preheated oven until edges are golden brown and custard is set, 28 to 35 minutes."], "facts": "276 calories; protein 5.5g 11% DV; carbohydrates 40.5g 13% DV; fat 10.8g 17% DV; cholesterol 115.7mg 39% DV; sodium 185.2mg 7% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/17515/quiche-lorraine-i/", "name": "Quiche Lorraine I", "summary": "\nBacon, Swiss cheese and onions mingle in perfect harmony amidst the eggs and cream in this timeless classic. Perfect for breakfast, brunch, lunch, dinner or just an indulgent snack! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7274352.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["additional:", "10 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "6"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (9 inch) prepared pie crust", "12 slices bacon", "1 cup shredded Swiss cheese", "⅓ cup minced onion", "4  eggs, beaten", "2 cups light cream", "¾ teaspoon salt", "¼ teaspoon white sugar", "⅛ teaspoon cayenne pepper"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "Place bacon in a large skillet, and fry over medium-high heat until crisp. Drain on paper towels, then chop coarsely. Sprinkle bacon, cheese and onion into pastry shell.", "In a medium bowl, whisk together eggs, cream, salt, sugar and cayenne pepper. Pour mixture into pastry shell.", "Bake 15 minutes in the preheated oven. Reduce heat to 300 degrees F (150 degrees C), and bake an additional 30 minutes, or until a knife inserted 1 inch from edge comes out clean. Allow quiche to sit 10 minutes before cutting into wedges."], "facts": "761 calories; protein 19.2g 38% DV; carbohydrates 18.7g 6% DV; fat 68.1g 105% DV; cholesterol 267.1mg 89% DV; sodium 1021.7mg 41% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19037/dessert-crepes/", "name": "Dessert Crepes", "summary": "\nEssential crepe recipe.  Sprinkle warm crepes with sugar and lemon, or serve with cream or ice cream and fruit. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4511555.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "8 crepes"]], "ingredients": ["4  eggs, lightly beaten", "1 ⅓ cups milk", "2 tablespoons butter, melted", "1 cup all-purpose flour", "2 tablespoons white sugar", "½ teaspoon salt"], "direction": ["In large bowl, whisk together eggs, milk, melted butter, flour sugar and salt until smooth.", "Heat a medium-sized skillet or crepe pan over medium heat. Grease pan with a small amount of butter or oil applied with a brush or paper towel.  Using a serving spoon or small ladle, spoon about 3 tablespoons crepe batter into hot pan, tilting the pan so that bottom surface is evenly coated.  Cook over medium heat, 1 to 2 minutes on a side, or until golden brown.  Serve immediately."], "facts": "164 calories; protein 6.4g 13% DV; carbohydrates 17.2g 6% DV; fat 7.7g 12% DV; cholesterol 111.1mg 37% DV; sodium 234.5mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/8669/chicken-cordon-bleu-ii/", "name": "Chicken Cordon Bleu II", "summary": "\n'Cordon Bleu' is a French term, literally translated as 'blue ribbon', that originally referred to an award for culinary excellence given to women cooks! The term can now apply to any superior cook (yes, men too), and also to this dish (chicken, ham and Swiss cheese slices, breaded and sauteed). This yummy version adds paprika and a creamy white wine sauce worthy of its own blue ribbon. Two blue ribbon tastes in wedded bliss -- Chicken Cordon Bleu II! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535588.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  skinless, boneless chicken breast halves", "6 slices Swiss cheese", "6 slices ham", "3 tablespoons all-purpose flour", "1 teaspoon paprika", "6 tablespoons butter", "½ cup dry white wine", "1 teaspoon chicken bouillon granules", "1 tablespoon cornstarch", "1 cup heavy whipping cream"], "direction": ["Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.", "Heat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.", "Remove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm."], "facts": "584 calories; protein 41.6g 83% DV; carbohydrates 7.7g 3% DV; fat 40.9g 63% DV; cholesterol 195.3mg 65% DV; sodium 655.3mg 26% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/9954/french-butter-cakes-madeleines/", "name": "French Butter Cakes (Madeleines)", "summary": "\nSponge cake cookie--in shell shaped molds. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6380557.jpg", "meta": [["Servings:", "12"], ["Yield:", "1 dozen"]], "ingredients": ["2  eggs", "¾ teaspoon vanilla extract", "⅛ teaspoon salt", "⅓ cup white sugar", "½ cup all-purpose flour", "1 tablespoon lemon zest", "¼ cup butter", "⅓ cup granulated sugar for decoration"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).    Butter and flour 12 (3 inch) madeleine molds; set aside.", "Melt butter and let cool to room temperature.", "In a small mixing bowl, beat eggs, vanilla and salt at high speed until light.", "Beating constantly, gradually add sugar; and continue beating at high speed until mixture is thick and pale and ribbons form in bowl when beaters are lifted, 5 to 10 minutes.", "Sift flour into egg mixture 1/3 at a time, gently folding after each addition.", "Add lemon zest and pour melted butter around edge of batter.  Quickly but gently fold butter into batter.  Spoon batter into molds; it will mound slightly above tops.", "Bake 14 to 17 minutes, or until cakes are golden and the tops spring back when gently pressed with your fingertip.", "Use the tip of the knife to loosen madeleines from pan; invert onto rack.  Immediately sprinkle warm cookies with granulated sugar.  Madeleines are best eaten the day they're baked.  Leftover madeleines are wonderful when dunked into coffee or tea.", "Variation: Chocolate Madeleines: Omit lemon zest.  Increase sugar to 1/2 cup.  Substitute 1/4 cup unsweetened cocoa powder for 2 tablespoons of the flour; sift into batter with flour."], "facts": "109 calories; protein 1.6g 3% DV; carbohydrates 15.3g 5% DV; fat 4.7g 7% DV; cholesterol 41.2mg 14% DV; sodium 63.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/236780/the-best-lemon-vinaigrette/", "name": "The Best Lemon Vinaigrette", "summary": "\nThis is one of my favorite salad dressings. It works for a simple salad or with crispy Parmesan chicken with a cool salad on top. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3709611.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "8"], ["Yield:", "1 cup"]], "ingredients": ["¼ cup red wine vinegar", "2 tablespoons Dijon mustard", "1 teaspoon dried oregano", "1 clove garlic, minced", "½ teaspoon kosher salt", "¼ teaspoon ground black pepper", "½ cup olive oil", "2 tablespoons fresh lemon juice"], "direction": ["Whisk red wine vinegar, Dijon mustard, oregano, garlic, salt, and black pepper together in a small bowl. Slowly stream olive oil into the vinegar mixture while whisking briskly. Beat lemon juice into the mixture.", "Pour dressing into a sealable jar or bottle, seal, and shake until emulsified."], "facts": "128 calories; protein 0.1g; carbohydrates 1.9g 1% DV; fat 13.5g 21% DV; cholesterol 0mg; sodium 214.2mg 9% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/18076/southern-style-french-onion-soup/", "name": "Southern Style French Onion Soup", "summary": "\nThis is a simple, tasty recipe for a homemade French onion soup. With this recipe, you will receive many compliments. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F113580.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 tablespoons butter", "1  onion, sliced", "½ teaspoon dried thyme", "5 (10.5 ounce) cans beef consomme", "6  bay leaves", "½ cup white wine  (Optional)", "1  French baguette, cut into 1/2 inch slices", "2 cups shredded mozzarella cheese"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).", "Melt the butter in a large skillet over medium high heat. Place the onion in the butter and saute for 5 to 10 minutes, or until tender. Stir in the thyme and remove from heat.", "In a large pot over high heat, combine the consomme, bay leaves and white wine, if desired. Bring to a boil, reduce heat to low, stir in the sauteed onions and allow to heat through, about 10 to 15 minutes.", "Ladle soup into 4 individual oven-safe bowls, filling each about 3/4 of the way. Top each bowl with 2 slices of baguette bread and then cover each with the cheese.", "Bake at 375 degrees F (190 degrees C) for 10 to 15 minutes, or until cheese is melted and bubbly."], "facts": "662 calories; protein 30.5g 61% DV; carbohydrates 69.1g 22% DV; fat 27g 42% DV; cholesterol 74.8mg 25% DV; sodium 2388.6mg 96% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/19843/lyonnaise-potatoes/", "name": "Lyonnaise Potatoes", "summary": "\nThis is a classic dish with sliced potatoes and onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F308640.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "6"], ["Yield:", "4 to 6 servings"]], "ingredients": ["2 pounds russet potatoes", "2 tablespoons olive oil", "4  onions, thinly sliced", "2 tablespoons chopped garlic", "½ cup butter", "salt to taste", "ground white pepper, to taste", "1 tablespoon finely minced fresh parsley"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Peel potatoes and cut into 1/2 inch slices. Place sliced potatoes in a pot and cover with water. Bring to a boil. Allow to boil 2 minutes, then drain and set aside.", "Heat a large ovenproof skillet over medium-high heat. Pour in olive oil, then add onions. Saute until lightly caramelized, 8 to 10 minutes. Stir in garlic and saute until onions are deep brown and garlic is soft. Transfer mixture to a bowl.", "Place skillet back on stove over low heat. Melt butter, then cover bottom of pan with 1/3 of potatoes. Season with salt and pepper. Cover potatoes with 1/2 of onion mixture. Cover with 1/2 of remaining potatoes and season with salt and pepper. Spread with the rest of onion mixture. Cover with remaining potatoes, and season with more salt and pepper.", "Bake in preheated oven for 10 to 12 minutes, or until potatoes are tender and browned on top. Remove from oven and use a spatula to carefully transfer potatoes to a serving platter. Sprinkle with chopped parsley just before serving."], "facts": "325 calories; protein 3.5g 7% DV; carbohydrates 34.6g 11% DV; fat 20.1g 31% DV; cholesterol 40.7mg 14% DV; sodium 118.9mg 5% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/269652/tuscan-pork-tenderloin/", "name": "Tuscan Pork Tenderloin", "summary": "\nThis is a very easy weeknight pork tenderloin recipe that is also keto-friendly. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6155203.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["additional:", "5 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 teaspoons garlic, minced", "2 teaspoons dried rosemary", "2 teaspoons dried oregano", "1 teaspoon salt", "1 teaspoon ground black pepper", "4 pounds pork tenderloin"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C).", "Combine garlic, rosemary, oregano, salt, and pepper in a small bowl. Rub spice mixture all over the pork tenderloin. Place in a baking dish.", "Bake in the preheated oven until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove from oven and let stand for 5 minutes before slicing."], "facts": "183 calories; protein 26.9g 54% DV; carbohydrates 0.7g; fat 7.3g 11% DV; cholesterol 84.2mg 28% DV; sodium 251.5mg 10% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/269557/chocolate-yule-log/", "name": "Chocolate Yule Log", "summary": "\nIf you haven't tried this classic holiday dessert because you thought it required advanced baking and pastry skill, then get ready to buche up this Noel, since the techniques required are actually quite simple. This classic holiday dessert is a showstopper, but it's often better looking than it is tasting, which is not the case here, thanks to a simple-to-make, rich chocolate sponge cake, and mocha buttercream filling. Garnished here with meringue mushrooms and rosemary. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6100205.jpg", "meta": [["prep:", "50 mins"], ["cook:", "10 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs 30 mins"], ["Servings:", "10"], ["Yield:", "1 13-inch Yule log"]], "ingredients": ["1 ⅔ cups powdered sugar", "½ cup butter, at room temperature", "1 ½ tablespoons unsweetened cocoa powder", "1 pinch salt", "2 tablespoons coffee-flavored liqueur", "⅓ cup mascarpone cheese"], "direction": ["Whip powdered sugar, butter, cocoa powder, salt, and coffee liqueur together in the bowl of a stand mixer on high speed. Transfer buttercream into a separate bowl and add mascarpone cheese. Mix until combined; set aside.", "Preheat the oven to 400 degrees F (200 degrees C). Brush a little melted butter over a 13x18-inch rimmed sheet pan. Line pan with parchment paper and brush remaining melted butter on top.", "Combine cocoa powder, salt, and flour together in a bowl; whisk or sift to break up clumps.", "Place eggs in the clean bowl of your stand mixer. Add sugar and whip until fluffy, thick, and very light in color. Add 1/2 of the cocoa powder mixture and vanilla extract; mix on low speed for a few seconds. Beat in remaining cocoa mixture on low for a few seconds. Switch to high speed; stop once mixture is moistened but not fully blended. Pull off the whisk attachment and whisk batter with it until evenly blended.", "Pour batter onto the prepared sheet pan and spread out with a spatula, leaving some room around the edges. Tap pan on the counter to knock out the large bubbles.", "Bake in the preheated oven until top is dry and edges start to pull away from the sides, 8 to 10 minutes.", "Dust a clean kitchen towel with enough powdered sugar to cover an area slightly larger than the sponge cake. Remove cake from the oven. Run a knife around the edges of the pan. Sprinkle some powdered sugar over the top. Run a spatula under the parchment paper to make sure it's not stuck to the pan.", "Quickly flip pan on top of the sugared area to invert the cake. Remove parchment paper and dust cake with more powdered sugar. Gently roll cake up inside the towel; allow to cool for 15 minutes.", "Unroll cake and dollop buttercream on top, reserving some for later. Spread frosting to the edges. Roll cake up over the frosting, using the towel to lift it if needed. Sprinkle more powdered sugar on top. Wrap log in plastic wrap. Refrigerate until firm, about 2 hours.", "Combine chocolate chips and hot cream in a bowl. Let sit for 1 minute. Whisk until chocolate melts.", "Make an angled cut 3 inches from one end of the log. Place log on a parchment-lined sheet pan. Apply some buttercream to the angled slice and attach it to one side. Spread a layer of ganache all over the cake, except for the swirls. Refrigerate for 15 minutes to firm up ganache.", "Carve lines into the ganache using the tip of a knife to create the appearance of tree bark. Refrigerate until completely chilled before serving. Dust with cocoa powder and powdered sugar."], "facts": "526 calories; protein 6.4g 13% DV; carbohydrates 55.7g 18% DV; fat 33.7g 52% DV; cholesterol 165.4mg 55% DV; sodium 245.4mg 10% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/234930/how-to-make-bordelaise-sauce/", "name": "How to Make Bordelaise Sauce", "summary": "\nThis is a simple version of the classic French red wine and shallot reduction sauce. It's fantastic on a steak, roast beef, or whatever! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7681145.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "6"], ["Yield:", "1 cup"]], "ingredients": ["1 teaspoon butter", "4 large shallots, peeled and sliced", "1 pinch salt", "1 cup red wine", "2 cups veal stock", "salt and freshly ground black pepper to taste"], "direction": ["Place butter and shallots into a saucepan with pinch of salt; cook and stir shallots over medium-low heat until caramelized and browned, about 20 minutes. Stir occasionally. Add red wine and bring to a simmer.", "Reduce heat to low; cook until wine is nearly evaporated and pan juices are thick and slightly syrupy. Watch carefully, mixture burns easily. Add veal stock, return to a simmer, and cook until reduced by half and sauce is slightly thickened, about 10 minutes.", "Pour sauce through a fine mesh strainer set over a container. Tap the strainer with a spoon while straining and squeeze out the last remaining drops of sauce from the residue. Season sauce to taste with salt and black pepper."], "facts": "82 calories; protein 2.4g 5% DV; carbohydrates 8.9g 3% DV; fat 1.1g 2% DV; cholesterol 1.8mg 1% DV; sodium 40.4mg 2% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/18411/ratatouille/", "name": "Ratatouille", "summary": "\nThis terrific dish is loaded with succulent Mediterranean vegetables. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F818555.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons olive oil", "3 cloves garlic, minced", "2 teaspoons dried parsley", "1  eggplant, cut into 1/2 inch cubes", "salt to taste", "1 cup grated Parmesan cheese", "2  zucchini, sliced", "1 large onion, sliced into rings", "2 cups sliced fresh mushrooms", "1  green bell pepper, sliced", "2 large tomatoes, chopped"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Coat bottom and sides of a 1 1/2 quart casserole dish with 1 tablespoon olive oil.", "Heat remaining 1 tablespoon olive oil in a medium skillet over medium heat. Cook and stir garlic until lightly browned. Mix in parsley and eggplant. Cook and stir until eggplant is soft, about 10 minutes. Season with salt to taste.", "Spread eggplant mixture evenly across bottom of prepared casserole dish. Sprinkle with a few tablespoons of Parmesan cheese. Spread zucchini in an even layer over top. Lightly salt and sprinkle with a little more cheese. Continue layering in this fashion, with onion, mushrooms, bell pepper, and tomatoes, covering each layer with a sprinkling of salt and cheese.", "Bake in preheated oven for 45 minutes."], "facts": "251 calories; protein 12.7g 25% DV; carbohydrates 24.3g 8% DV; fat 13.5g 21% DV; cholesterol 17.6mg 6% DV; sodium 327.4mg 13% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/228041/steelhead-trout-bake-with-dijon-mustard/", "name": "Steelhead Trout Bake with Dijon Mustard", "summary": "\nThis is really yummy - not overpoweringly mustardy! And, after all, any recipe that begins with white wine has to be good! It's not oily or buttery or anything. I've made it with salmon, and it's equally tasty. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3471537.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["cooking spray", "1 pound skinless steelhead trout fillets", "¼ cup dry white wine", "2 ½ tablespoons Dijon mustard", "2 cloves garlic, pressed", "1 tablespoon lemon juice", "1 teaspoon dried dill weed", "1 teaspoon lemon-pepper seasoning"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking dish with cooking spray.", "Arrange trout fillets in the baking dish. Mix white wine, Dijon mustard, garlic, lemon juice, dill, and lemon-pepper seasoning in a bowl; spread over the fillets, letting some run underneath the fish.", "Bake in the preheated oven until the fish is opaque and flakes easily, 10 to 15 minutes."], "facts": "145 calories; protein 19.2g 38% DV; carbohydrates 3.4g 1% DV; fat 4.2g 6% DV; cholesterol 93.8mg 31% DV; sodium 416.9mg 17% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/16602/cordon-bleu-chicken-rolls/", "name": "Cordon Bleu Chicken Rolls", "summary": "\nThis is the best Chicken Cordon Bleu recipe! Chicken stuffed with ham and Swiss cheese. I hope you enjoy it as much as I have. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F371879.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 to 8 servings"]], "ingredients": ["8  skinless, boneless chicken breasts", "8 slices cooked ham", "4 slices Swiss cheese, cut into 1 inch pieces", "salt and pepper to taste", "1 teaspoon dried thyme", "¼ cup melted butter", "½ cup cornflakes cereal crumbs", "1 (10.75 ounce) can  condensed cream of chicken soup", "½ cup sour cream", "1 teaspoon lemon juice"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Place each chicken breast half between sheets of plastic wrap and pound with a meat mallet to about 1/8 inch thickness. Place a finger of cheese on each ham slice and sprinkle lightly with thyme and salt and pepper to taste. Roll up seasoned ham and cheese 'jellyroll-style', then roll each chicken breast with ham and cheese inside. Tuck in ends and fasten with toothpicks.", "Place melted butter in a small bowl and place cereal crumbs in a shallow dish or bowl. Dip each chicken roll in butter or margarine, then roll in crumbs, turning to coat thoroughly. Place coated rolls in a lightly greased 9x13 inch baking dish.", "Bake at 400 degrees F (200 degrees C) for about 40 minutes or until chicken is golden brown and juices run clear. Serve with cordon bleu sauce, if desired.", "To Make Cordon Bleu Sauce: In a small saucepan mix together the soup, sour cream and lemon juice. Heat over low heat, stirring occasionally, and serve hot over chicken rolls. Makes about 2 cups; 8 servings of 1/4 cup each."], "facts": "490 calories; protein 50g 100% DV; carbohydrates 14g 5% DV; fat 25.1g 39% DV; cholesterol 162.8mg 54% DV; sodium 1079.8mg 43% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/235275/how-to-make-french-baguettes/", "name": "How to Make French Baguettes", "summary": "\nI always thought you can't make real French baguettes at home, but once I tried it I realized I was wrong. Again. You're going to be fairly shocked when you realize just how simple this is. The only way to make bread this any more French is to put some butter on it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1684614.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["additional:", "14 hrs 30 mins"], ["total:", "15 hrs 5 mins"], ["Servings:", "6"], ["Yield:", "2 large or 4 small baguettes"]], "ingredients": ["¼ teaspoon rapid rise yeast", "1 ½ cups water at room temperature", "1 ¾ teaspoons salt", "4 cups all-purpose flour, or as needed", "½ teaspoon cornmeal, or as needed"], "direction": ["Place yeast into the bottom of a large mixing bowl and stir with water; mix in salt. Beat flour into yeast mixture with a wooden spoon until dough is thick and sticky and pulls flour from the side of the bowl, 5 to 10 minutes.", "Cover bowl with plastic wrap and let stand in a turned-off oven until doubled in size, 12 to 14 hours. Dough will be bubbly and very sticky.", "Place a silicone baking mat onto a baking sheet and dust generously with cornmeal.", "Use a floured spatula to scrape dough out onto a well-floured work surface and dust dough with flour. With well-floured hands, pat dough into a rectangle and cut into 4 equal-size pieces.", "Dust a piece of dough with flour and use your floured fingers to gently roll and stretch it out into a log about 10 inches long and 1 1/2 inches around. Gently transfer to prepared baking sheet. If desired, wipe off excess cornmeal with a damp paper towel. Repeat with another piece of dough. (Reserve remaining dough to bake later or prepare 2 baking sheets to bake all 4 at once). Dust loaves lightly with flour. Dust a large piece of plastic wrap with flour and drape plastic lightly over the baking sheet with floured side down.", "Let loaves rise, covered, until doubled, 1 to 1 1/2 hour.", "Move oven racks to the bottom and middle positions. Preheat oven to 500 degrees F (260 degrees C) or as high as your oven will go. Place an oven-safe baking dish full of water into bottom rack of the oven.", "Use a sharp kitchen shears to cut 4 or 5 angled slashes into the top of each loaf. Poke down the little sharp tips of dough left by the scissors. Spray loaves with water, using a spray bottle.", "Bake in the preheated oven until baguettes are browned, about 15 minutes, spraying loaves with water after 5 minutes and 10 minutes. Turn the pan around on the second spraying.", "Transfer baguettes to a cooling rack and let cool to room temperature before slicing with a serrated knife."], "facts": "305 calories; protein 8.7g 17% DV; carbohydrates 63.8g 21% DV; fat 0.8g 1% DV; cholesterol 0mg; sodium 681.8mg 27% DV."}, {"type": "By Cuisine  ", "package": "french_recipes", "link": "https://www.allrecipes.com/recipe/12926/french-onion-soup-i/", "name": "French Onion Soup I", "summary": "\nThe best onion soup you will ever have!!!!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1123139.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "3  onions, thinly sliced", "1 teaspoon white sugar", "1 tablespoon all-purpose flour", "2 ½ cups water", "½ cup red wine", "2 (10.5 ounce) cans condensed beef broth", "1  French baguette", "8 ounces sliced Swiss cheese"], "direction": ["Melt butter or margarine in a 4 quart saucepan.  Stir in sugar.  Cook onions over medium heat for 10 minutes, or until golden brown.", "Stir in flour until well blended with the onions and pan juices.  Add water, wine, and beef broth; heat to boiling.  Reduce heat to low.  Cover soup, and simmer for 10 minutes.", "Cut four 1 inch thick slices of bread from the loaf.  Toast the bread slices at  325 degrees F (165 degrees C)  just until browned, about 10 minutes.  Reserve the remaining bread to serve with the soup.", "Ladle soup into four 12 ounce, oven-safe bowls.  Place 1 slice toasted bread on top of the soup in each bowl.  Fold Swiss cheese slices, and fit onto toasted bread slices.  Place soup bowls on a cookie sheet for easier handling.", "Bake at  425 degrees F (220 degrees C) for 10 minutes, or just until cheese is melted"], "facts": "732 calories; protein 33.4g 67% DV; carbohydrates 79.3g 26% DV; fat 29.4g 45% DV; cholesterol 88.6mg 30% DV; sodium 2004.2mg 80% DV."}]