[{"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/85935/jaeger-schnitzel/", "name": "Jaeger Schnitzel", "summary": "\nThis is wonderful. Breaded and fried cubed pork with mushrooms and hunter gravy over a bed of noodles. Serve with a salad and a hunk of thick crusty bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1517732.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 pounds boneless pork chops, cubed", "oil for frying", "2  eggs, beaten", "plain bread crumbs", "3 (1 ounce) packages dry mushroom gravy mix", "1 pound fresh mushrooms, coarsely chopped", "1 (16 ounce) package dry egg noodles"], "direction": ["Pound out cubed pork, and cut in half.", "Heat oil in a large skillet or Dutch oven over medium heat. Dip pork in egg, then bread crumbs, and place in hot oil. Cook, turning, until golden brown. Remove to a warm plate.", "Prepare gravy mix according to package directions. Stir in mushrooms, and cook with gravy.", "Meanwhile, bring a large pot of lightly salted water to a boil. Add the egg noodles, and cook until al dente, about 8 to 10 minutes; drain.", "Serve pork over noodles and smother with gravy."], "facts": "455 calories; protein 38.6g 77% DV; carbohydrates 53.5g 17% DV; fat 9.1g 14% DV; cholesterol 168.7mg 56% DV; sodium 828mg 33% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228363/crispy-roasted-chicken/", "name": "Crispy Roasted Chicken", "summary": "\nThis oven-roasted chicken is inspired by the Brathaehnchen served commonly in Bavarian Biergartens, small shops, and food carts. You can serve this chicken with many side dishes, but favorites are fried potatoes or spaetzle and a nice garden salad. Weiss beer doesn't hurt at all! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1000798.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 teaspoon kosher salt", "½ teaspoon caraway seeds", "½ teaspoon dried sage", "¼ teaspoon fennel seeds", "¼ teaspoon coriander seeds", "¼ teaspoon dried rosemary", "2 tablespoons paprika", "2 teaspoons garlic powder", "2 teaspoons all-purpose flour", "1 teaspoon onion powder", "5 tablespoons vegetable oil", "1 (4 pound) broiler-fryer chicken, cut in half lengthwise"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "In a spice grinder or mortar, combine kosher salt, caraway seeds, sage, fennel, coriander, and rosemary. Grind to a coarse powder. Transfer spice mixture to a bowl and stir in paprika, garlic powder, flour, and onion powder; mix in vegetable oil to make a smooth paste.", "Pat chicken halves dry with paper towels and tuck wing tips up behind the back. Brush spice paste onto chicken halves, coating both sides, taking care to season under wings and legs. Place chicken halves in baking dish or roasting pan with skin sides up, leaving space around chicken so halves aren't touching.", "Roast in preheated oven until a thermometer inserted in a thigh reads 165 degrees F (74 degrees C), about 1 hour. Remove from oven and let rest for 10 minutes before slicing."], "facts": "495 calories; protein 41.5g 83% DV; carbohydrates 3.1g 1% DV; fat 34.5g 53% DV; cholesterol 129.3mg 43% DV; sodium 445.6mg 18% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221947/ulis-apple-red-cabbage/", "name": "Uli's Apple Red Cabbage", "summary": "\nMy grandmother was a master housewife. She taught home economics and she could cook. When she cooked this apple red cabbage my brother and I would eat it hot or cold, with or without potatoes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1517728.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 tablespoons butter", "½ cup thick-cut bacon, diced", "½ cup diced onion", "2 cups chicken broth", "½ cup red wine, or to taste", "1 large apple, peeled and sliced", "2 tablespoons apple cider vinegar, or to taste", "2 teaspoons white sugar, or to taste", "4  whole cloves", "3  bay leaves", "¼ teaspoon ground nutmeg, or to taste", "1 pinch ground cinnamon, or to taste", "salt and ground pepper to taste", "2 ¼ pounds shredded red cabbage"], "direction": ["Melt butter in a stockpot over medium-high heat. Stir in bacon and cook until just beginning to crisp, 4 to 6 minutes. Add onions; cook and stir until onions are lightly browned and translucent, 6 to 8 minutes.", "Stir in chicken broth, red wine, apple slices, and apple cider vinegar; bring to a boil. Stir in sugar, cloves, bay leaves, nutmeg, cinnamon, salt, and black pepper. Stir in red cabbage; cover, reduce heat to low, and simmer until cabbage is soft and cooked through, 30 to 45 minutes."], "facts": "151 calories; protein 3.7g 7% DV; carbohydrates 16.2g 5% DV; fat 7.7g 12% DV; cholesterol 20.5mg 7% DV; sodium 401.9mg 16% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/218445/lengenbergs-boiled-potatoes/", "name": "Lengenberg's Boiled Potatoes", "summary": "\nThis is the perfect simple side dish for a couple of German bratwursts or schnitzel. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4559646.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 ¼ pounds medium yellow-flesh potatoes (such as Yukon gold), scrubbed, eyes removed", "1 pinch salt", "⅓ cup chopped fresh parsley"], "direction": ["Place potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Sprinkle on parsley and serve hot."], "facts": "204 calories; protein 5.4g 11% DV; carbohydrates 46.2g 15% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 56.9mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/11793/german-spaetzle-dumplings/", "name": "German Spaetzle Dumplings", "summary": "\nTraditional German dumplings.  You can also mince a few pieces of bacon in a pan, and heat the cooked spaetzle in the bacon drippings-only omit the butter, if preparing recipe with bacon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1658933.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup all-purpose flour", "¼ cup milk", "2  eggs", "½ teaspoon ground nutmeg", "1 pinch freshly ground white pepper", "½ teaspoon salt", "1 gallon hot water", "2 tablespoons butter", "2 tablespoons chopped fresh parsley"], "direction": ["Mix together flour, salt, white pepper, and nutmeg.  Beat eggs well, and add alternately with the milk to the dry ingredients.  Mix until smooth.", "Press dough through spaetzle maker, or a large holed sieve or metal grater.", "Drop a few at a time into simmering liquid.  Cook 5 to 8 minutes.  Drain well.", "Saute cooked spaetzle in butter or margarine.  Sprinkle chopped fresh parsley on top, and serve."], "facts": "141 calories; protein 4.7g 9% DV; carbohydrates 16.8g 5% DV; fat 6g 9% DV; cholesterol 73mg 24% DV; sodium 268.6mg 11% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/8039/bee-sting-cake-bienenstich-ii/", "name": "Bee Sting Cake (Bienenstich) II", "summary": "\nMmmm!!  This German dessert is my boyfriend's and  my favourite!!  It is bread like with a sugary-almond crunchy crust and a vanilla pudding filling!  MUST TRY! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F270399.jpg", "meta": [["Servings:", "16"], ["Yield:", "16 - 1 x 2 inch cakes"]], "ingredients": ["1 ⅝ cups all-purpose flour", "1 tablespoon active dry yeast", "2 tablespoons white sugar", "1 pinch salt", "¾ cup lukewarm milk", "3 tablespoons butter", "3 tablespoons butter", "1 ½ tablespoons confectioners' sugar", "1 tablespoon milk", "⅝ cup sliced almonds", "1 tablespoon honey  (Optional)", "1 ½ cups milk", "⅓ cup cornstarch", "1 tablespoon white sugar", "1  egg, beaten", "1 teaspoon almond extract", "1 cup heavy whipping cream", "½ tablespoon cream of tartar"], "direction": ["Combine flour, yeast, 2 tablespoons sugar, salt, 3/4 cup milk, and 3 tablespoons butter or margarine.  Turn dough out onto a lightly floured surface.  Knead until smooth and elastic, about 15 to 20 minutes.  Place in a well greased bowl, and cover.  Let rise in a warm place for 1 hour, or until doubled.", "Punch down the dough.  Roll out to a 1/2 inch thickness.  Spread  into a greased 8 inch square baking pan.  Cover, and let rise for 30 minutes.", "Melt 3 tablespoons butter or margarine and confectioner's sugar in a saucepan.  Add almonds and 1 tablespoon milk.  Remove from heat, and stir in honey.  Spread evenly and carefully onto the dough.  Allow dough to continue to rise for an additional 30 minutes.", "Bake at 400 degrees F (205 degrees C) for 20 to 25 minutes, or until crust turns golden brown. Cool completely on a wire rack.", "Dissolve cornstarch in a little milk.  Combine 1 1/2 cups milk, cornstarch, and 1 tablespoon sugar inn the top of a double boiler.  Heat while stirring until thickened, about 2 to 3 minutes.  Add in beaten egg, and keep stirring  for about 2 more minutes, or until thick.  Remove from heat, and stir in extract.  Chill, covered, in refrigerator for at least 1 hour.  Beat the whipping cream with the cream of tartar until stiff.  Fold into the chilled pudding.", "Cut the cooled almond crust bread into 1 1/4 x 2 inch rectangles.  Slice each horizontally into halves.   Fill with pudding mixture.  Chill, and serve cold."], "facts": "226 calories; protein 4.9g 10% DV; carbohydrates 20.2g 7% DV; fat 14.4g 22% DV; cholesterol 46.3mg 15% DV; sodium 56.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/85194/semmelknoedel-bread-dumplings/", "name": "Semmelknoedel (Bread Dumplings)", "summary": "\nMy Bavarian Oma made these large dumplings to accompany roast pork or game dishes, any meat with gravy, or with mushrooms in a creamy sauce. Serve one dumpling alongside your dish, and cover with a little gravy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54812.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (1 pound) loaf stale French bread, cut into 1 inch cubes", "1 cup milk", "2 tablespoons butter", "1  onion, finely chopped", "1 tablespoon chopped fresh parsley", "2  eggs", "½ teaspoon salt", "1 pinch ground black pepper", "½ cup dry bread crumbs  (Optional)"], "direction": ["Place the bread cubes into a large bowl. Heat the milk until it starts to bubble at the edges, then pour it over the bread cubes. Stir briefly to coat the bread.  Let soak for 15 minutes.", "Meanwhile, melt the butter in a skillet over medium heat. Add the onions; cook and stir until tender. Stir in the parsley, and remove from the heat. Mix into the bowl with the bread along with the eggs, salt and pepper. Use your hands, squeezing the dough through your fingers until it is smooth and sticky.", "Bring a large pot of lightly salted water to a boil. The water should be at least 3 or 4 inches deep. When the water is boiling, make a test dumpling about the size of a small orange or tangerine, by patting and cupping between wet hands. Gently drop into the boiling water. If it falls apart, the dough is too wet. In this case, stir some bread crumbs into the rest of the dumpling batter.", "Form the remaining dough into large dumplings, and carefully drop into the boiling water. Simmer for 20 minutes, then remove to a serving plate with a large slotted spoon. They should come out soft, spongy and delicious!"], "facts": "506 calories; protein 20.5g 41% DV; carbohydrates 78.8g 25% DV; fat 12.3g 19% DV; cholesterol 113.1mg 38% DV; sodium 1220.1mg 49% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/171660/kaiserschmarren/", "name": "Kaiserschmarren", "summary": "\nA German dessert that tastes like something in between a pancake and a waffle.  It's also good for breakfast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1354614.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  eggs, separated", "½ cup milk", "½ cup white sugar", "1 pinch salt", "1 cup all-purpose flour", "⅔ cup raisins  (Optional)", "1 tablespoon butter", "2 tablespoons confectioners' sugar", "2 cups applesauce  (Optional)"], "direction": ["Beat the egg whites in a clean bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Beat the egg yolks in a separate bowl until smooth; mix in the milk, sugar, salt, flour, and raisins until just moistened. Fold in the egg whites.", "Melt the butter in a large skillet over medium heat. Pour the batter into the skillet and cook until golden brown; flip and cook until set on the other side, about 1 minute. Tear the kaiserschmarren into pieces using two forks and continue cooking until golden brown, about 2 minutes. Sprinkle with confectioners' sugar to garnish and serve with applesauce."], "facts": "472 calories; protein 11.6g 23% DV; carbohydrates 89.9g 29% DV; fat 8.9g 14% DV; cholesterol 196.1mg 65% DV; sodium 109.1mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/", "name": "Juicy Roasted Chicken", "summary": "\nMy grandmother's recipe for roasted chicken. We are German and she used to do it this way all the time. I never have had a chicken this juicy before; this little trick works and makes the people eating it go silent. It's funny. We nibble on the celery after. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389250.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["additional:", "15 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (3 pound) whole chicken, giblets removed", "salt and black pepper to taste", "1 tablespoon onion powder, or to taste", "½ cup margarine, divided", "1 stalk celery, leaves removed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.", "Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."], "facts": "423 calories; protein 30.9g 62% DV; carbohydrates 1.2g; fat 32.1g 49% DV; cholesterol 97mg 32% DV; sodium 661.9mg 27% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7915/german-apple-cake-i/", "name": "German Apple Cake I", "summary": "\nThis German Apple Cake is a moist dense cake that keeps well. It has been a family favorite for twenty years. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2327614.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 -9x13 inch cake"]], "ingredients": ["2  eggs", "1 cup vegetable oil", "2 cups white sugar", "2 teaspoons ground cinnamon", "½ teaspoon salt", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "4 cups apples - peeled, cored and diced"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch cake pan.", "In a mixing bowl; beat oil and eggs with an electric mixer until creamy. Add the sugar and vanilla and beat well.", "Combine the flour salt, baking soda, and ground cinnamon together in a bowl. Slowly add this mixture to the egg mixture and mix until combined. The batter will be very thick. Fold in the apples by hand using a wooden spoon. Spread batter into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for 45 minutes or until cake tests done. Let cake cool on a wire rack. Once cake is cool serve with a dusting of confectioners' sugar or with a Cream Cheese Frosting."], "facts": "201 calories; protein 1.7g 3% DV; carbohydrates 27.7g 9% DV; fat 9.7g 15% DV; cholesterol 15.5mg 5% DV; sodium 107.2mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221361/traditional-sauerbraten/", "name": "Traditional Sauerbraten", "summary": "\nI found two slightly different hand written versions of this, my Grandmother's recipe. Born in Nekkar am Rhein in the 1904, she naturally learned to cook traditional German meals as a young woman and didn't rely on a cookbook. I try to capture the nuance in this. Serve with potato dumplings. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888826.jpg", "meta": [["prep:", "15 mins"], ["cook:", "4 hrs"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds beef rump roast", "2 large onions, chopped", "1 cup red wine vinegar, or to taste", "1 cup water", "1 tablespoon salt", "1 tablespoon ground black pepper", "1 tablespoon white sugar", "10  whole cloves, or more to taste", "2  bay leaves, or more to taste", "2 tablespoons all-purpose flour", "salt and ground black pepper to taste", "2 tablespoons vegetable oil", "10  gingersnap cookies, crumbled"], "direction": ["Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.", "Season flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.", "Heat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes. Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours. Remove beef to a platter and slice.", "Strain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened about 10 minutes. Serve gravy over sliced beef."], "facts": "456 calories; protein 40.7g 81% DV; carbohydrates 20.9g 7% DV; fat 22.3g 34% DV; cholesterol 100.3mg 33% DV; sodium 1682.5mg 67% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/216330/german-pork-chops-and-sauerkraut/", "name": "German Pork Chops and Sauerkraut", "summary": "\nAs a soldier during WWII my Dad learned to make this hearty pork dish from a local German woman during the Allied occupation of Germany. I don't know the German name for it, but it is delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2384863.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  center cut pork chops", "2 pounds sauerkraut, drained", "1 large red apple, diced", "1  onion, chopped", "1 cup brown sugar", "1 tablespoon caraway seeds"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Heat a large nonstick skillet over medium-high heat, and brown the pork chops on both sides, about 5 minutes per side. Place the chops into a 9x13-inch baking dish.", "Mix the sauerkraut, apple, onion, brown sugar, and caraway seeds in a bowl until well combined, and spread the sauerkraut mixture over the pork chops. Cover the dish with aluminum foil.", "Bake in the preheated oven until the pork is no longer pink inside, about 45 minutes. An instant-read thermometer inserted into the center of a chop should read 145 degrees F (63 degrees C)."], "facts": "363 calories; protein 29.2g 59% DV; carbohydrates 38.6g 12% DV; fat 10.4g 16% DV; cholesterol 70.2mg 23% DV; sodium 800mg 32% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/60708/jagerschnitzel/", "name": "Jagerschnitzel", "summary": "\nThis is a delicious dish I ordered again and again when I was stationed in Germany with the Army.  It is best served with French fries to clean up the remaining gravy and a nice garden salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F433.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup bread crumbs", "1 tablespoon all-purpose flour", "salt and pepper to taste", "2 tablespoons vegetable oil", "4  pork steaks or cutlets, pounded thin", "1  egg, beaten", "1 medium onion, diced", "1 (8 ounce) can sliced mushrooms", "1 ½ cups water", "1 cube beef bouillon", "1 tablespoon cornstarch", "½ cup sour cream"], "direction": ["In a shallow dish, mix together the bread crumbs and flour. Season with salt and pepper. Place the egg in a separate dish. Heat oil in a large skillet over medium-high heat. Dip pork steaks in egg, then coat with the bread crumb mixture. Fry in the hot oil until browned on both sides and cooked through, about 5 minutes per side.", "Remove the pork to a platter and keep warm. Add onion and mushrooms to the skillet and cook until lightly browned. Pour in water and dissolve the bouillon cube. Simmer for about 20 minutes. Stir together the cornstarch and sour cream; stir into the skillet. Cook over low heat until thickened but do not boil.  Spoon over the pork cutlets and serve immediately."], "facts": "556 calories; protein 32.9g 66% DV; carbohydrates 29.9g 10% DV; fat 33.5g 52% DV; cholesterol 157mg 52% DV; sodium 682.8mg 27% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/25194/german-rouladen/", "name": "German Rouladen", "summary": "\nMeat rolls filled with bacon, onions and pickles.  Delicious, easy recipe learned while visiting Germany. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F357630.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds flank steak", "German stone ground mustard, to taste", "½ pound thick sliced bacon", "2 large onions, sliced", "1 (16 ounce) jar dill pickle slices", "2 tablespoons butter", "2 ½ cups water", "1 cube beef bouillon"], "direction": ["Cut the flank steak into thin filets; about 1/4 inch thick and 3 inches wide.", "Generously spread one side of each filet with mustard to taste. Place bacon, onions and pickle slices on each filet and form into a roll. Use string or toothpicks to hold the roll together.", "Heat a skillet over medium heat and melt butter. Place the rolls in the butter and saute until browned.", "Pour in 2 1/2 cups of water and add the bouillon cube; stirring to dissolve the bouillon cube. Simmer the rolls for about an hour."], "facts": "264 calories; protein 19.1g 38% DV; carbohydrates 7.7g 3% DV; fat 17.4g 27% DV; cholesterol 59.4mg 20% DV; sodium 1449.5mg 58% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/24674/german-zwiebelkuchen-onion-pie/", "name": "German Zwiebelkuchen (Onion Pie)", "summary": "\nZwiebelkuchen is an onion pie from Swabia, in south-central Germany.    It is a special time of year, in the fall, when the mom & pop winemakers will open a BasinWirtschaft in their barn or garage. They serve the new wine, fresh zwiebelkuchen, and perhaps some wurst, for a minimal fee.  A few tables are set up, and they are open when they have time to serve.  To indicate they are serving, they will hang a straw broom over the doorway. The combination of the onions and the 'green' wine can have explosive consequences later on! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4571410.jpg", "meta": [["prep:", "1 hr"], ["cook:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "11"], ["Yield:", "10 to 12 servings"]], "ingredients": ["6 pounds onions, sliced", "4 slices bacon", "1 (16 ounce) container sour cream", "4  egg", "2 tablespoons all-purpose flour", "½ teaspoon salt", "½ teaspoon caraway seed", "2 recipes pastry for a 9 inch single crust pie"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Line a jelly-roll pan or large pizza pan with prepared dough, making sure dough extends up sides of pan.", "Saute onion in a skillet until translucent and pour cooked onion into a large mixing bowl. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, chop and add to onion; mix well.", "Stir in sour cream. Beat eggs enough to break up yolks, then mix in to pie mixture. Add flour to thicken mixture (onions will create a lot of water), then add salt. Mix well and pour mixture into prepared pan. Sprinkle top with caraway seed.", "Bake in preheated oven for about 1 hour, or until onions start to turn golden brown on top."], "facts": "441 calories; protein 10.3g 21% DV; carbohydrates 43.2g 14% DV; fat 26.4g 41% DV; cholesterol 92.7mg 31% DV; sodium 415.4mg 17% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221351/german-hamburgers-frikadellen/", "name": "German Hamburgers (Frikadellen)", "summary": "\nThe original hamburger, these are served like a flattened meatball with some steamed string beans and salad. I also like to use this recipe to make Swedish meatballs (but omit the paprika). My Aunt in Hamburg, Germany taught me this recipe and I've been making them ever since. Serve with steamed string beans and tossed salad. Or serve on a Kaiser roll with lettuce, tomato, pickled cucumbers, finely sliced deep fried onions and curry ketchup. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2065105.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "10 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  Kaiser roll", "⅔ pound ground beef", "⅓ pound ground pork", "1  onion, finely chopped", "¼ cup chopped fresh parsley", "1  egg", "1 teaspoon Hungarian hot paprika  (Optional)", "salt and ground black pepper to taste"], "direction": ["Soak Kaiser roll in a bowl of water for 10 minutes. Drain, squeezing out excess water, and crumble into a large bowl.", "Mix crumbled roll with ground beef, ground pork, onion, parsley, egg, paprika, salt, and black pepper until well blended. Shape meat into large flattened meatballs.", "Heat a large nonstick skillet over medium heat; fry meatballs until browned and no longer pink in the center, about 5 minutes per side."], "facts": "272 calories; protein 22.4g 45% DV; carbohydrates 8.5g 3% DV; fat 16g 25% DV; cholesterol 116.8mg 39% DV; sodium 137.8mg 6% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/146229/slow-cooker-german-style-pork-roast-with-sauerkraut-and-potatoes/", "name": "Slow Cooker German-Style Pork Roast with Sauerkraut and Potatoes", "summary": "\nPork loin becomes tender and delicious cooked slowly with sauerkraut and caraway seeds. This gets raves from my German father. My Irish husband loves it too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F484148.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 hrs"], ["total:", "8 hrs 20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6  white potatoes, peeled and quartered", "1 tablespoon minced garlic", "salt and pepper to taste", "1 (3 pound) boneless pork loin roast", "1 (32 ounce) jar sauerkraut with liquid", "2 teaspoons caraway seeds"], "direction": ["Place the potatoes, garlic, salt, and pepper in a slow cooker; stir to coat. Season the pork roast with salt and pepper; lay atop the potatoes. Pour the sauerkraut over the roast; sprinkle with caraway seeds.", "Cook in slow cooker on Low 8 to 10 hours."], "facts": "386 calories; protein 31.3g 63% DV; carbohydrates 30.5g 10% DV; fat 15.2g 23% DV; cholesterol 82.9mg 28% DV; sodium 809.8mg 32% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7570/battenburg-cake/", "name": "Battenburg Cake", "summary": "\nThis fancy almond-flavored tea cake, also called 'Battenberg/Battenburg Cake' or 'Battenberg/Battenburg Square' features a homemade marzipan. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2692736.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "2 layer cake"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "3  eggs", "¼ teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "⅛ teaspoon salt", "2 drops red food coloring", "1 cup apricot preserves", "2 cups ground almonds", "3 cups confectioners' sugar", "1  egg, room temperature", "1 ½ teaspoons lemon juice", "¼ teaspoon almond extract"], "direction": ["Cream butter and 1 cup sugar together.  Beat in 3 eggs, one at a time.  Mix in vanilla.  Stir in flour, baking powder and salt gently.  Add milk if needed.", "Divide batter into 2 equal parts.  Add food coloring to 1 part to make a deep pink color.  Grease two 7 inch square pans.  Spread batters into pans.", "Bake at 350 degrees F (175 degrees C) until an inserted wooden pick comes out clean, about 25 to 30 minutes.  Let stand in pans 5 minutes.  Turn out on racks to cool.", "Trim edges from both cakes.  Cut each cake lengthwise into 4 strips as wide as the cake is thick.  Trim to make strips match.  Heat jam slightly.  Spread on sides to glue 2 pink and 2 white strips together checkerboard fashion.  Spread all 4 sides of completed cake with jam. Repeat with remaining pink and white stripes.  Makes two cakes.", "To Make Almond Paste:  Mix almonds, confectioners' sugar, egg, lemon juice, and almond extract together.  Knead until smooth, adding a bit of lemon juice or water if too dry to roll.   Add only 1/2 teaspoon at a time.  It will be stiff.  Divide into 2 equal parts.", "Roll 1/2 of paste 1/8 inch or so thick on a surface lightly dusted with confectioners' sugar.  Cut to fit length of cake, and long enough to cover 4 sides leaving ends uncovered.  Lay cake on one end of paste.  Wrap to completely enclose all 4 sides of cake pinching paste to seal.  Roll in granulated sugar.  Place with seal underneath on serving plate, or store in plastic bag.  Repeat for second cake.  Chill.  Slice thinly to serve."], "facts": "646 calories; protein 10.6g 21% DV; carbohydrates 85.5g 28% DV; fat 31.6g 49% DV; cholesterol 102.7mg 34% DV; sodium 208.8mg 8% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/15765/german-apple-cake-ii/", "name": "German Apple Cake II", "summary": "\nApple cake with cream cheese frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F126378.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 - 9x13 inch cake"]], "ingredients": ["2  eggs", "1 cup vegetable oil", "2 cups white sugar", "2 cups all-purpose flour", "1 teaspoon baking soda", "2 teaspoons ground cinnamon", "1 teaspoon salt", "1 teaspoon vanilla extract", "4 cups apples - peeled, cored and diced", "½ cup chopped walnuts", "2 (3 ounce) packages cream cheese", "3 tablespoons butter, softened", "1 ½ cups confectioners' sugar", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and four a 9x13 inch pan. In a medium bowl, mix together flour, baking soda, cinnamon and salt. Set aside.", "In a large bowl, combine eggs, oil and sugar. Beat until foamy. Add flour mixture and beat well. Add vanilla and stir in chopped apples and walnuts. Pour into a 9x13 inch pan.", "Bake for 45 to 50 minutes, or until a toothpick inserted into the cake comes out clean. Allow cake to cool, then spread with cream cheese frosting.", "To make the frosting: In a medium bowl, combine cream cheese, softened butter, confectioners sugar and 1 teaspoon vanilla. Beat until smooth, then spread on cake."], "facts": "284 calories; protein 2.6g 5% DV; carbohydrates 35.7g 12% DV; fat 15.2g 23% DV; cholesterol 27.1mg 9% DV; sodium 187mg 8% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/150123/traditional-springerle/", "name": "Traditional Springerle", "summary": "\nWe have made these very traditional German cookies every year since I was a child. My mother remembers her grandmother making them with this recipe that has been in our family for generations. The molds can be hard to find, but check specialty cookware stores and antique shops. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7499595.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "8 hrs"], ["total:", "8 hrs 35 mins"], ["Servings:", "48"], ["Yield:", "48 servings"]], "ingredients": ["1 ½ tablespoons crushed anise seeds", "3 ½ cups all-purpose flour", "1 teaspoon baking powder", "4  eggs", "2 cups sugar", "½ teaspoon vanilla extract", "¼ cup confectioners' sugar"], "direction": ["Lightly grease 4 cookie sheets. Sprinkle with anise seeds. Set aside until needed.", "Mix the flour and baking powder together in a bowl until well blended. Place the eggs, sugar, and vanilla in a large bowl; beat until light and frothy, 5 to 8 minutes. Slowly stir in the flour mixture until a thick dough forms.", "Working with handfuls of dough, roll out the dough onto a lightly floured surface until 1/4 inch thick. Lightly sift confectioners' sugar over the dough. Place springerle molds onto the dough; press down hard and evenly until the mold's design registers in the dough. Remove the mold. Use a small knife to cut around each cookie, and place on prepared cookie sheets. Repeat, until all dough has been used. Cover the cookies with a lightweight cotton cloth, and allow to dry 8 hours, or overnight.", "Preheat oven to 250 degrees F (120 degrees C).", "Bake cookies in preheated oven until tops are pale brown and set, 25 to 30 minutes. Cool on a rack. Store in an airtight container."], "facts": "75 calories; protein 1.5g 3% DV; carbohydrates 16.1g 5% DV; fat 0.5g 1% DV; cholesterol 15.5mg 5% DV; sodium 16.2mg 1% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/149686/german-beef-rouladen/", "name": "German Beef Rouladen", "summary": "\nThis is another great German recipe that reminds me of my mom's wonderful cooking.  Enjoy this unique and delicious dish! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2246370.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 rouladen"]], "ingredients": ["¼ cup Dijon mustard", "8 (4 ounce) pieces round steak, pounded 1/4 inch thick", "½ cup minced onion", "2 teaspoons paprika", "2 teaspoons salt", "2 teaspoons freshly ground black pepper", "8 slices bacon", "3 tablespoons canola oil", "1 (12 ounce) can beef broth", "1 ¼ cups water", "2 tablespoons cornstarch", "1 cup warm water", "¼ cup sour cream"], "direction": ["Spread 1/2 tablespoon mustard over one side of each piece of meat. Sprinkle the onion, paprika, salt, and pepper evenly over the steaks. Lay one slice of bacon on each piece. Roll the steaks jelly-roll style and secure with toothpicks.", "Heat the canola oil in a skillet over medium heat. Cook meat on all sides until browned. Add the beef broth and water; bring to a boil. Reduce heat to medium low; cover and simmer until tender, about 30 minutes.", "Remove the meat rolls. Strain the broth mixture and return liquid to the skillet. Whisk together the cornstarch and 1 cup of water. Slowly pour the cornstarch slurry into the skillet, stirring continually until the sauce has thickened, 2 to 3 minutes. Stir in the sour cream. Return rolls to the sauce; serve immediately."], "facts": "351 calories; protein 44.6g 89% DV; carbohydrates 5.4g 2% DV; fat 15.6g 24% DV; cholesterol 113.2mg 38% DV; sodium 1132.7mg 45% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228364/oktoberfest-chicken-and-red-cabbage/", "name": "Oktoberfest Chicken and Red Cabbage", "summary": "\nI adore Bavarian cuisine! And since there's no good German food here (while I lived in San Francisco, my husband and I ate at wonderful German/Hungarian restaurants there), I have to make my own...This recipe is crazy simple. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5856617.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 slices bacon", "1 tablespoon bacon drippings", "¼ cup all-purpose flour", "½ teaspoon kosher salt", "½ teaspoon smoked paprika", "2 pounds skinless chicken thighs", "1  red onion, sliced", "1 large apple, cored and sliced", "1 head red cabbage, cored and sliced", "½ cup red wine vinegar", "¼ cup dry red wine", "¼ cup brown sugar", "½ teaspoon ground cinnamon  (Optional)"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place bacon in a large oven-safe or cast-iron skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. When cool, crumble bacon; leave bacon drippings in the skillet.", "Whisk flour, kosher salt, and smoked paprika together in a bowl. Coat chicken thighs in the seasoned flour and brown on both sides in the hot bacon fat over medium heat, about 5 minutes per side; transfer chicken to a plate. Drain bacon grease except for 1 tablespoon; cook and stir onion and apple until onion is translucent and apple is softened, about 5 minutes. Stir red cabbage and bacon into onion-apple mixture, sprinkle with a pinch of kosher salt, and cook, stirring often, until cabbage is softened, 5 to 8 minutes.", "Pour red wine vinegar and red wine into skillet. Stir in brown sugar and cinnamon and bring cabbage mixture to a boil; cook until sauce is reduced by half, stirring often, about 10 minutes. Arrange chicken thighs on top of cabbage in the skillet.", "Bake in the preheated oven until cabbage is tender and chicken is cooked through, about 40 minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read at least 160 degrees F (70 degrees C)."], "facts": "271 calories; protein 22.5g 45% DV; carbohydrates 23.9g 8% DV; fat 9.2g 14% DV; cholesterol 72.4mg 24% DV; sodium 292.2mg 12% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/216081/sausage-and-sauerkraut/", "name": "Sausage and Sauerkraut", "summary": "\nThis is a recipe from a sweet old German lady I used to attend church with. Allow for plenty of time to prepare and cook this dish.  It is definitely worth the time and effort! Serve with hot German potato salad and red cabbage. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F802499.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 hrs 20 mins"], ["total:", "3 hrs 35 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 pounds sauerkraut, rinsed and drained", "1 tablespoon caraway seeds  (Optional)", "¼ cup brown sugar", "1  apple, diced", "½ pound bacon, cut into 1-inch pieces", "1 large onion, chopped", "1 ½ pounds kielbasa sausage, cut into 1-inch thick slices"], "direction": ["Place the sauerkraut, caraway seeds, brown sugar, and apple into a large saucepan over medium-low heat, and bring the mixture to a simmer. Reduce heat to low, and cook for 2 hours, stirring occasionally.", "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.", "Place the bacon and onion into a skillet over medium heat, and cook until the bacon is almost crisp and the onion is beginning to brown, about 10 minutes. Stir the bacon mixture into the sauerkraut. In the same skillet, brown the kielbasa sausage in the remaining bacon grease until the sausage begins to brown, 10 to 15 minutes; stir into the sauerkraut mixture. Spoon the sauerkraut and sausage mixture into the prepared baking dish.", "Bake in the preheated oven until bubbling, about 1 hour."], "facts": "777 calories; protein 24.6g 49% DV; carbohydrates 28.6g 9% DV; fat 62.3g 96% DV; cholesterol 128.2mg 43% DV; sodium 2702.1mg 108% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/78117/wienerschnitzel/", "name": "Wienerschnitzel", "summary": "\nThis easy German recipe is one of our favorites. Boneless pork chops can also be substituted for veal and taste excellent! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4560415.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ½ pounds veal cutlets", "½ cup all-purpose flour", "3 tablespoons grated Parmesan cheese", "2  eggs", "1 teaspoon minced parsley", "½ teaspoon salt", "¼ teaspoon pepper", "1 pinch ground nutmeg", "2 tablespoons milk", "1 cup dry bread crumbs", "6 tablespoons butter", "4 slices  lemon"], "direction": ["Place each veal cutlet between two pieces of plastic wrap, and pound with the flat side of a meat mallet until about 1/4 inch thick. Dip in flour to coat.", "In a medium bowl, stir together the Parmesan cheese, eggs, parsley, salt, pepper, nutmeg and milk. Place bread crumbs on a plate. Dip each cutlet into the egg mixture, then press in the bread crumbs to coat. Place coated cutlets on a plate and refrigerate for 1 hour or overnight.", "Melt butter in a large skillet over medium heat. Cook the breaded cutlets until browned on each side, about 3 minutes per side. Remove to a serving platter, and pour the pan juices over them. Garnish with lemon slices."], "facts": "515 calories; protein 29.1g 58% DV; carbohydrates 33.7g 11% DV; fat 29.1g 45% DV; cholesterol 229.6mg 77% DV; sodium 781.7mg 31% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/244200/chef-johns-beef-rouladen/", "name": "Chef John's Beef Rouladen", "summary": "\nFor something that looks and tastes as impressive as this beef rouladen, it's actually one of the simplest stuffed meat recipes I know. You can pretty much use any cheap cut of beef; I used round steak, but rump, chuck, flap meat, and other similar cuts will work work. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7709567.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 30 mins"], ["additional:", "5 mins"], ["total:", "1 hr 50 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 (6 ounce) (1/4 inch thick) slices of beef round", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "2 tablespoons Dijon mustard", "4 strips bacon", "paprika, or to taste", "½  onion, sliced into half-rings and separated", "6  dill pickle spears", "1 tablespoon vegetable oil"], "direction": ["Place slices of beef on a work surface, Season both sides with kosher salt and pepper. Spread one side with mustard. Place bacon strips on the mustard and sprinkle with paprika. Arrange onion slices cross-wise on the beef. Then evenly space 3 pickle slices across each slice of beef. Keep about an inch of the narrowest end of the beef slice free of toppings to facilitate rolling it up.", "Roll each slice of meat, beginning from the wider of the two short ends, working to keep all ingredients inside the roll. Rolls should be nice and tight. Secure the rolls (seam side down) with 3 loops of butcher's twine, one in the middle and one at each end. Trim excess string.", "Heat vegetable oil over medium-high heat in a large saucepan. Cook beef, turning and browning well on all sides, about 8 minutes. Remove meat from pan. Reduce heat to medium-low. Melt butter in the pan; whisk in the flour, cooking for about 1 minute. Pour in cold beef broth and whisk vigorously to combine. Raise heat to medium-high and simmer until sauce begins to thicken, about 1 minute.", "Transfer beef rolls to pan along with accumulated juices. Reduce heat to very low. Simmer gently, covered, turning rolls every 20 minutes or so, until beef is tender, about 1 1/2 hours. When the tip of a sharp knife can easily be inserted into the beef roll, the meat is done.", "Transfer meat to dish to allow it to rest. Raise heat to high and bring cooking liquid to a simmer to thicken slightly to make a gravy, about 1 minute. Serve rouladen with gravy."], "facts": "641 calories; protein 47.8g 96% DV; carbohydrates 22.8g 7% DV; fat 38.8g 60% DV; cholesterol 141.3mg 47% DV; sodium 5266.1mg 211% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/155182/pfeffernusse-cookies/", "name": "Pfeffernusse Cookies", "summary": "\nI have searched far and wide for a recipe that mimics my favorite, store-bought version of these cookies. I think, after days of thrown-out cookies, I have come as close as I can get. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4807631.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs"], ["Servings:", "18"], ["Yield:", "3 dozen cookies"]], "ingredients": ["½ cup molasses", "¼ cup honey", "¼ cup shortening", "¼ cup margarine", "2  eggs", "4 cups all-purpose flour", "¾ cup white sugar", "½ cup brown sugar", "1 ½ teaspoons ground cardamom", "1 teaspoon ground nutmeg", "1 teaspoon ground cloves", "1 teaspoon ground ginger", "2 teaspoons anise extract", "2 teaspoons ground cinnamon", "1 ½ teaspoons baking soda", "1 teaspoon ground black pepper", "½ teaspoon salt", "1 cup confectioners' sugar for dusting"], "direction": ["Stir together the molasses, honey, shortening, and margarine in a saucepan over medium heat; cook and stir until creamy. Remove from heat and allow to cool to room temperature. Stir in the eggs.", "Combine the flour, white sugar, brown sugar, cardamom, nutmeg, cloves, ginger, anise, cinnamon, baking soda, pepper, and salt in a large bowl. Add the molasses mixture and stir until thoroughly combines. Refrigerate at least 2 hours.", "Preheat oven to 325 degrees F (165 degrees C). Roll the dough into acorn-sized balls. Arrange on baking sheets, spacing at least 1 inch apart.", "Bake in preheated oven 10 to 15 minutes. Move to a rack to cool. Dust cooled cookies with confectioners' sugar."], "facts": "284 calories; protein 3.7g 7% DV; carbohydrates 53.9g 17% DV; fat 6.3g 10% DV; cholesterol 20.7mg 7% DV; sodium 212.8mg 9% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228406/beer-glazed-brats-and-sauerkraut/", "name": "Beer Glazed Brats and Sauerkraut", "summary": "\nI came up with this recipe, because simply simmering sausages in beer and onions tasted weak. I was looking for a more intense beer flavor with a little bite, and this is it. A very satisfying dish if you crave German flavor that's Americanized. We love this dish served on potato rolls with spicy hot German mustard, Swiss cheese, and ice cold beer on the side. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F876299.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["⅛ teaspoon celery seeds", "⅛ teaspoon caraway seeds", "1 pound fresh bratwurst sausages", "1 (12 fluid ounce) can or bottle lager beer", "1 tablespoon light brown sugar", "2 teaspoons dry mustard powder", "1 teaspoon onion powder", "⅛ teaspoon ground black pepper", "⅛ teaspoon dried dill weed", "1 pound sauerkraut (preferably barrel-aged), drained"], "direction": ["Crush celery seeds and caraway seeds in a mortar and pestle until ground; set aside.", "Place bratwursts into a large nonstick skillet over medium heat. Mix beer, brown sugar, dry mustard, onion powder, black pepper, dill weed, and crushed celery and caraway seeds in a bowl, stirring to dissolve brown sugar; pour over the brats. Bring to a boil and reduce heat to low; cover and simmer for 10 minutes.", "Uncover and raise heat to medium; boil the sauce until it reduces to a thick, syrupy liquid, about 20 minutes. Tilt skillet to roll brats in the sticky sauce until thoroughly coated. Transfer sausage to a platter and keep warm. Cook and stir sauerkraut in the same skillet to mix in any leftover sauce, 5 to 8 minutes. Transfer sauerkraut to a serving platter and top with cooked bratwurst."], "facts": "296 calories; protein 10.5g 21% DV; carbohydrates 11.6g 4% DV; fat 21.1g 33% DV; cholesterol 45.9mg 15% DV; sodium 1225.8mg 49% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221360/kates-easy-german-sauerbraten/", "name": "Kate's Easy German Sauerbraten", "summary": "\nThis is a slow-cooker version of a classic German recipe. Sauerbraten is often served with red cabbage and spaetzle noodles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1052841.jpg", "meta": [["prep:", "30 mins"], ["cook:", "8 hrs 20 mins"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups water", "1 cup red wine", "1 cup cider vinegar", "1  lemon, sliced", "½ large onion, diced", "1 clove garlic, diced", "10  whole cloves", "2  bay leaves", "2 tablespoons white sugar", "2 tablespoons salt", "1 tablespoon juniper berries, crushed  (Optional)", "1 teaspoon whole peppercorns", "1 (4 pound) boneless beef chuck roast", "2 cups chopped onions", "2 cups chopped carrots", "1 cup diced celery", "8  gingersnap cookies, crushed"], "direction": ["Heat water, red wine, cider vinegar, lemon, 1/2 onion, garlic, cloves, bay leaves, white sugar, salt, juniper berries, and peppercorns in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Allow marinade to cool and pour into a resealable plastic bag. Add beef roast, coat with marinade, squeeze out excess air, and seal bag. Marinate in the refrigerator 2 to 3 days, turning the roast twice a day.", "Place onions, carrots, and celery in a slow cooker. Remove roast from marinade and place atop vegetables. Strain marinade and pour 2 1/2 cups over roast; reserve remaining marinade.", "Cover and cook roast on Low for 8 hours. Turn slow cooker off. Transfer roast to a cutting board and cover with aluminum foil. Strain cooking liquid into a large bowl and return vegetables to slow cooker to rest.", "Heat about 3 cups cooking liquid and gingersnaps in a saucepan over medium-high heat, adding reserved marinade as needed, until gravy is thickened, about 10 minutes.", "Slice roast and serve with vegetables and gravy."], "facts": "460 calories; protein 27.8g 56% DV; carbohydrates 17.9g 6% DV; fat 27g 42% DV; cholesterol 103.3mg 35% DV; sodium 1875.3mg 75% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221383/apfelkuchen-apple-cake/", "name": "Apfelkuchen (Apple Cake)", "summary": "\nI fell in love with apfelkuchen when I was in 6th grade. Our teacher let us order from a local German bakery and eat our treats in class once a month. These flavors bring back wonderful memories. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2133917.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "30 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch cake"]], "ingredients": ["2 ¼ cups sifted all-purpose flour", "1 ⅛ cups warm milk", "¼ cup white sugar", "1 (.25 ounce) package active dry yeast", "6 tablespoons butter, softened", "1 tablespoon vanilla extract", "1 pinch salt", "3 large apples - peeled, cored, and sliced", "1 cup white sugar", "¾ cup sifted all-purpose flour", "2 ounces candied lemon peel, chopped", "½ teaspoon ground cinnamon", "¼ teaspoon ground nutmeg", "1 pinch salt", "½ cup butter"], "direction": ["Grease the bottom and sides of a 9x13-inch baking dish or a 9-inch springform pan.", "Beat 2 1/4 cup flour, milk, 1/4 cup sugar, yeast, 6 tablespoons butter, vanilla extract, and 1 pinch salt in a large bowl with an electric mixer on high until dough is smooth, about 5 minutes; spread into baking dish and press dough up the sides. Press apple slices into dough.", "Mix 1 cup sugar, 3/4 cup flour, candied lemon peel, cinnamon, nutmeg, and 1 pinch salt in a bowl. Cut in 1/2 cup butter with a knife or pastry blender until mixture resembles coarse crumbs; sprinkle over apples. Allow dough to rise for 30 minutes.", "Preheat oven to 400 degrees F (200 degrees C).", "Bake in preheated oven until cake is golden brown and apples are tender, about 35 minutes."], "facts": "370 calories; protein 4.5g 9% DV; carbohydrates 57.1g 18% DV; fat 14.3g 22% DV; cholesterol 37.4mg 13% DV; sodium 136mg 5% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/219065/willard-family-german-chocolate-cake/", "name": "Willard Family German Chocolate Cake", "summary": "\nThis recipe has been in my family for a very long time. My great-grandma could make this with her eyes closed. My father was born on her birthday so she made this cake for him every year. Even shipped it to him in Korea when he was stationed there in the army. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5625976.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 20 mins"], ["Servings:", "10"], ["Yield:", "1 3-layer cake"]], "ingredients": ["1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®) - broken into pieces", "½ cup boiling water", "1 cup margarine, softened", "2 cups white sugar", "4  eggs, separated", "1 teaspoon vanilla extract", "2 ½ cups sifted all purpose flour", "1 teaspoon baking soda", "½ teaspoon salt", "1 cup buttermilk", "1 cup evaporated milk", "1 cup white sugar", "3  egg yolks", "¼ cup margarine", "1 teaspoon vanilla extract", "1 ⅓ cups sweetened flake coconut", "1 cup chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 8-inch cake pans and line bottoms with parchment paper.", "Place the chunks of chocolate into the boiling water and stir until the chocolate has melted; set aside to cool. In a large bowl, beat 1 cup of softened margarine with 2 cups of sugar with an electric mixer until light and fluffy. Stir in 4 egg yolks, one at a time, beating well after each addition. Beat in 1 teaspoon of vanilla extract and the chocolate-water mixture until thoroughly blended.", "Sift the flour, baking soda, and salt into a bowl. Beat the flour mixture into the liquid ingredients, alternating with buttermilk, in 3 or 4 additions. Beat until batter is smooth, about 1 minute.", "In a metal or glass bowl, beat the reserved egg whites until they hold stiff peaks when the beaters are lifted straight up. Gently fold the beaten egg whites into the batter, keeping as much volume as possible. Pour the batter into the prepared cake pans.", "Bake in the preheated oven until the cakes have browned lightly and a toothpick inserted into the center of a cake comes out clean, 35 to 40 minutes. Allow the cakes to cool in pans before removing.", "To make frosting, pour the evaporated milk into a large saucepan, and mix in 1 cup of sugar, 3 egg yolks, 1/4 cup of margarine, and 1 teaspoon of vanilla extract. Bring to a boil, reduce heat to medium, and cook until thickened, stirring constantly, about 12 minutes. Remove from heat, and mix in the coconut and pecans, beating the frosting until cooled and spreadable. Frost and fill the cake with the coconut frosting."], "facts": "809 calories; protein 11.5g 23% DV; carbohydrates 101.8g 33% DV; fat 41.8g 64% DV; cholesterol 144.1mg 48% DV; sodium 617mg 25% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/10352/old-german-honey-cookies/", "name": "Old German Honey Cookies", "summary": "\nI got this recipe from my grandmother who got it from her grandmother.  She had to translate it and then figure out measurements.  The original recipe called for \"enough flour to make a dough\". Thankfully grandma knew what kind of dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2241821.jpg", "meta": [["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup white sugar", "1 cup shortening", "1 cup honey", "2  eggs", "1 teaspoon vanilla extract", "1 teaspoon baking soda", "4 cups all-purpose flour", "1 teaspoon ground ginger"], "direction": ["In a saucepan over low heat, melt together sugar, shortening and honey.  Let cool.", "Mix together eggs, vanilla, baking soda and ginger.  Gradually add to cooled honey mixture.", "Slowly add 4 cups of flour to mixture.  Stir until well blended.  Drop by teaspoonfuls onto cookie sheets about 2 inches apart.  Bake at 350 degrees F (180 degrees C) until golden (about 12-15 minutes)."], "facts": "233 calories; protein 2.7g 6% DV; carbohydrates 36g 12% DV; fat 9.2g 14% DV; cholesterol 15.5mg 5% DV; sodium 59.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/87483/authentic-german-cheesecake/", "name": "Authentic German Cheesecake", "summary": "\nMy mom searched for years for an authentic German cheesecake recipe, but Germans use 'quark', an ingredient not readily available in the U.S. This recipe uses cottage cheese in place of quark and makes its own crust while baking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F466091.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["additional:", "6 hrs"], ["total:", "7 hrs 30 mins"], ["Servings:", "12"], ["Yield:", "1 cheesecake"]], "ingredients": ["1 ½ cups white sugar", "2 tablespoons cornstarch", "3 tablespoons all-purpose flour", "2 (8 ounce) packages cream cheese, softened", "1 pound small curd cottage cheese", "½ cup butter, softened", "4 medium eggs", "1 ½ tablespoons lemon juice", "1 teaspoon vanilla extract"], "direction": ["Preheat an oven to 350 degrees F (175 degrees C). Grease the bottom and halfway up the sides of a 9 inch springform pan. Mix together the sugar, cornstarch, and flour and set aside.", "Combine the cream cheese and cottage cheese; beat with an electric mixer at high speed until smooth and fluffy. Beat in the softened butter. Gradually add the sugar mixture, beating until combined. Add the eggs one at a time, blending well and scraping down the bowl after each addition. Stir in the lemon juice and vanilla and mix just until smooth.", "Pour the batter into the prepared pan and bake for 1 hour and 10 minutes. Turn off the oven and let the cheesecake rest in the oven with the door closed for 2 hours. Remove and cool on a wire rack. Chill for 4 hours or overnight."], "facts": "371 calories; protein 9.9g 20% DV; carbohydrates 30.1g 10% DV; fat 24.1g 37% DV; cholesterol 129.1mg 43% DV; sodium 341.8mg 14% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/24676/german-currywurst/", "name": "German Currywurst", "summary": "\nCurrywurst is a popular 'fast food' in Berlin, Germany.  It is quick and simple and everyone loves it! If you're in a hurry, you can substitute ketchup for the sauce, or use your own recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4479689.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 (15 ounce) cans tomato sauce", "1 pound kielbasa", "2 tablespoons chili sauce", "½ teaspoon onion salt", "1 tablespoon white sugar", "1 teaspoon ground black pepper", "1 pinch paprika", "Curry powder to taste"], "direction": ["Preheat oven to Broil/Grill.", "Pour tomato sauce into a large saucepan, then stir in the chili sauce, onion salt, sugar and pepper. Let simmer over medium heat, occasionally stirring; bring to a gentle boil and reduce heat to low. Simmer another 5 minutes.", "Meanwhile, broil/grill kielbasa sausage for 3 to 4 minutes each side, or until cooked through. Slice into pieces 1/4 inch to 1/2 inch thick.", "Pour tomato sauce mixture over sausage, then sprinkle all with paprika and curry powder and serve."], "facts": "451 calories; protein 18.4g 37% DV; carbohydrates 26.1g 8% DV; fat 31.7g 49% DV; cholesterol 74.9mg 25% DV; sodium 3018.7mg 121% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/34892/krautburger/", "name": "Krautburger", "summary": "\nA lean version of a German beef and cabbage filled roll. They freeze very well, and are good dipped in mustard. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F53887.jpg", "meta": [["prep:", "40 mins"], ["cook:", "40 mins"], ["additional:", "10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 pound lean ground beef", "1  onion, chopped", "½ medium head cabbage, shredded", "½ (1 ounce) package dry onion soup mix", "1 (8 ounce) package mild Cheddar cheese, sliced", "black pepper to taste", "2 (1 pound) loaves frozen bread dough, thawed", "butter flavored cooking spray", "¼ cup margarine, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Drain fat. Stir in cabbage and onion soup mix; cook 5 minutes longer, or until lightly browned. Set aside.", "Roll one loaf of bread dough into a 16x8 inch rectangle, then cut into eight 4 inch squares. Spoon cabbage mixture into center of each square, top with 1 small slice cheese and bring up diagonal points, pinching edges closed. Place krautburgers on a cookie sheet coated with cooking spray, and let rise for about 10 minutes.", "Bake for 20 minutes, or until brown. Brush tops of warm rolls with margarine.  Repeat process with second loaf of bread and remaining cabbage mixture and cheese."], "facts": "307 calories; protein 15.1g 30% DV; carbohydrates 30.3g 10% DV; fat 13.2g 20% DV; cholesterol 33.3mg 11% DV; sodium 537.3mg 22% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/84725/german-semolina-pudding/", "name": "German Semolina Pudding", "summary": "\nThis is a delicious traditional German dessert-type dish that your kids will love! It's a sweet pudding served with anything from applesauce to ground cinnamon and sugar. You can adjust the amount of sugar to your preferred sweetness. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F127939.jpg", "meta": [["prep:", "2 mins"], ["cook:", "20 mins"], ["total:", "22 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 cups milk", "1 ½ tablespoons white sugar", "⅓ cup semolina"], "direction": ["In a small saucepan, stir together the milk and sugar. Set over medium heat, and bring to a boil. Milk tends to boil over as soon as it boils, so stay with it! When it boils, immediately remove from the heat. Stir in the semolina, and return to the burner. Bring to a boil over medium heat, stirring until thickened but still pourable. Pour into serving bowls, and top with your favorite hot cereal toppings."], "facts": "259 calories; protein 11.6g 23% DV; carbohydrates 41.1g 13% DV; fat 5.1g 8% DV; cholesterol 19.5mg 7% DV; sodium 100.3mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7807/german-marble-cake/", "name": "German Marble Cake", "summary": "\nThis is a lovely cake with the taste of almond and chocolate and it is almost like a pound cake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1079704.jpg", "meta": [["Servings:", "14"], ["Yield:", "1 -10 inch tube cake"]], "ingredients": ["1 cup butter", "1 ½ cups white sugar", "4  eggs", "1 cup milk", "1 teaspoon almond extract", "3 ¼ cups all-purpose flour", "1 tablespoon baking powder", "⅛ teaspoon salt", "¼ cup unsweetened cocoa powder", "3 tablespoons dark rum"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 10 inch tube pan.", "In a large bowl, cream the butter with the sugar.  Beat in the eggs, then the milk and almond extract.", "In another bowl, stir together the flour, baking powder and salt.  Beat the flour mixture into the creamed mixture.  Turn half of the batter into another bowl and stir in the cocoa and rum.", "Layer the light and dark batters by large spoonfuls and then swirl slightly with a knife.", "Bake the cake in at 350 degree F (175 degree C) for about 70 minutes, or until it tests done with a toothpick.  Transfer to a rack to cool.  Makes about 14 to 16 servings."], "facts": "346 calories; protein 5.8g 12% DV; carbohydrates 45.6g 15% DV; fat 15.4g 24% DV; cholesterol 89.4mg 30% DV; sodium 246.7mg 10% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/76161/real-homemade-bologna/", "name": "Real Homemade Bologna", "summary": "\nThis is the REAL homemade bologna and it is simply delicious!  My Grandmother made this and gave the recipe to my Mom, and she gave it to me!  You can say it is passed down! I am not a real big fan of Bologna, but once you taste this, you will love it all over again! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1170191.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "1 day"], ["total:", "1 day"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["3 pounds ground beef", "3 tablespoons sugar-based curing mixture (such as Morton® Tender Quick®)", "1 cup water", "⅛ teaspoon garlic powder", "½ teaspoon onion powder", "1 ½ teaspoons liquid smoke flavoring"], "direction": ["In a large bowl, mix together the ground beef, curing salt, water, garlic powder, onion powder and liquid smoke using your hands. Divide in half, and form each half into a roll. Wrap in plastic wrap, and refrigerate for 24 hours.", "Preheat the oven to 300 degrees F (150 degrees C). Unwrap the beef rolls, and place them on a greased baking sheet or roasting pan.", "Bake for 1 hour in the preheated oven, turning the meat over after 30 minutes. Cool to room temperature, then refrigerate until chilled. Slice, and eat on sandwiches."], "facts": "115 calories; protein 9g 18% DV; carbohydrates 0g; fat 8.5g 13% DV; cholesterol 34mg 11% DV; sodium 895.6mg 36% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/222015/grillhaxe-grilled-eisbein-pork-shanks/", "name": "Grillhaxe (Grilled Eisbein, Pork Shanks)", "summary": "\nSucculent pork shanks with irresistible crackling, spiced and oven-roasted for three hours and served with sauerkraut and mashed potatoes. Mmmmm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6712352.jpg", "meta": [["prep:", "10 mins"], ["cook:", "3 hrs"], ["total:", "3 hrs 10 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 cup olive oil", "2 tablespoons dried marjoram", "2 tablespoons dried basil", "2 tablespoons chopped fresh thyme", "2 tablespoons chopped fresh rosemary", "2 tablespoons sea salt", "1 teaspoon paprika", "1 teaspoon ground black pepper", "1 teaspoon vegetable bouillon powder", "6 (1 1/2) pounds pork shanks"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Whisk olive oil, marjoram, basil, rosemary, thyme, sea salt, paprika, black pepper, and vegetable bouillon powder together in a bowl. Rub pork shanks with herb rub and arrange on a large baking pan.", "Roast in preheated oven until shanks are tender and outer skin is crispy, about 3 hours."], "facts": "532 calories; protein 70.6g 141% DV; carbohydrates 0.8g; fat 27.9g 43% DV; cholesterol 185.9mg 62% DV; sodium 3080.5mg 123% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/206120/fried-cabbage-and-egg-noodles/", "name": "Fried Cabbage and Egg Noodles", "summary": "\nThis is a German recipe from my Grandmother. It's cabbage that is lightly browned in butter and mixed with egg noodles and browned lightly for a wonderful, hearty, and fast dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F355377.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (16 ounce) package egg noodles", "1 stick butter", "1 medium head green cabbage, chopped", "salt and pepper to taste"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook the egg noodles in the boiling water until the pasta is tender yet firm to the bite, about 5 minutes. Drain.", "While the noodles cook, melt the butter in a large skillet over low heat. Add the cabbage to the melted butter; season with salt and pepper. Cover and cook until the cabbage begins to brown, 5 to 7 minutes. Stir the drained noodles into the cabbage; cook and stir until the noodles begin to brown, about 5 minutes."], "facts": "690 calories; protein 19g 38% DV; carbohydrates 93g 30% DV; fat 28.2g 43% DV; cholesterol 155.1mg 52% DV; sodium 227.8mg 9% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/267993/easy-german-apple-streusel-pie/", "name": "Easy German Apple Streusel Pie", "summary": "\nThis is a super-easy pie recipe with a sweet bottom crust, a juicy cinnamony apple filling, and crisp streusel on top, all made out of the same dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6326909.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "5 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["4 large apples - peeled, cored, and thinly sliced", "1 pinch ground cinnamon", "7 ounces unsalted butter, at room temperature", "1 cup white sugar", "3 teaspoons vanilla sugar", "1  egg", "2 cups all-purpose flour", "3 ½ teaspoons baking powder"], "direction": ["Combine apple slices and cinnamon in a saucepan and cook over low heat for 10 minutes. If necessary, add a tiny bit of water so apples don't burn. Remove from heat and set aside to cool.", "Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch springform pan with butter", "Combine butter, sugar, vanilla sugar, and egg in a large bowl; beat using an electric mixer until smooth and creamy. Mix flour and baking powder in a separate bowl. Add 2/3 of flour mixture, 1 tablespoon at a time, to butter mixture and beat on low speed. Add remaining flour mixture and mix in by hand to make a crumbly dough.", "Transfer 1/2 the dough into the prepared springform pan and press down to create a bottom crust. Add apple slices, leaving a small space around the edges. Crumble remaining dough evenly on top.", "Bake in the preheated oven until streusel and crust are lightly browned, about 50 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Carefully transfer to a serving plate or cooling rack."], "facts": "365 calories; protein 3.5g 7% DV; carbohydrates 52.6g 17% DV; fat 16.7g 26% DV; cholesterol 58.5mg 20% DV; sodium 180.3mg 7% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/260685/easy-german-apple-sheet-cake/", "name": "Easy German Apple Sheet Cake", "summary": "\nThis quick and easy apple sheet cake recipe is from Germany where these types of cakes are very popular. Perfect for serving a crowd! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565171.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["1 tablespoon butter", "14 tablespoons unsalted butter, at room temperature", "1 cup white sugar", "3 cups all-purpose flour", "4 teaspoons baking powder", "lemon, zested and juiced", "1 pinch salt", "3  eggs, beaten", "3 ¼ pounds apples - peeled, cored, and thinly sliced", "2 tablespoons raisins  (Optional)"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease a large, 12x18-inch rimmed baking sheet with 1 tablespoon butter.", "Combine 14 tablespoons butter and sugar in a large bowl; beat with an electric mixer until smooth and creamy.", "Mix flour, baking powder, lemon zest, and salt in a bowl. Alternate adding flour mixture and eggs to the creamed butter mixture. Spread batter onto the prepared baking sheet; dough is very sticky, so use a spatula to spread it onto the tray. Distribute sliced apples evenly on top and drizzle with lemon juice. Sprinkle with raisins.", "Bake in the preheated oven until set and lightly browned, about 30 minutes."], "facts": "197 calories; protein 2.6g 5% DV; carbohydrates 30.2g 10% DV; fat 8g 12% DV; cholesterol 39.5mg 13% DV; sodium 100.9mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/8781/german-chicken/", "name": "German Chicken", "summary": "\nBoneless chicken breasts cooked over sauerkraut and covered in BBQ sauce. This sounds a little different, but I assure you, it is delicious!  It is one of my family's favorites. The BBQ sauce makes the sauerkraut a little sweet.  I like to serve this dish with mashed potatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F602409.jpg", "meta": [["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "1 cup barbecue sauce", "22 ounces sauerkraut"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a 9x13 inch baking dish, place the sauerkraut in a single layer. Place the chicken breasts on top of the sauerkraut. Pour the barbecue sauce over the chicken. Cover and bake in the preheated oven for 30 minutes or until the chicken is cooked and the juices run clear."], "facts": "253 calories; protein 28.6g 57% DV; carbohydrates 29.2g 9% DV; fat 1.9g 3% DV; cholesterol 68.4mg 23% DV; sodium 1794mg 72% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/23893/kraut-bierocks/", "name": "Kraut Bierocks", "summary": "\nThese meat-and-cabbage-mixture filled sweet rolls make a great main dish, and are also great as a snack.  They reheat well, so leftovers are also great!  Sauerkraut can be used in place of the cabbage for more of a 'kraut flavor'. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014314.jpg", "meta": [["prep:", "45 mins"], ["cook:", "1 hr"], ["total:", "1 hr 45 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 ½ (.25 ounce) packages active dry yeast", "½ cup white sugar", "2 cups warm water", "4 cups all-purpose flour", "½ cup powdered milk", "1 ½ teaspoons baking powder", "½ cup shortening", "1 pound lean ground beef", "1 pound ground Italian sausage", "1 cup chopped onion", "3 cups shredded cabbage", "3 tablespoons prepared mustard", "2 teaspoons salt", "2 teaspoons ground black pepper", "½ cup shredded, processed American cheese", "½ cup shredded Cheddar cheese"], "direction": ["To Make Sweet Dough: In a medium bowl combine the yeast, sugar and water and mix together; let stand 10 minutes. Stir in flour, dry milk, baking powder and shortening, then knead mixture for 10 minutes, adding as little flour as necessary. Cover bowl with a damp cloth and let rise in a warm place for 30 minutes, then knead again.", "To Make Filling: Meanwhile, brown beef, sausage and onion in a large skillet over medium high heat. Drain extra fat from skillet, then stir in cabbage, mustard, salt and pepper and cook for 5 minutes. Add cheese and cook, stirring, until cheese is melted.", "Preheat oven to 350 degrees F (175 degrees C).", "Flatten a piece of dough. Place large spoonful of meat filling onto dough and fold over to form a round bun. Lay folded-side-down in a lightly greased 9x13 inch baking dish. Repeat with remaining dough and filling.", "Bake in preheated oven for 20 minutes, or until golden brown."], "facts": "630 calories; protein 24.6g 49% DV; carbohydrates 55g 18% DV; fat 34.3g 53% DV; cholesterol 69.3mg 23% DV; sodium 1129.3mg 45% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/231728/flavorful-german-pork-chops-and-sauerkraut/", "name": "Flavorful German Pork Chops and Sauerkraut", "summary": "\nGerman dishes are great because they require very few ingredients. This easy way to make pork chops is flavorful and easy to do. By breading the pork chops before you bake them it really locks in all the flavor. When it's finished you won't even need a knife, the pork will just fall from the bone. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8591791.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 45 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 cups bread crumbs", "2  eggs, beaten", "1 tablespoon vegetable shortening (such as Crisco®), or as needed", "4  bone-in pork chops", "1 (32 ounce) package sauerkraut, undrained", "½  onion, chopped", "1 teaspoon caraway seeds"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Place bread crumbs into a shallow dish; pour eggs into a separate shallow dish. Heat vegetable shortening in a skillet over medium-high heat. Dip pork chops into egg, then into bread crumbs, coating both sides. Fry chops in the hot shortening until crumbs are golden brown, about 5 minutes per side. Transfer pork chops to a baking dish, leaving melted shortening in skillet.", "Cook and stir sauerkraut with juice, onion, and caraway seeds in the same skillet over medium-low heat until heated through, about 5 minutes. Spread sauerkraut over pork chops and pour pan liquid over the top. Cover baking dish tightly with aluminum foil.", "Bake in the preheated oven until chops are tender, 1 1/2 hour."], "facts": "553 calories; protein 37g 74% DV; carbohydrates 51.7g 17% DV; fat 21.8g 34% DV; cholesterol 159.2mg 53% DV; sodium 1987.6mg 80% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/85935/jaeger-schnitzel/", "name": "Jaeger Schnitzel", "summary": "\nThis is wonderful. Breaded and fried cubed pork with mushrooms and hunter gravy over a bed of noodles. Serve with a salad and a hunk of thick crusty bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1517732.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 pounds boneless pork chops, cubed", "oil for frying", "2  eggs, beaten", "plain bread crumbs", "3 (1 ounce) packages dry mushroom gravy mix", "1 pound fresh mushrooms, coarsely chopped", "1 (16 ounce) package dry egg noodles"], "direction": ["Pound out cubed pork, and cut in half.", "Heat oil in a large skillet or Dutch oven over medium heat. Dip pork in egg, then bread crumbs, and place in hot oil. Cook, turning, until golden brown. Remove to a warm plate.", "Prepare gravy mix according to package directions. Stir in mushrooms, and cook with gravy.", "Meanwhile, bring a large pot of lightly salted water to a boil. Add the egg noodles, and cook until al dente, about 8 to 10 minutes; drain.", "Serve pork over noodles and smother with gravy."], "facts": "455 calories; protein 38.6g 77% DV; carbohydrates 53.5g 17% DV; fat 9.1g 14% DV; cholesterol 168.7mg 56% DV; sodium 828mg 33% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228363/crispy-roasted-chicken/", "name": "Crispy Roasted Chicken", "summary": "\nThis oven-roasted chicken is inspired by the Brathaehnchen served commonly in Bavarian Biergartens, small shops, and food carts. You can serve this chicken with many side dishes, but favorites are fried potatoes or spaetzle and a nice garden salad. Weiss beer doesn't hurt at all! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1000798.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 teaspoon kosher salt", "½ teaspoon caraway seeds", "½ teaspoon dried sage", "¼ teaspoon fennel seeds", "¼ teaspoon coriander seeds", "¼ teaspoon dried rosemary", "2 tablespoons paprika", "2 teaspoons garlic powder", "2 teaspoons all-purpose flour", "1 teaspoon onion powder", "5 tablespoons vegetable oil", "1 (4 pound) broiler-fryer chicken, cut in half lengthwise"], "direction": ["Preheat oven to 425 degrees F (220 degrees C).", "In a spice grinder or mortar, combine kosher salt, caraway seeds, sage, fennel, coriander, and rosemary. Grind to a coarse powder. Transfer spice mixture to a bowl and stir in paprika, garlic powder, flour, and onion powder; mix in vegetable oil to make a smooth paste.", "Pat chicken halves dry with paper towels and tuck wing tips up behind the back. Brush spice paste onto chicken halves, coating both sides, taking care to season under wings and legs. Place chicken halves in baking dish or roasting pan with skin sides up, leaving space around chicken so halves aren't touching.", "Roast in preheated oven until a thermometer inserted in a thigh reads 165 degrees F (74 degrees C), about 1 hour. Remove from oven and let rest for 10 minutes before slicing."], "facts": "495 calories; protein 41.5g 83% DV; carbohydrates 3.1g 1% DV; fat 34.5g 53% DV; cholesterol 129.3mg 43% DV; sodium 445.6mg 18% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221947/ulis-apple-red-cabbage/", "name": "Uli's Apple Red Cabbage", "summary": "\nMy grandmother was a master housewife. She taught home economics and she could cook. When she cooked this apple red cabbage my brother and I would eat it hot or cold, with or without potatoes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1517728.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 tablespoons butter", "½ cup thick-cut bacon, diced", "½ cup diced onion", "2 cups chicken broth", "½ cup red wine, or to taste", "1 large apple, peeled and sliced", "2 tablespoons apple cider vinegar, or to taste", "2 teaspoons white sugar, or to taste", "4  whole cloves", "3  bay leaves", "¼ teaspoon ground nutmeg, or to taste", "1 pinch ground cinnamon, or to taste", "salt and ground pepper to taste", "2 ¼ pounds shredded red cabbage"], "direction": ["Melt butter in a stockpot over medium-high heat. Stir in bacon and cook until just beginning to crisp, 4 to 6 minutes. Add onions; cook and stir until onions are lightly browned and translucent, 6 to 8 minutes.", "Stir in chicken broth, red wine, apple slices, and apple cider vinegar; bring to a boil. Stir in sugar, cloves, bay leaves, nutmeg, cinnamon, salt, and black pepper. Stir in red cabbage; cover, reduce heat to low, and simmer until cabbage is soft and cooked through, 30 to 45 minutes."], "facts": "151 calories; protein 3.7g 7% DV; carbohydrates 16.2g 5% DV; fat 7.7g 12% DV; cholesterol 20.5mg 7% DV; sodium 401.9mg 16% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/218445/lengenbergs-boiled-potatoes/", "name": "Lengenberg's Boiled Potatoes", "summary": "\nThis is the perfect simple side dish for a couple of German bratwursts or schnitzel. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4559646.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 ¼ pounds medium yellow-flesh potatoes (such as Yukon gold), scrubbed, eyes removed", "1 pinch salt", "⅓ cup chopped fresh parsley"], "direction": ["Place potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Sprinkle on parsley and serve hot."], "facts": "204 calories; protein 5.4g 11% DV; carbohydrates 46.2g 15% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 56.9mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/11793/german-spaetzle-dumplings/", "name": "German Spaetzle Dumplings", "summary": "\nTraditional German dumplings.  You can also mince a few pieces of bacon in a pan, and heat the cooked spaetzle in the bacon drippings-only omit the butter, if preparing recipe with bacon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1658933.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 cup all-purpose flour", "¼ cup milk", "2  eggs", "½ teaspoon ground nutmeg", "1 pinch freshly ground white pepper", "½ teaspoon salt", "1 gallon hot water", "2 tablespoons butter", "2 tablespoons chopped fresh parsley"], "direction": ["Mix together flour, salt, white pepper, and nutmeg.  Beat eggs well, and add alternately with the milk to the dry ingredients.  Mix until smooth.", "Press dough through spaetzle maker, or a large holed sieve or metal grater.", "Drop a few at a time into simmering liquid.  Cook 5 to 8 minutes.  Drain well.", "Saute cooked spaetzle in butter or margarine.  Sprinkle chopped fresh parsley on top, and serve."], "facts": "141 calories; protein 4.7g 9% DV; carbohydrates 16.8g 5% DV; fat 6g 9% DV; cholesterol 73mg 24% DV; sodium 268.6mg 11% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/8039/bee-sting-cake-bienenstich-ii/", "name": "Bee Sting Cake (Bienenstich) II", "summary": "\nMmmm!!  This German dessert is my boyfriend's and  my favourite!!  It is bread like with a sugary-almond crunchy crust and a vanilla pudding filling!  MUST TRY! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F270399.jpg", "meta": [["Servings:", "16"], ["Yield:", "16 - 1 x 2 inch cakes"]], "ingredients": ["1 ⅝ cups all-purpose flour", "1 tablespoon active dry yeast", "2 tablespoons white sugar", "1 pinch salt", "¾ cup lukewarm milk", "3 tablespoons butter", "3 tablespoons butter", "1 ½ tablespoons confectioners' sugar", "1 tablespoon milk", "⅝ cup sliced almonds", "1 tablespoon honey  (Optional)", "1 ½ cups milk", "⅓ cup cornstarch", "1 tablespoon white sugar", "1  egg, beaten", "1 teaspoon almond extract", "1 cup heavy whipping cream", "½ tablespoon cream of tartar"], "direction": ["Combine flour, yeast, 2 tablespoons sugar, salt, 3/4 cup milk, and 3 tablespoons butter or margarine.  Turn dough out onto a lightly floured surface.  Knead until smooth and elastic, about 15 to 20 minutes.  Place in a well greased bowl, and cover.  Let rise in a warm place for 1 hour, or until doubled.", "Punch down the dough.  Roll out to a 1/2 inch thickness.  Spread  into a greased 8 inch square baking pan.  Cover, and let rise for 30 minutes.", "Melt 3 tablespoons butter or margarine and confectioner's sugar in a saucepan.  Add almonds and 1 tablespoon milk.  Remove from heat, and stir in honey.  Spread evenly and carefully onto the dough.  Allow dough to continue to rise for an additional 30 minutes.", "Bake at 400 degrees F (205 degrees C) for 20 to 25 minutes, or until crust turns golden brown. Cool completely on a wire rack.", "Dissolve cornstarch in a little milk.  Combine 1 1/2 cups milk, cornstarch, and 1 tablespoon sugar inn the top of a double boiler.  Heat while stirring until thickened, about 2 to 3 minutes.  Add in beaten egg, and keep stirring  for about 2 more minutes, or until thick.  Remove from heat, and stir in extract.  Chill, covered, in refrigerator for at least 1 hour.  Beat the whipping cream with the cream of tartar until stiff.  Fold into the chilled pudding.", "Cut the cooled almond crust bread into 1 1/4 x 2 inch rectangles.  Slice each horizontally into halves.   Fill with pudding mixture.  Chill, and serve cold."], "facts": "226 calories; protein 4.9g 10% DV; carbohydrates 20.2g 7% DV; fat 14.4g 22% DV; cholesterol 46.3mg 15% DV; sodium 56.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/85194/semmelknoedel-bread-dumplings/", "name": "Semmelknoedel (Bread Dumplings)", "summary": "\nMy Bavarian Oma made these large dumplings to accompany roast pork or game dishes, any meat with gravy, or with mushrooms in a creamy sauce. Serve one dumpling alongside your dish, and cover with a little gravy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54812.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (1 pound) loaf stale French bread, cut into 1 inch cubes", "1 cup milk", "2 tablespoons butter", "1  onion, finely chopped", "1 tablespoon chopped fresh parsley", "2  eggs", "½ teaspoon salt", "1 pinch ground black pepper", "½ cup dry bread crumbs  (Optional)"], "direction": ["Place the bread cubes into a large bowl. Heat the milk until it starts to bubble at the edges, then pour it over the bread cubes. Stir briefly to coat the bread.  Let soak for 15 minutes.", "Meanwhile, melt the butter in a skillet over medium heat. Add the onions; cook and stir until tender. Stir in the parsley, and remove from the heat. Mix into the bowl with the bread along with the eggs, salt and pepper. Use your hands, squeezing the dough through your fingers until it is smooth and sticky.", "Bring a large pot of lightly salted water to a boil. The water should be at least 3 or 4 inches deep. When the water is boiling, make a test dumpling about the size of a small orange or tangerine, by patting and cupping between wet hands. Gently drop into the boiling water. If it falls apart, the dough is too wet. In this case, stir some bread crumbs into the rest of the dumpling batter.", "Form the remaining dough into large dumplings, and carefully drop into the boiling water. Simmer for 20 minutes, then remove to a serving plate with a large slotted spoon. They should come out soft, spongy and delicious!"], "facts": "506 calories; protein 20.5g 41% DV; carbohydrates 78.8g 25% DV; fat 12.3g 19% DV; cholesterol 113.1mg 38% DV; sodium 1220.1mg 49% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/171660/kaiserschmarren/", "name": "Kaiserschmarren", "summary": "\nA German dessert that tastes like something in between a pancake and a waffle.  It's also good for breakfast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1354614.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  eggs, separated", "½ cup milk", "½ cup white sugar", "1 pinch salt", "1 cup all-purpose flour", "⅔ cup raisins  (Optional)", "1 tablespoon butter", "2 tablespoons confectioners' sugar", "2 cups applesauce  (Optional)"], "direction": ["Beat the egg whites in a clean bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Beat the egg yolks in a separate bowl until smooth; mix in the milk, sugar, salt, flour, and raisins until just moistened. Fold in the egg whites.", "Melt the butter in a large skillet over medium heat. Pour the batter into the skillet and cook until golden brown; flip and cook until set on the other side, about 1 minute. Tear the kaiserschmarren into pieces using two forks and continue cooking until golden brown, about 2 minutes. Sprinkle with confectioners' sugar to garnish and serve with applesauce."], "facts": "472 calories; protein 11.6g 23% DV; carbohydrates 89.9g 29% DV; fat 8.9g 14% DV; cholesterol 196.1mg 65% DV; sodium 109.1mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/", "name": "Juicy Roasted Chicken", "summary": "\nMy grandmother's recipe for roasted chicken. We are German and she used to do it this way all the time. I never have had a chicken this juicy before; this little trick works and makes the people eating it go silent. It's funny. We nibble on the celery after. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389250.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["additional:", "15 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (3 pound) whole chicken, giblets removed", "salt and black pepper to taste", "1 tablespoon onion powder, or to taste", "½ cup margarine, divided", "1 stalk celery, leaves removed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.", "Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."], "facts": "423 calories; protein 30.9g 62% DV; carbohydrates 1.2g; fat 32.1g 49% DV; cholesterol 97mg 32% DV; sodium 661.9mg 27% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7915/german-apple-cake-i/", "name": "German Apple Cake I", "summary": "\nThis German Apple Cake is a moist dense cake that keeps well. It has been a family favorite for twenty years. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2327614.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 -9x13 inch cake"]], "ingredients": ["2  eggs", "1 cup vegetable oil", "2 cups white sugar", "2 teaspoons ground cinnamon", "½ teaspoon salt", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "4 cups apples - peeled, cored and diced"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch cake pan.", "In a mixing bowl; beat oil and eggs with an electric mixer until creamy. Add the sugar and vanilla and beat well.", "Combine the flour salt, baking soda, and ground cinnamon together in a bowl. Slowly add this mixture to the egg mixture and mix until combined. The batter will be very thick. Fold in the apples by hand using a wooden spoon. Spread batter into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for 45 minutes or until cake tests done. Let cake cool on a wire rack. Once cake is cool serve with a dusting of confectioners' sugar or with a Cream Cheese Frosting."], "facts": "201 calories; protein 1.7g 3% DV; carbohydrates 27.7g 9% DV; fat 9.7g 15% DV; cholesterol 15.5mg 5% DV; sodium 107.2mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221361/traditional-sauerbraten/", "name": "Traditional Sauerbraten", "summary": "\nI found two slightly different hand written versions of this, my Grandmother's recipe. Born in Nekkar am Rhein in the 1904, she naturally learned to cook traditional German meals as a young woman and didn't rely on a cookbook. I try to capture the nuance in this. Serve with potato dumplings. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888826.jpg", "meta": [["prep:", "15 mins"], ["cook:", "4 hrs"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds beef rump roast", "2 large onions, chopped", "1 cup red wine vinegar, or to taste", "1 cup water", "1 tablespoon salt", "1 tablespoon ground black pepper", "1 tablespoon white sugar", "10  whole cloves, or more to taste", "2  bay leaves, or more to taste", "2 tablespoons all-purpose flour", "salt and ground black pepper to taste", "2 tablespoons vegetable oil", "10  gingersnap cookies, crumbled"], "direction": ["Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.", "Season flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.", "Heat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes. Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours. Remove beef to a platter and slice.", "Strain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened about 10 minutes. Serve gravy over sliced beef."], "facts": "456 calories; protein 40.7g 81% DV; carbohydrates 20.9g 7% DV; fat 22.3g 34% DV; cholesterol 100.3mg 33% DV; sodium 1682.5mg 67% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/216330/german-pork-chops-and-sauerkraut/", "name": "German Pork Chops and Sauerkraut", "summary": "\nAs a soldier during WWII my Dad learned to make this hearty pork dish from a local German woman during the Allied occupation of Germany. I don't know the German name for it, but it is delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2384863.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  center cut pork chops", "2 pounds sauerkraut, drained", "1 large red apple, diced", "1  onion, chopped", "1 cup brown sugar", "1 tablespoon caraway seeds"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Heat a large nonstick skillet over medium-high heat, and brown the pork chops on both sides, about 5 minutes per side. Place the chops into a 9x13-inch baking dish.", "Mix the sauerkraut, apple, onion, brown sugar, and caraway seeds in a bowl until well combined, and spread the sauerkraut mixture over the pork chops. Cover the dish with aluminum foil.", "Bake in the preheated oven until the pork is no longer pink inside, about 45 minutes. An instant-read thermometer inserted into the center of a chop should read 145 degrees F (63 degrees C)."], "facts": "363 calories; protein 29.2g 59% DV; carbohydrates 38.6g 12% DV; fat 10.4g 16% DV; cholesterol 70.2mg 23% DV; sodium 800mg 32% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/60708/jagerschnitzel/", "name": "Jagerschnitzel", "summary": "\nThis is a delicious dish I ordered again and again when I was stationed in Germany with the Army.  It is best served with French fries to clean up the remaining gravy and a nice garden salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F433.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup bread crumbs", "1 tablespoon all-purpose flour", "salt and pepper to taste", "2 tablespoons vegetable oil", "4  pork steaks or cutlets, pounded thin", "1  egg, beaten", "1 medium onion, diced", "1 (8 ounce) can sliced mushrooms", "1 ½ cups water", "1 cube beef bouillon", "1 tablespoon cornstarch", "½ cup sour cream"], "direction": ["In a shallow dish, mix together the bread crumbs and flour. Season with salt and pepper. Place the egg in a separate dish. Heat oil in a large skillet over medium-high heat. Dip pork steaks in egg, then coat with the bread crumb mixture. Fry in the hot oil until browned on both sides and cooked through, about 5 minutes per side.", "Remove the pork to a platter and keep warm. Add onion and mushrooms to the skillet and cook until lightly browned. Pour in water and dissolve the bouillon cube. Simmer for about 20 minutes. Stir together the cornstarch and sour cream; stir into the skillet. Cook over low heat until thickened but do not boil.  Spoon over the pork cutlets and serve immediately."], "facts": "556 calories; protein 32.9g 66% DV; carbohydrates 29.9g 10% DV; fat 33.5g 52% DV; cholesterol 157mg 52% DV; sodium 682.8mg 27% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/25194/german-rouladen/", "name": "German Rouladen", "summary": "\nMeat rolls filled with bacon, onions and pickles.  Delicious, easy recipe learned while visiting Germany. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F357630.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds flank steak", "German stone ground mustard, to taste", "½ pound thick sliced bacon", "2 large onions, sliced", "1 (16 ounce) jar dill pickle slices", "2 tablespoons butter", "2 ½ cups water", "1 cube beef bouillon"], "direction": ["Cut the flank steak into thin filets; about 1/4 inch thick and 3 inches wide.", "Generously spread one side of each filet with mustard to taste. Place bacon, onions and pickle slices on each filet and form into a roll. Use string or toothpicks to hold the roll together.", "Heat a skillet over medium heat and melt butter. Place the rolls in the butter and saute until browned.", "Pour in 2 1/2 cups of water and add the bouillon cube; stirring to dissolve the bouillon cube. Simmer the rolls for about an hour."], "facts": "264 calories; protein 19.1g 38% DV; carbohydrates 7.7g 3% DV; fat 17.4g 27% DV; cholesterol 59.4mg 20% DV; sodium 1449.5mg 58% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/24674/german-zwiebelkuchen-onion-pie/", "name": "German Zwiebelkuchen (Onion Pie)", "summary": "\nZwiebelkuchen is an onion pie from Swabia, in south-central Germany.    It is a special time of year, in the fall, when the mom & pop winemakers will open a BasinWirtschaft in their barn or garage. They serve the new wine, fresh zwiebelkuchen, and perhaps some wurst, for a minimal fee.  A few tables are set up, and they are open when they have time to serve.  To indicate they are serving, they will hang a straw broom over the doorway. The combination of the onions and the 'green' wine can have explosive consequences later on! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4571410.jpg", "meta": [["prep:", "1 hr"], ["cook:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "11"], ["Yield:", "10 to 12 servings"]], "ingredients": ["6 pounds onions, sliced", "4 slices bacon", "1 (16 ounce) container sour cream", "4  egg", "2 tablespoons all-purpose flour", "½ teaspoon salt", "½ teaspoon caraway seed", "2 recipes pastry for a 9 inch single crust pie"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Line a jelly-roll pan or large pizza pan with prepared dough, making sure dough extends up sides of pan.", "Saute onion in a skillet until translucent and pour cooked onion into a large mixing bowl. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, chop and add to onion; mix well.", "Stir in sour cream. Beat eggs enough to break up yolks, then mix in to pie mixture. Add flour to thicken mixture (onions will create a lot of water), then add salt. Mix well and pour mixture into prepared pan. Sprinkle top with caraway seed.", "Bake in preheated oven for about 1 hour, or until onions start to turn golden brown on top."], "facts": "441 calories; protein 10.3g 21% DV; carbohydrates 43.2g 14% DV; fat 26.4g 41% DV; cholesterol 92.7mg 31% DV; sodium 415.4mg 17% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221351/german-hamburgers-frikadellen/", "name": "German Hamburgers (Frikadellen)", "summary": "\nThe original hamburger, these are served like a flattened meatball with some steamed string beans and salad. I also like to use this recipe to make Swedish meatballs (but omit the paprika). My Aunt in Hamburg, Germany taught me this recipe and I've been making them ever since. Serve with steamed string beans and tossed salad. Or serve on a Kaiser roll with lettuce, tomato, pickled cucumbers, finely sliced deep fried onions and curry ketchup. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2065105.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "10 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  Kaiser roll", "⅔ pound ground beef", "⅓ pound ground pork", "1  onion, finely chopped", "¼ cup chopped fresh parsley", "1  egg", "1 teaspoon Hungarian hot paprika  (Optional)", "salt and ground black pepper to taste"], "direction": ["Soak Kaiser roll in a bowl of water for 10 minutes. Drain, squeezing out excess water, and crumble into a large bowl.", "Mix crumbled roll with ground beef, ground pork, onion, parsley, egg, paprika, salt, and black pepper until well blended. Shape meat into large flattened meatballs.", "Heat a large nonstick skillet over medium heat; fry meatballs until browned and no longer pink in the center, about 5 minutes per side."], "facts": "272 calories; protein 22.4g 45% DV; carbohydrates 8.5g 3% DV; fat 16g 25% DV; cholesterol 116.8mg 39% DV; sodium 137.8mg 6% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/146229/slow-cooker-german-style-pork-roast-with-sauerkraut-and-potatoes/", "name": "Slow Cooker German-Style Pork Roast with Sauerkraut and Potatoes", "summary": "\nPork loin becomes tender and delicious cooked slowly with sauerkraut and caraway seeds. This gets raves from my German father. My Irish husband loves it too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F484148.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 hrs"], ["total:", "8 hrs 20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6  white potatoes, peeled and quartered", "1 tablespoon minced garlic", "salt and pepper to taste", "1 (3 pound) boneless pork loin roast", "1 (32 ounce) jar sauerkraut with liquid", "2 teaspoons caraway seeds"], "direction": ["Place the potatoes, garlic, salt, and pepper in a slow cooker; stir to coat. Season the pork roast with salt and pepper; lay atop the potatoes. Pour the sauerkraut over the roast; sprinkle with caraway seeds.", "Cook in slow cooker on Low 8 to 10 hours."], "facts": "386 calories; protein 31.3g 63% DV; carbohydrates 30.5g 10% DV; fat 15.2g 23% DV; cholesterol 82.9mg 28% DV; sodium 809.8mg 32% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7570/battenburg-cake/", "name": "Battenburg Cake", "summary": "\nThis fancy almond-flavored tea cake, also called 'Battenberg/Battenburg Cake' or 'Battenberg/Battenburg Square' features a homemade marzipan. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2692736.jpg", "meta": [["prep:", "30 mins"], ["cook:", "30 mins"], ["additional:", "30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "12"], ["Yield:", "2 layer cake"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "3  eggs", "¼ teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "⅛ teaspoon salt", "2 drops red food coloring", "1 cup apricot preserves", "2 cups ground almonds", "3 cups confectioners' sugar", "1  egg, room temperature", "1 ½ teaspoons lemon juice", "¼ teaspoon almond extract"], "direction": ["Cream butter and 1 cup sugar together.  Beat in 3 eggs, one at a time.  Mix in vanilla.  Stir in flour, baking powder and salt gently.  Add milk if needed.", "Divide batter into 2 equal parts.  Add food coloring to 1 part to make a deep pink color.  Grease two 7 inch square pans.  Spread batters into pans.", "Bake at 350 degrees F (175 degrees C) until an inserted wooden pick comes out clean, about 25 to 30 minutes.  Let stand in pans 5 minutes.  Turn out on racks to cool.", "Trim edges from both cakes.  Cut each cake lengthwise into 4 strips as wide as the cake is thick.  Trim to make strips match.  Heat jam slightly.  Spread on sides to glue 2 pink and 2 white strips together checkerboard fashion.  Spread all 4 sides of completed cake with jam. Repeat with remaining pink and white stripes.  Makes two cakes.", "To Make Almond Paste:  Mix almonds, confectioners' sugar, egg, lemon juice, and almond extract together.  Knead until smooth, adding a bit of lemon juice or water if too dry to roll.   Add only 1/2 teaspoon at a time.  It will be stiff.  Divide into 2 equal parts.", "Roll 1/2 of paste 1/8 inch or so thick on a surface lightly dusted with confectioners' sugar.  Cut to fit length of cake, and long enough to cover 4 sides leaving ends uncovered.  Lay cake on one end of paste.  Wrap to completely enclose all 4 sides of cake pinching paste to seal.  Roll in granulated sugar.  Place with seal underneath on serving plate, or store in plastic bag.  Repeat for second cake.  Chill.  Slice thinly to serve."], "facts": "646 calories; protein 10.6g 21% DV; carbohydrates 85.5g 28% DV; fat 31.6g 49% DV; cholesterol 102.7mg 34% DV; sodium 208.8mg 8% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/15765/german-apple-cake-ii/", "name": "German Apple Cake II", "summary": "\nApple cake with cream cheese frosting. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F126378.jpg", "meta": [["Servings:", "24"], ["Yield:", "1 - 9x13 inch cake"]], "ingredients": ["2  eggs", "1 cup vegetable oil", "2 cups white sugar", "2 cups all-purpose flour", "1 teaspoon baking soda", "2 teaspoons ground cinnamon", "1 teaspoon salt", "1 teaspoon vanilla extract", "4 cups apples - peeled, cored and diced", "½ cup chopped walnuts", "2 (3 ounce) packages cream cheese", "3 tablespoons butter, softened", "1 ½ cups confectioners' sugar", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and four a 9x13 inch pan. In a medium bowl, mix together flour, baking soda, cinnamon and salt. Set aside.", "In a large bowl, combine eggs, oil and sugar. Beat until foamy. Add flour mixture and beat well. Add vanilla and stir in chopped apples and walnuts. Pour into a 9x13 inch pan.", "Bake for 45 to 50 minutes, or until a toothpick inserted into the cake comes out clean. Allow cake to cool, then spread with cream cheese frosting.", "To make the frosting: In a medium bowl, combine cream cheese, softened butter, confectioners sugar and 1 teaspoon vanilla. Beat until smooth, then spread on cake."], "facts": "284 calories; protein 2.6g 5% DV; carbohydrates 35.7g 12% DV; fat 15.2g 23% DV; cholesterol 27.1mg 9% DV; sodium 187mg 8% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/150123/traditional-springerle/", "name": "Traditional Springerle", "summary": "\nWe have made these very traditional German cookies every year since I was a child. My mother remembers her grandmother making them with this recipe that has been in our family for generations. The molds can be hard to find, but check specialty cookware stores and antique shops. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7499595.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["additional:", "8 hrs"], ["total:", "8 hrs 35 mins"], ["Servings:", "48"], ["Yield:", "48 servings"]], "ingredients": ["1 ½ tablespoons crushed anise seeds", "3 ½ cups all-purpose flour", "1 teaspoon baking powder", "4  eggs", "2 cups sugar", "½ teaspoon vanilla extract", "¼ cup confectioners' sugar"], "direction": ["Lightly grease 4 cookie sheets. Sprinkle with anise seeds. Set aside until needed.", "Mix the flour and baking powder together in a bowl until well blended. Place the eggs, sugar, and vanilla in a large bowl; beat until light and frothy, 5 to 8 minutes. Slowly stir in the flour mixture until a thick dough forms.", "Working with handfuls of dough, roll out the dough onto a lightly floured surface until 1/4 inch thick. Lightly sift confectioners' sugar over the dough. Place springerle molds onto the dough; press down hard and evenly until the mold's design registers in the dough. Remove the mold. Use a small knife to cut around each cookie, and place on prepared cookie sheets. Repeat, until all dough has been used. Cover the cookies with a lightweight cotton cloth, and allow to dry 8 hours, or overnight.", "Preheat oven to 250 degrees F (120 degrees C).", "Bake cookies in preheated oven until tops are pale brown and set, 25 to 30 minutes. Cool on a rack. Store in an airtight container."], "facts": "75 calories; protein 1.5g 3% DV; carbohydrates 16.1g 5% DV; fat 0.5g 1% DV; cholesterol 15.5mg 5% DV; sodium 16.2mg 1% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/149686/german-beef-rouladen/", "name": "German Beef Rouladen", "summary": "\nThis is another great German recipe that reminds me of my mom's wonderful cooking.  Enjoy this unique and delicious dish! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2246370.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 rouladen"]], "ingredients": ["¼ cup Dijon mustard", "8 (4 ounce) pieces round steak, pounded 1/4 inch thick", "½ cup minced onion", "2 teaspoons paprika", "2 teaspoons salt", "2 teaspoons freshly ground black pepper", "8 slices bacon", "3 tablespoons canola oil", "1 (12 ounce) can beef broth", "1 ¼ cups water", "2 tablespoons cornstarch", "1 cup warm water", "¼ cup sour cream"], "direction": ["Spread 1/2 tablespoon mustard over one side of each piece of meat. Sprinkle the onion, paprika, salt, and pepper evenly over the steaks. Lay one slice of bacon on each piece. Roll the steaks jelly-roll style and secure with toothpicks.", "Heat the canola oil in a skillet over medium heat. Cook meat on all sides until browned. Add the beef broth and water; bring to a boil. Reduce heat to medium low; cover and simmer until tender, about 30 minutes.", "Remove the meat rolls. Strain the broth mixture and return liquid to the skillet. Whisk together the cornstarch and 1 cup of water. Slowly pour the cornstarch slurry into the skillet, stirring continually until the sauce has thickened, 2 to 3 minutes. Stir in the sour cream. Return rolls to the sauce; serve immediately."], "facts": "351 calories; protein 44.6g 89% DV; carbohydrates 5.4g 2% DV; fat 15.6g 24% DV; cholesterol 113.2mg 38% DV; sodium 1132.7mg 45% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228364/oktoberfest-chicken-and-red-cabbage/", "name": "Oktoberfest Chicken and Red Cabbage", "summary": "\nI adore Bavarian cuisine! And since there's no good German food here (while I lived in San Francisco, my husband and I ate at wonderful German/Hungarian restaurants there), I have to make my own...This recipe is crazy simple. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5856617.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 slices bacon", "1 tablespoon bacon drippings", "¼ cup all-purpose flour", "½ teaspoon kosher salt", "½ teaspoon smoked paprika", "2 pounds skinless chicken thighs", "1  red onion, sliced", "1 large apple, cored and sliced", "1 head red cabbage, cored and sliced", "½ cup red wine vinegar", "¼ cup dry red wine", "¼ cup brown sugar", "½ teaspoon ground cinnamon  (Optional)"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place bacon in a large oven-safe or cast-iron skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. When cool, crumble bacon; leave bacon drippings in the skillet.", "Whisk flour, kosher salt, and smoked paprika together in a bowl. Coat chicken thighs in the seasoned flour and brown on both sides in the hot bacon fat over medium heat, about 5 minutes per side; transfer chicken to a plate. Drain bacon grease except for 1 tablespoon; cook and stir onion and apple until onion is translucent and apple is softened, about 5 minutes. Stir red cabbage and bacon into onion-apple mixture, sprinkle with a pinch of kosher salt, and cook, stirring often, until cabbage is softened, 5 to 8 minutes.", "Pour red wine vinegar and red wine into skillet. Stir in brown sugar and cinnamon and bring cabbage mixture to a boil; cook until sauce is reduced by half, stirring often, about 10 minutes. Arrange chicken thighs on top of cabbage in the skillet.", "Bake in the preheated oven until cabbage is tender and chicken is cooked through, about 40 minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read at least 160 degrees F (70 degrees C)."], "facts": "271 calories; protein 22.5g 45% DV; carbohydrates 23.9g 8% DV; fat 9.2g 14% DV; cholesterol 72.4mg 24% DV; sodium 292.2mg 12% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/216081/sausage-and-sauerkraut/", "name": "Sausage and Sauerkraut", "summary": "\nThis is a recipe from a sweet old German lady I used to attend church with. Allow for plenty of time to prepare and cook this dish.  It is definitely worth the time and effort! Serve with hot German potato salad and red cabbage. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F802499.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 hrs 20 mins"], ["total:", "3 hrs 35 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 pounds sauerkraut, rinsed and drained", "1 tablespoon caraway seeds  (Optional)", "¼ cup brown sugar", "1  apple, diced", "½ pound bacon, cut into 1-inch pieces", "1 large onion, chopped", "1 ½ pounds kielbasa sausage, cut into 1-inch thick slices"], "direction": ["Place the sauerkraut, caraway seeds, brown sugar, and apple into a large saucepan over medium-low heat, and bring the mixture to a simmer. Reduce heat to low, and cook for 2 hours, stirring occasionally.", "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.", "Place the bacon and onion into a skillet over medium heat, and cook until the bacon is almost crisp and the onion is beginning to brown, about 10 minutes. Stir the bacon mixture into the sauerkraut. In the same skillet, brown the kielbasa sausage in the remaining bacon grease until the sausage begins to brown, 10 to 15 minutes; stir into the sauerkraut mixture. Spoon the sauerkraut and sausage mixture into the prepared baking dish.", "Bake in the preheated oven until bubbling, about 1 hour."], "facts": "777 calories; protein 24.6g 49% DV; carbohydrates 28.6g 9% DV; fat 62.3g 96% DV; cholesterol 128.2mg 43% DV; sodium 2702.1mg 108% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/78117/wienerschnitzel/", "name": "Wienerschnitzel", "summary": "\nThis easy German recipe is one of our favorites. Boneless pork chops can also be substituted for veal and taste excellent! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4560415.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ½ pounds veal cutlets", "½ cup all-purpose flour", "3 tablespoons grated Parmesan cheese", "2  eggs", "1 teaspoon minced parsley", "½ teaspoon salt", "¼ teaspoon pepper", "1 pinch ground nutmeg", "2 tablespoons milk", "1 cup dry bread crumbs", "6 tablespoons butter", "4 slices  lemon"], "direction": ["Place each veal cutlet between two pieces of plastic wrap, and pound with the flat side of a meat mallet until about 1/4 inch thick. Dip in flour to coat.", "In a medium bowl, stir together the Parmesan cheese, eggs, parsley, salt, pepper, nutmeg and milk. Place bread crumbs on a plate. Dip each cutlet into the egg mixture, then press in the bread crumbs to coat. Place coated cutlets on a plate and refrigerate for 1 hour or overnight.", "Melt butter in a large skillet over medium heat. Cook the breaded cutlets until browned on each side, about 3 minutes per side. Remove to a serving platter, and pour the pan juices over them. Garnish with lemon slices."], "facts": "515 calories; protein 29.1g 58% DV; carbohydrates 33.7g 11% DV; fat 29.1g 45% DV; cholesterol 229.6mg 77% DV; sodium 781.7mg 31% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/244200/chef-johns-beef-rouladen/", "name": "Chef John's Beef Rouladen", "summary": "\nFor something that looks and tastes as impressive as this beef rouladen, it's actually one of the simplest stuffed meat recipes I know. You can pretty much use any cheap cut of beef; I used round steak, but rump, chuck, flap meat, and other similar cuts will work work. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7709567.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 30 mins"], ["additional:", "5 mins"], ["total:", "1 hr 50 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 (6 ounce) (1/4 inch thick) slices of beef round", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "2 tablespoons Dijon mustard", "4 strips bacon", "paprika, or to taste", "½  onion, sliced into half-rings and separated", "6  dill pickle spears", "1 tablespoon vegetable oil"], "direction": ["Place slices of beef on a work surface, Season both sides with kosher salt and pepper. Spread one side with mustard. Place bacon strips on the mustard and sprinkle with paprika. Arrange onion slices cross-wise on the beef. Then evenly space 3 pickle slices across each slice of beef. Keep about an inch of the narrowest end of the beef slice free of toppings to facilitate rolling it up.", "Roll each slice of meat, beginning from the wider of the two short ends, working to keep all ingredients inside the roll. Rolls should be nice and tight. Secure the rolls (seam side down) with 3 loops of butcher's twine, one in the middle and one at each end. Trim excess string.", "Heat vegetable oil over medium-high heat in a large saucepan. Cook beef, turning and browning well on all sides, about 8 minutes. Remove meat from pan. Reduce heat to medium-low. Melt butter in the pan; whisk in the flour, cooking for about 1 minute. Pour in cold beef broth and whisk vigorously to combine. Raise heat to medium-high and simmer until sauce begins to thicken, about 1 minute.", "Transfer beef rolls to pan along with accumulated juices. Reduce heat to very low. Simmer gently, covered, turning rolls every 20 minutes or so, until beef is tender, about 1 1/2 hours. When the tip of a sharp knife can easily be inserted into the beef roll, the meat is done.", "Transfer meat to dish to allow it to rest. Raise heat to high and bring cooking liquid to a simmer to thicken slightly to make a gravy, about 1 minute. Serve rouladen with gravy."], "facts": "641 calories; protein 47.8g 96% DV; carbohydrates 22.8g 7% DV; fat 38.8g 60% DV; cholesterol 141.3mg 47% DV; sodium 5266.1mg 211% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/155182/pfeffernusse-cookies/", "name": "Pfeffernusse Cookies", "summary": "\nI have searched far and wide for a recipe that mimics my favorite, store-bought version of these cookies. I think, after days of thrown-out cookies, I have come as close as I can get. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4807631.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs"], ["Servings:", "18"], ["Yield:", "3 dozen cookies"]], "ingredients": ["½ cup molasses", "¼ cup honey", "¼ cup shortening", "¼ cup margarine", "2  eggs", "4 cups all-purpose flour", "¾ cup white sugar", "½ cup brown sugar", "1 ½ teaspoons ground cardamom", "1 teaspoon ground nutmeg", "1 teaspoon ground cloves", "1 teaspoon ground ginger", "2 teaspoons anise extract", "2 teaspoons ground cinnamon", "1 ½ teaspoons baking soda", "1 teaspoon ground black pepper", "½ teaspoon salt", "1 cup confectioners' sugar for dusting"], "direction": ["Stir together the molasses, honey, shortening, and margarine in a saucepan over medium heat; cook and stir until creamy. Remove from heat and allow to cool to room temperature. Stir in the eggs.", "Combine the flour, white sugar, brown sugar, cardamom, nutmeg, cloves, ginger, anise, cinnamon, baking soda, pepper, and salt in a large bowl. Add the molasses mixture and stir until thoroughly combines. Refrigerate at least 2 hours.", "Preheat oven to 325 degrees F (165 degrees C). Roll the dough into acorn-sized balls. Arrange on baking sheets, spacing at least 1 inch apart.", "Bake in preheated oven 10 to 15 minutes. Move to a rack to cool. Dust cooled cookies with confectioners' sugar."], "facts": "284 calories; protein 3.7g 7% DV; carbohydrates 53.9g 17% DV; fat 6.3g 10% DV; cholesterol 20.7mg 7% DV; sodium 212.8mg 9% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/228406/beer-glazed-brats-and-sauerkraut/", "name": "Beer Glazed Brats and Sauerkraut", "summary": "\nI came up with this recipe, because simply simmering sausages in beer and onions tasted weak. I was looking for a more intense beer flavor with a little bite, and this is it. A very satisfying dish if you crave German flavor that's Americanized. We love this dish served on potato rolls with spicy hot German mustard, Swiss cheese, and ice cold beer on the side. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F876299.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["⅛ teaspoon celery seeds", "⅛ teaspoon caraway seeds", "1 pound fresh bratwurst sausages", "1 (12 fluid ounce) can or bottle lager beer", "1 tablespoon light brown sugar", "2 teaspoons dry mustard powder", "1 teaspoon onion powder", "⅛ teaspoon ground black pepper", "⅛ teaspoon dried dill weed", "1 pound sauerkraut (preferably barrel-aged), drained"], "direction": ["Crush celery seeds and caraway seeds in a mortar and pestle until ground; set aside.", "Place bratwursts into a large nonstick skillet over medium heat. Mix beer, brown sugar, dry mustard, onion powder, black pepper, dill weed, and crushed celery and caraway seeds in a bowl, stirring to dissolve brown sugar; pour over the brats. Bring to a boil and reduce heat to low; cover and simmer for 10 minutes.", "Uncover and raise heat to medium; boil the sauce until it reduces to a thick, syrupy liquid, about 20 minutes. Tilt skillet to roll brats in the sticky sauce until thoroughly coated. Transfer sausage to a platter and keep warm. Cook and stir sauerkraut in the same skillet to mix in any leftover sauce, 5 to 8 minutes. Transfer sauerkraut to a serving platter and top with cooked bratwurst."], "facts": "296 calories; protein 10.5g 21% DV; carbohydrates 11.6g 4% DV; fat 21.1g 33% DV; cholesterol 45.9mg 15% DV; sodium 1225.8mg 49% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221360/kates-easy-german-sauerbraten/", "name": "Kate's Easy German Sauerbraten", "summary": "\nThis is a slow-cooker version of a classic German recipe. Sauerbraten is often served with red cabbage and spaetzle noodles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1052841.jpg", "meta": [["prep:", "30 mins"], ["cook:", "8 hrs 20 mins"], ["additional:", "2 days"], ["total:", "2 days"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups water", "1 cup red wine", "1 cup cider vinegar", "1  lemon, sliced", "½ large onion, diced", "1 clove garlic, diced", "10  whole cloves", "2  bay leaves", "2 tablespoons white sugar", "2 tablespoons salt", "1 tablespoon juniper berries, crushed  (Optional)", "1 teaspoon whole peppercorns", "1 (4 pound) boneless beef chuck roast", "2 cups chopped onions", "2 cups chopped carrots", "1 cup diced celery", "8  gingersnap cookies, crushed"], "direction": ["Heat water, red wine, cider vinegar, lemon, 1/2 onion, garlic, cloves, bay leaves, white sugar, salt, juniper berries, and peppercorns in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Allow marinade to cool and pour into a resealable plastic bag. Add beef roast, coat with marinade, squeeze out excess air, and seal bag. Marinate in the refrigerator 2 to 3 days, turning the roast twice a day.", "Place onions, carrots, and celery in a slow cooker. Remove roast from marinade and place atop vegetables. Strain marinade and pour 2 1/2 cups over roast; reserve remaining marinade.", "Cover and cook roast on Low for 8 hours. Turn slow cooker off. Transfer roast to a cutting board and cover with aluminum foil. Strain cooking liquid into a large bowl and return vegetables to slow cooker to rest.", "Heat about 3 cups cooking liquid and gingersnaps in a saucepan over medium-high heat, adding reserved marinade as needed, until gravy is thickened, about 10 minutes.", "Slice roast and serve with vegetables and gravy."], "facts": "460 calories; protein 27.8g 56% DV; carbohydrates 17.9g 6% DV; fat 27g 42% DV; cholesterol 103.3mg 35% DV; sodium 1875.3mg 75% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/221383/apfelkuchen-apple-cake/", "name": "Apfelkuchen (Apple Cake)", "summary": "\nI fell in love with apfelkuchen when I was in 6th grade. Our teacher let us order from a local German bakery and eat our treats in class once a month. These flavors bring back wonderful memories. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2133917.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "30 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch cake"]], "ingredients": ["2 ¼ cups sifted all-purpose flour", "1 ⅛ cups warm milk", "¼ cup white sugar", "1 (.25 ounce) package active dry yeast", "6 tablespoons butter, softened", "1 tablespoon vanilla extract", "1 pinch salt", "3 large apples - peeled, cored, and sliced", "1 cup white sugar", "¾ cup sifted all-purpose flour", "2 ounces candied lemon peel, chopped", "½ teaspoon ground cinnamon", "¼ teaspoon ground nutmeg", "1 pinch salt", "½ cup butter"], "direction": ["Grease the bottom and sides of a 9x13-inch baking dish or a 9-inch springform pan.", "Beat 2 1/4 cup flour, milk, 1/4 cup sugar, yeast, 6 tablespoons butter, vanilla extract, and 1 pinch salt in a large bowl with an electric mixer on high until dough is smooth, about 5 minutes; spread into baking dish and press dough up the sides. Press apple slices into dough.", "Mix 1 cup sugar, 3/4 cup flour, candied lemon peel, cinnamon, nutmeg, and 1 pinch salt in a bowl. Cut in 1/2 cup butter with a knife or pastry blender until mixture resembles coarse crumbs; sprinkle over apples. Allow dough to rise for 30 minutes.", "Preheat oven to 400 degrees F (200 degrees C).", "Bake in preheated oven until cake is golden brown and apples are tender, about 35 minutes."], "facts": "370 calories; protein 4.5g 9% DV; carbohydrates 57.1g 18% DV; fat 14.3g 22% DV; cholesterol 37.4mg 13% DV; sodium 136mg 5% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/219065/willard-family-german-chocolate-cake/", "name": "Willard Family German Chocolate Cake", "summary": "\nThis recipe has been in my family for a very long time. My great-grandma could make this with her eyes closed. My father was born on her birthday so she made this cake for him every year. Even shipped it to him in Korea when he was stationed there in the army. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5625976.jpg", "meta": [["prep:", "30 mins"], ["cook:", "50 mins"], ["additional:", "1 hr"], ["total:", "2 hrs 20 mins"], ["Servings:", "10"], ["Yield:", "1 3-layer cake"]], "ingredients": ["1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®) - broken into pieces", "½ cup boiling water", "1 cup margarine, softened", "2 cups white sugar", "4  eggs, separated", "1 teaspoon vanilla extract", "2 ½ cups sifted all purpose flour", "1 teaspoon baking soda", "½ teaspoon salt", "1 cup buttermilk", "1 cup evaporated milk", "1 cup white sugar", "3  egg yolks", "¼ cup margarine", "1 teaspoon vanilla extract", "1 ⅓ cups sweetened flake coconut", "1 cup chopped pecans"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 8-inch cake pans and line bottoms with parchment paper.", "Place the chunks of chocolate into the boiling water and stir until the chocolate has melted; set aside to cool. In a large bowl, beat 1 cup of softened margarine with 2 cups of sugar with an electric mixer until light and fluffy. Stir in 4 egg yolks, one at a time, beating well after each addition. Beat in 1 teaspoon of vanilla extract and the chocolate-water mixture until thoroughly blended.", "Sift the flour, baking soda, and salt into a bowl. Beat the flour mixture into the liquid ingredients, alternating with buttermilk, in 3 or 4 additions. Beat until batter is smooth, about 1 minute.", "In a metal or glass bowl, beat the reserved egg whites until they hold stiff peaks when the beaters are lifted straight up. Gently fold the beaten egg whites into the batter, keeping as much volume as possible. Pour the batter into the prepared cake pans.", "Bake in the preheated oven until the cakes have browned lightly and a toothpick inserted into the center of a cake comes out clean, 35 to 40 minutes. Allow the cakes to cool in pans before removing.", "To make frosting, pour the evaporated milk into a large saucepan, and mix in 1 cup of sugar, 3 egg yolks, 1/4 cup of margarine, and 1 teaspoon of vanilla extract. Bring to a boil, reduce heat to medium, and cook until thickened, stirring constantly, about 12 minutes. Remove from heat, and mix in the coconut and pecans, beating the frosting until cooled and spreadable. Frost and fill the cake with the coconut frosting."], "facts": "809 calories; protein 11.5g 23% DV; carbohydrates 101.8g 33% DV; fat 41.8g 64% DV; cholesterol 144.1mg 48% DV; sodium 617mg 25% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/10352/old-german-honey-cookies/", "name": "Old German Honey Cookies", "summary": "\nI got this recipe from my grandmother who got it from her grandmother.  She had to translate it and then figure out measurements.  The original recipe called for \"enough flour to make a dough\". Thankfully grandma knew what kind of dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2241821.jpg", "meta": [["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup white sugar", "1 cup shortening", "1 cup honey", "2  eggs", "1 teaspoon vanilla extract", "1 teaspoon baking soda", "4 cups all-purpose flour", "1 teaspoon ground ginger"], "direction": ["In a saucepan over low heat, melt together sugar, shortening and honey.  Let cool.", "Mix together eggs, vanilla, baking soda and ginger.  Gradually add to cooled honey mixture.", "Slowly add 4 cups of flour to mixture.  Stir until well blended.  Drop by teaspoonfuls onto cookie sheets about 2 inches apart.  Bake at 350 degrees F (180 degrees C) until golden (about 12-15 minutes)."], "facts": "233 calories; protein 2.7g 6% DV; carbohydrates 36g 12% DV; fat 9.2g 14% DV; cholesterol 15.5mg 5% DV; sodium 59.3mg 2% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/87483/authentic-german-cheesecake/", "name": "Authentic German Cheesecake", "summary": "\nMy mom searched for years for an authentic German cheesecake recipe, but Germans use 'quark', an ingredient not readily available in the U.S. This recipe uses cottage cheese in place of quark and makes its own crust while baking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F466091.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["additional:", "6 hrs"], ["total:", "7 hrs 30 mins"], ["Servings:", "12"], ["Yield:", "1 cheesecake"]], "ingredients": ["1 ½ cups white sugar", "2 tablespoons cornstarch", "3 tablespoons all-purpose flour", "2 (8 ounce) packages cream cheese, softened", "1 pound small curd cottage cheese", "½ cup butter, softened", "4 medium eggs", "1 ½ tablespoons lemon juice", "1 teaspoon vanilla extract"], "direction": ["Preheat an oven to 350 degrees F (175 degrees C). Grease the bottom and halfway up the sides of a 9 inch springform pan. Mix together the sugar, cornstarch, and flour and set aside.", "Combine the cream cheese and cottage cheese; beat with an electric mixer at high speed until smooth and fluffy. Beat in the softened butter. Gradually add the sugar mixture, beating until combined. Add the eggs one at a time, blending well and scraping down the bowl after each addition. Stir in the lemon juice and vanilla and mix just until smooth.", "Pour the batter into the prepared pan and bake for 1 hour and 10 minutes. Turn off the oven and let the cheesecake rest in the oven with the door closed for 2 hours. Remove and cool on a wire rack. Chill for 4 hours or overnight."], "facts": "371 calories; protein 9.9g 20% DV; carbohydrates 30.1g 10% DV; fat 24.1g 37% DV; cholesterol 129.1mg 43% DV; sodium 341.8mg 14% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/24676/german-currywurst/", "name": "German Currywurst", "summary": "\nCurrywurst is a popular 'fast food' in Berlin, Germany.  It is quick and simple and everyone loves it! If you're in a hurry, you can substitute ketchup for the sauce, or use your own recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4479689.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 (15 ounce) cans tomato sauce", "1 pound kielbasa", "2 tablespoons chili sauce", "½ teaspoon onion salt", "1 tablespoon white sugar", "1 teaspoon ground black pepper", "1 pinch paprika", "Curry powder to taste"], "direction": ["Preheat oven to Broil/Grill.", "Pour tomato sauce into a large saucepan, then stir in the chili sauce, onion salt, sugar and pepper. Let simmer over medium heat, occasionally stirring; bring to a gentle boil and reduce heat to low. Simmer another 5 minutes.", "Meanwhile, broil/grill kielbasa sausage for 3 to 4 minutes each side, or until cooked through. Slice into pieces 1/4 inch to 1/2 inch thick.", "Pour tomato sauce mixture over sausage, then sprinkle all with paprika and curry powder and serve."], "facts": "451 calories; protein 18.4g 37% DV; carbohydrates 26.1g 8% DV; fat 31.7g 49% DV; cholesterol 74.9mg 25% DV; sodium 3018.7mg 121% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/34892/krautburger/", "name": "Krautburger", "summary": "\nA lean version of a German beef and cabbage filled roll. They freeze very well, and are good dipped in mustard. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F53887.jpg", "meta": [["prep:", "40 mins"], ["cook:", "40 mins"], ["additional:", "10 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 pound lean ground beef", "1  onion, chopped", "½ medium head cabbage, shredded", "½ (1 ounce) package dry onion soup mix", "1 (8 ounce) package mild Cheddar cheese, sliced", "black pepper to taste", "2 (1 pound) loaves frozen bread dough, thawed", "butter flavored cooking spray", "¼ cup margarine, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Drain fat. Stir in cabbage and onion soup mix; cook 5 minutes longer, or until lightly browned. Set aside.", "Roll one loaf of bread dough into a 16x8 inch rectangle, then cut into eight 4 inch squares. Spoon cabbage mixture into center of each square, top with 1 small slice cheese and bring up diagonal points, pinching edges closed. Place krautburgers on a cookie sheet coated with cooking spray, and let rise for about 10 minutes.", "Bake for 20 minutes, or until brown. Brush tops of warm rolls with margarine.  Repeat process with second loaf of bread and remaining cabbage mixture and cheese."], "facts": "307 calories; protein 15.1g 30% DV; carbohydrates 30.3g 10% DV; fat 13.2g 20% DV; cholesterol 33.3mg 11% DV; sodium 537.3mg 22% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/84725/german-semolina-pudding/", "name": "German Semolina Pudding", "summary": "\nThis is a delicious traditional German dessert-type dish that your kids will love! It's a sweet pudding served with anything from applesauce to ground cinnamon and sugar. You can adjust the amount of sugar to your preferred sweetness. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F127939.jpg", "meta": [["prep:", "2 mins"], ["cook:", "20 mins"], ["total:", "22 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 cups milk", "1 ½ tablespoons white sugar", "⅓ cup semolina"], "direction": ["In a small saucepan, stir together the milk and sugar. Set over medium heat, and bring to a boil. Milk tends to boil over as soon as it boils, so stay with it! When it boils, immediately remove from the heat. Stir in the semolina, and return to the burner. Bring to a boil over medium heat, stirring until thickened but still pourable. Pour into serving bowls, and top with your favorite hot cereal toppings."], "facts": "259 calories; protein 11.6g 23% DV; carbohydrates 41.1g 13% DV; fat 5.1g 8% DV; cholesterol 19.5mg 7% DV; sodium 100.3mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/7807/german-marble-cake/", "name": "German Marble Cake", "summary": "\nThis is a lovely cake with the taste of almond and chocolate and it is almost like a pound cake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1079704.jpg", "meta": [["Servings:", "14"], ["Yield:", "1 -10 inch tube cake"]], "ingredients": ["1 cup butter", "1 ½ cups white sugar", "4  eggs", "1 cup milk", "1 teaspoon almond extract", "3 ¼ cups all-purpose flour", "1 tablespoon baking powder", "⅛ teaspoon salt", "¼ cup unsweetened cocoa powder", "3 tablespoons dark rum"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 10 inch tube pan.", "In a large bowl, cream the butter with the sugar.  Beat in the eggs, then the milk and almond extract.", "In another bowl, stir together the flour, baking powder and salt.  Beat the flour mixture into the creamed mixture.  Turn half of the batter into another bowl and stir in the cocoa and rum.", "Layer the light and dark batters by large spoonfuls and then swirl slightly with a knife.", "Bake the cake in at 350 degree F (175 degree C) for about 70 minutes, or until it tests done with a toothpick.  Transfer to a rack to cool.  Makes about 14 to 16 servings."], "facts": "346 calories; protein 5.8g 12% DV; carbohydrates 45.6g 15% DV; fat 15.4g 24% DV; cholesterol 89.4mg 30% DV; sodium 246.7mg 10% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/76161/real-homemade-bologna/", "name": "Real Homemade Bologna", "summary": "\nThis is the REAL homemade bologna and it is simply delicious!  My Grandmother made this and gave the recipe to my Mom, and she gave it to me!  You can say it is passed down! I am not a real big fan of Bologna, but once you taste this, you will love it all over again! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1170191.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "1 day"], ["total:", "1 day"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["3 pounds ground beef", "3 tablespoons sugar-based curing mixture (such as Morton® Tender Quick®)", "1 cup water", "⅛ teaspoon garlic powder", "½ teaspoon onion powder", "1 ½ teaspoons liquid smoke flavoring"], "direction": ["In a large bowl, mix together the ground beef, curing salt, water, garlic powder, onion powder and liquid smoke using your hands. Divide in half, and form each half into a roll. Wrap in plastic wrap, and refrigerate for 24 hours.", "Preheat the oven to 300 degrees F (150 degrees C). Unwrap the beef rolls, and place them on a greased baking sheet or roasting pan.", "Bake for 1 hour in the preheated oven, turning the meat over after 30 minutes. Cool to room temperature, then refrigerate until chilled. Slice, and eat on sandwiches."], "facts": "115 calories; protein 9g 18% DV; carbohydrates 0g; fat 8.5g 13% DV; cholesterol 34mg 11% DV; sodium 895.6mg 36% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/222015/grillhaxe-grilled-eisbein-pork-shanks/", "name": "Grillhaxe (Grilled Eisbein, Pork Shanks)", "summary": "\nSucculent pork shanks with irresistible crackling, spiced and oven-roasted for three hours and served with sauerkraut and mashed potatoes. Mmmmm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6712352.jpg", "meta": [["prep:", "10 mins"], ["cook:", "3 hrs"], ["total:", "3 hrs 10 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 cup olive oil", "2 tablespoons dried marjoram", "2 tablespoons dried basil", "2 tablespoons chopped fresh thyme", "2 tablespoons chopped fresh rosemary", "2 tablespoons sea salt", "1 teaspoon paprika", "1 teaspoon ground black pepper", "1 teaspoon vegetable bouillon powder", "6 (1 1/2) pounds pork shanks"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Whisk olive oil, marjoram, basil, rosemary, thyme, sea salt, paprika, black pepper, and vegetable bouillon powder together in a bowl. Rub pork shanks with herb rub and arrange on a large baking pan.", "Roast in preheated oven until shanks are tender and outer skin is crispy, about 3 hours."], "facts": "532 calories; protein 70.6g 141% DV; carbohydrates 0.8g; fat 27.9g 43% DV; cholesterol 185.9mg 62% DV; sodium 3080.5mg 123% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/206120/fried-cabbage-and-egg-noodles/", "name": "Fried Cabbage and Egg Noodles", "summary": "\nThis is a German recipe from my Grandmother. It's cabbage that is lightly browned in butter and mixed with egg noodles and browned lightly for a wonderful, hearty, and fast dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F355377.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (16 ounce) package egg noodles", "1 stick butter", "1 medium head green cabbage, chopped", "salt and pepper to taste"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook the egg noodles in the boiling water until the pasta is tender yet firm to the bite, about 5 minutes. Drain.", "While the noodles cook, melt the butter in a large skillet over low heat. Add the cabbage to the melted butter; season with salt and pepper. Cover and cook until the cabbage begins to brown, 5 to 7 minutes. Stir the drained noodles into the cabbage; cook and stir until the noodles begin to brown, about 5 minutes."], "facts": "690 calories; protein 19g 38% DV; carbohydrates 93g 30% DV; fat 28.2g 43% DV; cholesterol 155.1mg 52% DV; sodium 227.8mg 9% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/267993/easy-german-apple-streusel-pie/", "name": "Easy German Apple Streusel Pie", "summary": "\nThis is a super-easy pie recipe with a sweet bottom crust, a juicy cinnamony apple filling, and crisp streusel on top, all made out of the same dough. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6326909.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "5 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["4 large apples - peeled, cored, and thinly sliced", "1 pinch ground cinnamon", "7 ounces unsalted butter, at room temperature", "1 cup white sugar", "3 teaspoons vanilla sugar", "1  egg", "2 cups all-purpose flour", "3 ½ teaspoons baking powder"], "direction": ["Combine apple slices and cinnamon in a saucepan and cook over low heat for 10 minutes. If necessary, add a tiny bit of water so apples don't burn. Remove from heat and set aside to cool.", "Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch springform pan with butter", "Combine butter, sugar, vanilla sugar, and egg in a large bowl; beat using an electric mixer until smooth and creamy. Mix flour and baking powder in a separate bowl. Add 2/3 of flour mixture, 1 tablespoon at a time, to butter mixture and beat on low speed. Add remaining flour mixture and mix in by hand to make a crumbly dough.", "Transfer 1/2 the dough into the prepared springform pan and press down to create a bottom crust. Add apple slices, leaving a small space around the edges. Crumble remaining dough evenly on top.", "Bake in the preheated oven until streusel and crust are lightly browned, about 50 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Carefully transfer to a serving plate or cooling rack."], "facts": "365 calories; protein 3.5g 7% DV; carbohydrates 52.6g 17% DV; fat 16.7g 26% DV; cholesterol 58.5mg 20% DV; sodium 180.3mg 7% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/260685/easy-german-apple-sheet-cake/", "name": "Easy German Apple Sheet Cake", "summary": "\nThis quick and easy apple sheet cake recipe is from Germany where these types of cakes are very popular. Perfect for serving a crowd! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565171.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "24"], ["Yield:", "24 servings"]], "ingredients": ["1 tablespoon butter", "14 tablespoons unsalted butter, at room temperature", "1 cup white sugar", "3 cups all-purpose flour", "4 teaspoons baking powder", "lemon, zested and juiced", "1 pinch salt", "3  eggs, beaten", "3 ¼ pounds apples - peeled, cored, and thinly sliced", "2 tablespoons raisins  (Optional)"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Grease a large, 12x18-inch rimmed baking sheet with 1 tablespoon butter.", "Combine 14 tablespoons butter and sugar in a large bowl; beat with an electric mixer until smooth and creamy.", "Mix flour, baking powder, lemon zest, and salt in a bowl. Alternate adding flour mixture and eggs to the creamed butter mixture. Spread batter onto the prepared baking sheet; dough is very sticky, so use a spatula to spread it onto the tray. Distribute sliced apples evenly on top and drizzle with lemon juice. Sprinkle with raisins.", "Bake in the preheated oven until set and lightly browned, about 30 minutes."], "facts": "197 calories; protein 2.6g 5% DV; carbohydrates 30.2g 10% DV; fat 8g 12% DV; cholesterol 39.5mg 13% DV; sodium 100.9mg 4% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/8781/german-chicken/", "name": "German Chicken", "summary": "\nBoneless chicken breasts cooked over sauerkraut and covered in BBQ sauce. This sounds a little different, but I assure you, it is delicious!  It is one of my family's favorites. The BBQ sauce makes the sauerkraut a little sweet.  I like to serve this dish with mashed potatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F602409.jpg", "meta": [["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "1 cup barbecue sauce", "22 ounces sauerkraut"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a 9x13 inch baking dish, place the sauerkraut in a single layer. Place the chicken breasts on top of the sauerkraut. Pour the barbecue sauce over the chicken. Cover and bake in the preheated oven for 30 minutes or until the chicken is cooked and the juices run clear."], "facts": "253 calories; protein 28.6g 57% DV; carbohydrates 29.2g 9% DV; fat 1.9g 3% DV; cholesterol 68.4mg 23% DV; sodium 1794mg 72% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/23893/kraut-bierocks/", "name": "Kraut Bierocks", "summary": "\nThese meat-and-cabbage-mixture filled sweet rolls make a great main dish, and are also great as a snack.  They reheat well, so leftovers are also great!  Sauerkraut can be used in place of the cabbage for more of a 'kraut flavor'. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014314.jpg", "meta": [["prep:", "45 mins"], ["cook:", "1 hr"], ["total:", "1 hr 45 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 ½ (.25 ounce) packages active dry yeast", "½ cup white sugar", "2 cups warm water", "4 cups all-purpose flour", "½ cup powdered milk", "1 ½ teaspoons baking powder", "½ cup shortening", "1 pound lean ground beef", "1 pound ground Italian sausage", "1 cup chopped onion", "3 cups shredded cabbage", "3 tablespoons prepared mustard", "2 teaspoons salt", "2 teaspoons ground black pepper", "½ cup shredded, processed American cheese", "½ cup shredded Cheddar cheese"], "direction": ["To Make Sweet Dough: In a medium bowl combine the yeast, sugar and water and mix together; let stand 10 minutes. Stir in flour, dry milk, baking powder and shortening, then knead mixture for 10 minutes, adding as little flour as necessary. Cover bowl with a damp cloth and let rise in a warm place for 30 minutes, then knead again.", "To Make Filling: Meanwhile, brown beef, sausage and onion in a large skillet over medium high heat. Drain extra fat from skillet, then stir in cabbage, mustard, salt and pepper and cook for 5 minutes. Add cheese and cook, stirring, until cheese is melted.", "Preheat oven to 350 degrees F (175 degrees C).", "Flatten a piece of dough. Place large spoonful of meat filling onto dough and fold over to form a round bun. Lay folded-side-down in a lightly greased 9x13 inch baking dish. Repeat with remaining dough and filling.", "Bake in preheated oven for 20 minutes, or until golden brown."], "facts": "630 calories; protein 24.6g 49% DV; carbohydrates 55g 18% DV; fat 34.3g 53% DV; cholesterol 69.3mg 23% DV; sodium 1129.3mg 45% DV."}, {"type": "By Cuisine  ", "package": "german_recipes", "link": "https://www.allrecipes.com/recipe/231728/flavorful-german-pork-chops-and-sauerkraut/", "name": "Flavorful German Pork Chops and Sauerkraut", "summary": "\nGerman dishes are great because they require very few ingredients. This easy way to make pork chops is flavorful and easy to do. By breading the pork chops before you bake them it really locks in all the flavor. When it's finished you won't even need a knife, the pork will just fall from the bone. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8591791.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 45 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 cups bread crumbs", "2  eggs, beaten", "1 tablespoon vegetable shortening (such as Crisco®), or as needed", "4  bone-in pork chops", "1 (32 ounce) package sauerkraut, undrained", "½  onion, chopped", "1 teaspoon caraway seeds"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Place bread crumbs into a shallow dish; pour eggs into a separate shallow dish. Heat vegetable shortening in a skillet over medium-high heat. Dip pork chops into egg, then into bread crumbs, coating both sides. Fry chops in the hot shortening until crumbs are golden brown, about 5 minutes per side. Transfer pork chops to a baking dish, leaving melted shortening in skillet.", "Cook and stir sauerkraut with juice, onion, and caraway seeds in the same skillet over medium-low heat until heated through, about 5 minutes. Spread sauerkraut over pork chops and pour pan liquid over the top. Cover baking dish tightly with aluminum foil.", "Bake in the preheated oven until chops are tender, 1 1/2 hour."], "facts": "553 calories; protein 37g 74% DV; carbohydrates 51.7g 17% DV; fat 21.8g 34% DV; cholesterol 159.2mg 53% DV; sodium 1987.6mg 80% DV."}]