[{"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/274411/bucatini-cacio-e-pepe-roman-sheep-herders-pasta/", "name": "Bucatini Cacio e Pepe (Roman Sheep Herder's Pasta)", "summary": "\nThis peasant food comes from Roman sheep herders who had little time and money to spend on eating. They used their sheep's cheese and a bit of the water that cooked the pasta to create a cream, then added black pepper to give it some extra flavor. Cheap, easy, and fast: this was perfect for them and for us even today! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2253389.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 teaspoon salt", "1 pound bucatini (dry)", "2 cups finely grated Pecorino Romano cheese", "1 ½ tablespoons freshly ground black pepper, or more to taste"], "direction": ["Bring a large pot of water to a boil and add salt. Cook bucatini in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes.", "Place grated Pecorino Romano cheese into a large glass bowl and mix with a fork to make sure the cheese contains no lumps.", "Once the bucatini are al dente, lift them out with a spaghetti fork or tongs and put them directly into the bowl with the cheese. Do not allow the water to drain too much.", "Add one ladle of pasta water to the bowl. Stir the bucatini around until a cream has formed. Add more pasta water, little by little, until a thick cream has formed. Sprinkle freshly ground pepper over the pasta. Toss and serve immediately."], "facts": "438 calories; protein 22.5g 45% DV; carbohydrates 59g 19% DV; fat 11.9g 18% DV; cholesterol 41.3mg 14% DV; sodium 869.6mg 35% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/264352/torta-di-mele-italian-apple-cake/", "name": "Torta di Mele (Italian Apple Cake)", "summary": "\nThis Italian apple cake recipe is from my mom and reminds me of my childhood. It tastes delicious, and I bake it for my family now. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5438948.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons unseasoned bread crumbs, or as needed", "½ cup unsalted butter, melted", "½ cup white sugar", "1  vanilla bean, split and scraped", "2  eggs", "1 ⅛ cups all-purpose flour", "1 teaspoon baking powder", "1 pinch salt", "1 tablespoon milk, or as needed  (Optional)", "2 pounds Granny Smith apples, peeled, cored and sliced thin", "¼ cup unsalted butter, cubed", "¼ cup white sugar"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C). Grease a pie plate and dust with bread crumbs", "Combine melted butter, 1/2 cup sugar, and vanilla bean seeds in a bowl. Add eggs and stir to combine. Mix flour, baking powder, and salt in a bowl and add to butter mixture. Add milk if batter is too thick", "Pour batter into the prepared pie plate. Distribute apple slices in a thick layer on top of the batter. Dot with cubed butter and sprinkle with 1/4 cup sugar.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 45 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto a serving plate or cooling rack. Let cool completely."], "facts": "379 calories; protein 4g 8% DV; carbohydrates 51.1g 17% DV; fat 18.8g 29% DV; cholesterol 86.8mg 29% DV; sodium 112.5mg 5% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/262799/italian-shrimp-and-scallop-risotto/", "name": "Italian Shrimp and Scallop Risotto", "summary": "\nThe secret to making a good seafood risotto is to use a high-quality fish stock and of course the freshest seafood you can find. Cook the shellfish and rice separately, as the rice needs more time. If you cook them together, the shellfish will overcook and get chewy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5171022.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "2 mins"], ["total:", "57 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons olive oil", "3 cloves garlic, peeled", "½ pound shelled sea scallops", "½ pound uncooked medium shrimp, peeled and deveined", "salt and ground black pepper to taste", "1 pinch red pepper flakes", "½ cup dry white wine", "½  lemon, juiced", "1 bunch fresh parsley, finely chopped"], "direction": ["Heat 3 tablespoons olive oil in a skillet over a medium heat. Add garlic; cook and stir until starting to sizzle, about 2 minutes. Stir in scallops and cook for 1 minute. Add shrimp and season with salt, pepper, and red pepper flakes. Cook over high heat until shrimp are pink, 3 to 5 minutes.", "Pour 1/2 cup white wine into the skillet and let the alcohol evaporate. Scrape the bottom of the skillet to deglaze; cook until the liquid is reduced, 2 to 3 minutes. Remove from heat, add lemon juice, and sprinkle with 1/2 of the parsley. Discard garlic. Cover the skillet to keep shellfish warm.", "Pour fish stock into a saucepan over medium heat and bring to a simmer.", "Melt butter in a skillet over low heat. Add 1 tablespoon olive oil and shallot. Cook until shallot is soft and translucent, but not brown, 3 to 5 minutes. Increase heat and add rice; cook until rice has absorbed the oil and butter and has a nutty aroma, stirring often, 1 to 2 minutes. Make sure not to burn the shallot and reduce heat if skillet gets too hot.", "Pour 1/2 cup white wine into the skillet and stir until alcohol has evaporated. Add 1 ladleful of fish stock, stir, and cook until rice has absorbed the stock. Add another ladleful and repeat the process until the rice is tender, 15 to 18 minutes in total.", "Add shellfish with their juices to the risotto pan 3 minutes before the end of cooking. Stir and finish cooking all together, adding stock if needed. Remove from heat. Stir in remaining parsley and 1 tablespoon extra-virgin olive oil. Let risotto stand for 2 minutes before serving."], "facts": "703 calories; protein 31g 62% DV; carbohydrates 75.2g 24% DV; fat 25.4g 39% DV; cholesterol 125mg 42% DV; sodium 1059.1mg 42% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/", "name": "Italian Baked Meatballs", "summary": "\nThis recipe makes the most tender and tasty meatballs. I also freeze these meatballs and take out how many servings I need for each meal. If cooking in sauce, add baked meatballs 20 minutes before serving time. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5834922.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "30 1-ounce meatballs"]], "ingredients": ["1 cup Italian-seasoned bread crumbs", "¼ cup grated Romano cheese", "2 tablespoons chopped fresh parsley", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ teaspoon garlic powder", "½ teaspoon onion powder", "½ cup water", "2  eggs", "1 ½ pounds ground beef"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together. Combine with water and eggs. Add ground beef and mix well. Roll mixture into balls and place on a nonstick baking sheet.", "Bake in the preheated oven until browned, about 30 minutes."], "facts": "343 calories; protein 24.4g 49% DV; carbohydrates 14.1g 5% DV; fat 20.4g 31% DV; cholesterol 135.2mg 45% DV; sodium 611.7mg 25% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/264440/traditional-spaghetti-allamatriciana/", "name": "Traditional Spaghetti all'Amatriciana", "summary": "\nThis classic Roman pasta dish is quick and easy to make with few ingredients. Traditionally, guanciale is used, but I prefer pancetta. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5443056.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound spaghetti", "3 tablespoons extra-virgin olive oil, divided, or more if needed", "1  onion, finely chopped", "7 ounces pancetta bacon, diced", "2 cups passata (crushed tomatoes)", "1 tablespoon water, or more as needed", "½ teaspoon white sugar", "2 tablespoons grated Parmesan cheese", "1 pinch red pepper flakes, or to taste", "salt and freshly ground black pepper to taste"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes.", "Meanwhile, heat 2 tablespoons olive oil in a large skillet over medium heat and cook onion until golden brown, about 5 minutes. Add pancetta and cook, stirring occasionally, until crisp, 2 to 3 minutes. Pour in passata, water, and sugar; cook until sauce has thickened, 10 to 15 minutes", "Drain spaghetti and toss with sauce, remaining olive oil, Parmesan cheese, and red pepper flakes. Season with salt and pepper."], "facts": "662 calories; protein 24g 48% DV; carbohydrates 97.2g 31% DV; fat 19.7g 30% DV; cholesterol 19.8mg 7% DV; sodium 615.7mg 25% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/262925/hearty-minestrone-soup-instant-pot/", "name": "Hearty Minestrone Soup (Instant Pot®)", "summary": "\nSo I feel like I am using my Instant Pot® at least 4 times a week. I have been having a great time experimenting and am amazed at the way the flavors are locked in and how quickly the meals are finished... not to say the super easy clean up. The main insert can go in the dishwasher and I hand-clean the top with very sudsy water. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5137405.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "5 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1 pound beef stew meat", "1 large onion, diced", "2 stalks celery, diced", "⅓ pound green beans, trimmed and cut into 1/2-inch pieces", "1 large carrot, diced", "4 cloves garlic, minced", "1 teaspoon dried oregano", "1 teaspoon dried basil", "1 pinch ground black pepper to taste", "6 cups chicken bone broth (such as Kettle and Fire)", "1 (28 ounce) can no-salt-added diced tomatoes", "1 (14 ounce) can crushed tomatoes", "1 (15 ounce) can red kidney beans, drained and rinsed", "1 cup gluten-free ditalini pasta", "1 pinch kosher salt to taste", "⅓ cup finely grated Parmesan cheese", "2 tablespoons chopped fresh basil"], "direction": ["Heat oil in a multi-functional pressure cooker (such as Instant Pot®) on Saute mode. Add beef and onion; cook until beef is no longer pink on the outside, about 4 minutes. Add celery, green beans, carrot, garlic, oregano, dried basil, and pepper. Stir to combine.", "Pour broth, diced tomatoes, and crushed tomatoes into the pot with the beef. Stir well. Select Soup setting; close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 35 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Stir in kidney beans and pasta. Turn on Slow Cook mode and cook until pasta and vegetables are tender, about 10 minutes. Season with salt. Ladle soup into bowls and top with Parmesan cheese and fresh basil."], "facts": "369 calories; protein 23.4g 47% DV; carbohydrates 32.1g 10% DV; fat 16.8g 26% DV; cholesterol 56.7mg 19% DV; sodium 1214.6mg 49% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/257379/lasagne-alla-bolognese-saporite/", "name": "Lasagne Alla Bolognese Saporite", "summary": "\nThis is the classic lasagne alla Bolognese recipe from the Emilia region in Northern Italy. The Bolognese sauce is made with a mixture of beef and pork mince. The addition of prosciutto, red wine, cinnamon, and nutmeg make it truly authentic. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4506922.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 48 mins"], ["additional:", "3 mins"], ["total:", "3 hrs 21 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1 small onion, chopped", "1  carrot, chopped", "1  shallot, minced", "3 ½ ounces prosciutto, chopped", "11 ounces ground pork", "11 ounces ground beef", "1 teaspoon ground nutmeg", "½ teaspoon ground cinnamon", "salt to taste", "6 fluid ounces red wine", "21 ounces peeled San Marzano tomatoes"], "direction": ["Heat olive oil in a saucepan over medium heat; cook and stir onion, carrot, shallot, and prosciutto until onion is translucent and prosciutto releases some fat, about 10 minutes. Add pork and beef; season with 1 teaspoon nutmeg, cinnamon, and salt to taste. Cook and stir over medium-high heat until browned and crumbly, about 10 minutes.", "Pour red wine over meat mixture; increase heat and cook until wine evaporates, about 3 minutes. Add tomatoes and mix well; bring to a boil, cover, reduce heat, and simmer, stirring occasionally, until tomatoes break down and flavors of Bolognese sauce have combined, 1 1/2 to 2 hours.", "Melt butter in a saucepan over medium-low heat; add flour. Whisk vigorously until mixture is smooth. Pour in milk and cook, stirring occasionally, over medium heat until white sauce thickens enough to cover the back of a spoon, about 10 minutes; season with 1/2 teaspoon nutmeg, salt, and pepper.", "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain and run under cold water to stop the cooking process. Lay noodles on a clean towel and pat dry.", "Preheat oven to 350 degrees F (175 degrees C).", "Pour a ladleful of Bolognese sauce and a ladleful of white sauce over the bottom of a 9x13-inch baking dish; top with 3 or 4 lasagna noodles. Cover noodles with 1/3 of the white sauce and 1/3 of the Bolognese sauce. Sprinkle some of the Parmesan cheese on top; cover with lasagna noodles. Repeat layers, ending with white sauce and Parmesan cheese.", "Bake in the preheated oven until bubbling and top is golden brown, 30 to 40 minutes. Let stand 3 to 4 minutes before slicing."], "facts": "694 calories; protein 35.9g 72% DV; carbohydrates 48.2g 16% DV; fat 38g 59% DV; cholesterol 112.9mg 38% DV; sodium 822.2mg 33% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/246757/lemony-pork-piccata/", "name": "Lemony Pork Piccata", "summary": "\nA wonderful tender pork dish with a delicate piccata sauce. Very simple and really delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3491044.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 pork chops"]], "ingredients": ["4  pork chops", "½ cup all-purpose flour", "salt and ground black pepper to taste", "3 tablespoons unsalted butter", "2 tablespoons sliced shallots", "⅓ cup dry white wine", "¼ cup chicken stock", "1 tablespoon fresh lemon juice", "¼ cup chopped fresh parsley", "1 tablespoon lemon zest", "1 tablespoon capers"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Pound pork chops between 2 sheets waxed paper or plastic wrap until very thin, about 1/8 inch.", "Mix flour, salt, and pepper together in a shallow bowl. Dredge both sides of each pork chop through flour mixture, shaking off any excess flour.", "Heat butter in a large skillet over medium heat until butter starts to sizzle. Add shallots and pork chops in 1 layer, working in batches if needed.  Cook pork chops until golden brown and almost cooked through, 3 to 4 minutes per side. Transfer pork chops to a baking dish and lightly tent with aluminum foil, reserving the shallots and browned bits of food in the skillet.", "Bake pork chops in the preheated oven until cooked through, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).", "Pour wine and chicken stock into the skillet and bring to a boil while scraping the browned bits of food off of the bottom with a wooden spoon. Reduce heat and simmer until sauce is reduced by half, 2 to 5 minutes. Stir lemon juice into sauce.", "Drizzle sauce over pork chops and top with parsley, lemon zest, and capers."], "facts": "321 calories; protein 25.6g 51% DV; carbohydrates 14.3g 5% DV; fat 15.8g 24% DV; cholesterol 81.9mg 27% DV; sodium 184.6mg 7% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/", "name": "World's Best Lasagna", "summary": "\nIt takes a little work, but it is worth it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F11%2Fworlds-best-lasagna.jpeg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 30 mins"], ["additional:", "15 mins"], ["total:", "3 hrs 15 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 pound sweet Italian sausage", "¾ pound lean ground beef", "½ cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "½ cup water", "2 tablespoons white sugar", "1 ½ teaspoons dried basil leaves", "½ teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 ½ teaspoons salt, divided, or to taste", "¼ teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12  lasagna noodles", "16 ounces ricotta cheese", "1  egg", "¾ pound mozzarella cheese, sliced", "¾ cup grated Parmesan cheese"], "direction": ["In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.", "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.", "Preheat oven to 375  degrees F (190 degrees C).", "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.", "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."], "facts": "448 calories; protein 29.7g 59% DV; carbohydrates 36.5g 12% DV; fat 21.3g 33% DV; cholesterol 81.8mg 27% DV; sodium 1400.4mg 56% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/214500/sausage-peppers-onions-and-potato-bake/", "name": "Sausage, Peppers, Onions, and Potato Bake", "summary": "\nThis is an Italian comfort food classic!  The smell of this cooking in my kitchen transports me back to playing on the street in front of my Papa and Gigi's house in Brooklyn.  I make 2 trays of this for every family get-together, and it's gone in a flash! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F05%2F3384034_original.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 teaspoons olive oil", "2 pounds Italian sausage links, cut into 2-inch pieces", "¼ cup olive oil", "4 large potatoes, peeled and thickly sliced", "2 large green bell peppers, seeded and cut into wedges", "2 large red bell peppers, seeded and cut into wedges", "3 large onions, cut into wedges", "½ cup white wine", "½ cup chicken stock", "1 teaspoon Italian seasoning", "salt and pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Heat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned. Transfer the cooked sausage to a large baking dish.", "Pour 1/4 cup of olive oil into the skillet, and cook the potatoes, stirring occasionally, until browned, about 10 minutes. Place the potatoes into the baking dish, leaving some oil in the skillet.", "Cook and stir the green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes. Add the vegetables to the baking dish.", "Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper. Gently stir the sausage, potatoes, and vegetables together.", "Bake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot."], "facts": "539 calories; protein 20.2g 40% DV; carbohydrates 45.8g 15% DV; fat 29.8g 46% DV; cholesterol 44.9mg 15% DV; sodium 1041mg 42% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/", "name": "Chicken Parmesan", "summary": "\nMy version of chicken parmesan is a little different than what they do in the restaurants, with less sauce and a crispier crust. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6635156.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "salt and freshly ground black pepper to taste", "2  eggs", "1 cup panko bread crumbs, or more as needed", "½ cup grated Parmesan cheese", "2 tablespoons all-purpose flour, or more if needed", "1 cup olive oil for frying", "½ cup prepared tomato sauce", "¼ cup fresh mozzarella, cut into small cubes", "¼ cup chopped fresh basil", "½ cup grated provolone cheese", "¼ cup grated Parmesan cheese", "1 tablespoon olive oil"], "direction": ["Preheat an oven to 450 degrees F (230 degrees C).", "Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.", "Beat eggs in a shallow bowl and set aside.", "Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.", "Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.", "Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes.", "Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven.", "Place chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil.", "Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."], "facts": "471 calories; protein 42.1g 84% DV; carbohydrates 24.8g 8% DV; fat 24.9g 38% DV; cholesterol 186.7mg 62% DV; sodium 840.3mg 34% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/85389/gourmet-mushroom-risotto/", "name": "Gourmet Mushroom Risotto", "summary": "\nAuthentic Italian-style risotto cooked the slow and painful way, but oh so worth it. Complements grilled meats and chicken dishes very well. Check the rice by biting into it. It should be slightly al dente (or resist slightly to the tooth but not be hard in the center). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F246711.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups chicken broth, divided", "3 tablespoons olive oil, divided", "1 pound portobello mushrooms, thinly sliced", "1 pound white mushrooms, thinly sliced", "2  shallots, diced", "1 ½ cups Arborio rice", "½ cup dry white wine", "sea salt to taste", "freshly ground black pepper to taste", "3 tablespoons finely chopped chives", "4 tablespoons butter", "⅓ cup freshly grated Parmesan cheese"], "direction": ["In a saucepan, warm the broth over low heat.", "Warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Stir in the mushrooms, and cook until soft, about 3 minutes. Remove mushrooms and their liquid, and set aside.", "Add 1 tablespoon olive oil to skillet,  and stir in the shallots. Cook 1 minute. Add rice, stirring to coat with oil, about 2 minutes. When the rice has taken on a pale, golden color, pour in wine, stirring constantly until the wine is fully absorbed. Add 1/2 cup broth to the rice, and stir until the broth is absorbed. Continue adding broth 1/2 cup at a time, stirring continuously, until the liquid is absorbed and the rice is al dente, about 15 to 20 minutes.", "Remove from heat, and stir in mushrooms with their liquid, butter, chives, and parmesan. Season with salt and pepper to taste."], "facts": "431 calories; protein 11.3g 23% DV; carbohydrates 56.6g 18% DV; fat 16.6g 26% DV; cholesterol 29.3mg 10% DV; sodium 1130.8mg 45% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11887/pesto-pasta/", "name": "Pesto Pasta", "summary": "\nEasy to make, but full of flavor!  Good hot or cold. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4475574.jpg", "meta": [["prep:", "5 mins"], ["additional:", "10 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["½ cup chopped onion", "2 ½ tablespoons pesto", "2 tablespoons olive oil", "2 tablespoons grated Parmesan cheese", "1 (16 ounce) package pasta", "salt to taste", "ground black pepper to taste"], "direction": ["Cook pasta in a large pot of boiling water until done.  Drain.", "Meanwhile, heat the oil in a frying pan over medium low heat.   Add pesto, onion, and salt and pepper.  Cook about five minutes, or until onions are soft.", "In a large bowl, mix pesto mixture into pasta.  Stir in grated cheese.  Serve."], "facts": "225 calories; protein 7.8g 16% DV; carbohydrates 32g 10% DV; fat 7.2g 11% DV; cholesterol 43.5mg 15% DV; sodium 71.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/12011/easy-lasagna-ii/", "name": "Easy Lasagna II", "summary": "\nMy family loves lasagna, but sometimes I lack the time for the long version. This is easy and satisfies everyone. Try it tonight! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4511968.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 pound lean ground beef", "1 (32 ounce) jar spaghetti sauce", "32 ounces cottage cheese", "3 cups shredded mozzarella cheese", "2  eggs", "½ cup grated Parmesan cheese", "2 teaspoons dried parsley", "salt to taste", "ground black pepper to taste", "9  lasagna noodles", "½ cup water"], "direction": ["In a large skillet over medium heat brown the ground beef. Drain the grease. Add spaghetti sauce and simmer for 5 minutes.", "In a large bowl, mix together the cottage cheese, 2 cups of the mozzarella cheese, eggs, half of the grated Parmesan cheese, dried parsley, salt and ground black pepper.", "To assemble, in the bottom of a 9x13 inch baking dish evenly spread 3/4 cup of the sauce mixture. Cover with 3 uncooked lasagna noodles, 1 3/4 cup of the cheese mixture, and 1/4 cup sauce. Repeat layers once more: top with 3 noodles, remaining sauce, remaining mozzarella and Parmesan cheese. Add 1/2 cup water to the edges of the pan. Cover with aluminum foil.", "Bake in a preheated 350 degree F(175 degrees C) oven for 45 minutes. Uncover and bake an additional 10 minutes. Let stand 10 minutes before serving."], "facts": "377 calories; protein 29.4g 59% DV; carbohydrates 26.4g 9% DV; fat 16.7g 26% DV; cholesterol 89.5mg 30% DV; sodium 870.3mg 35% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/36925/garlic-butter/", "name": "Garlic Butter", "summary": "\nSometimes the basics are the best!  I've used this simple recipe for years to make garlic bread, and any leftovers go great on barbequed steaks, pasta, rice or potatoes. You can use any butter or margarine you like. Also, fresh or minced garlic in a jar works well. Adjust the amount of garlic to your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5221403.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "16"], ["Yield:", "1 cup"]], "ingredients": ["1 cup butter, softened", "1 tablespoon minced garlic", "¼ cup grated Parmesan cheese", "1 tablespoon garlic salt", "1 teaspoon Italian seasoning", "½ teaspoon ground black pepper", "¼ teaspoon ground paprika"], "direction": ["In a small bowl, combine softened butter, minced garlic and parmesan cheese. Season with garlic salt, Italian seasoning, pepper and paprika. Mix until smooth."], "facts": "110 calories; protein 0.8g 2% DV; carbohydrates 0.5g; fat 12g 18% DV; cholesterol 31.9mg 11% DV; sodium 445.5mg 18% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/14385/pasta-salad/", "name": "Pasta Salad", "summary": "\nA dear friend gave me this recipe many years ago and I've been making it ever since. It's great for barbecues. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3512373.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["additional:", "13 hrs 20 mins"], ["total:", "13 hrs 55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound tri-colored spiral pasta", "6 tablespoons salad seasoning mix", "1 (16 ounce) bottle Italian-style salad dressing", "2 cups cherry tomatoes, diced", "1  green bell pepper, chopped", "1  red bell pepper, diced", "½  yellow bell pepper, chopped", "1 (2.25 ounce) can black olives, chopped"], "direction": ["In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain.", "Whisk together the salad spice mix and Italian dressing.", "In a salad bowl, combine the pasta, cherry tomatoes, bell peppers and olives. Pour dressing over salad; toss and refrigerate overnight."], "facts": "400 calories; protein 7.9g 16% DV; carbohydrates 39g 13% DV; fat 24.8g 38% DV; cholesterol 2.7mg 1% DV; sodium 1904.2mg 76% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/13883/manicotti/", "name": "Manicotti", "summary": "\nDelicious!  Serve with a crispy salad and garlic bread, and you'll have a dish your family will love!  The kids like to help stuff the noodles too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F48652.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pint part-skim ricotta cheese", "8 ounces shredded mozzarella cheese", "¾ cup grated Parmesan cheese", "2  eggs", "1 teaspoon dried parsley", "salt to taste", "ground black pepper to taste", "1 (16 ounce) jar spaghetti sauce", "5 ½ ounces manicotti pasta"], "direction": ["Cook manicotti in boiling water until done.  Drain, and rinse with cold water.", "Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, combine ricotta, mozzarella, and 1/2 cup Parmesan, eggs, parsley, and salt and pepper.  Mix well.", "Pour 1/2 cup sauce into an 11x17 inch baking dish.  Fill each manicotti shell with 3 tablespoons cheese mixture, and arrange over sauce . Pour remaining sauce over top, and sprinkle with remaining Parmesan cheese.", "Bake 45 minutes, or until bubbly."], "facts": "676 calories; protein 46g 92% DV; carbohydrates 53.2g 17% DV; fat 30.9g 48% DV; cholesterol 188.8mg 63% DV; sodium 1254.7mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/16427/slow-cooker-italian-beef-for-sandwiches/", "name": "Slow Cooker Italian Beef for Sandwiches", "summary": "\nThis makes a sandwich similar to one I used to get at a local restaurant when I lived in a suburb of Chicago. My all time favorite! Serve on crusty rolls with roasted sweet or hot peppers, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F178087.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 hrs"], ["total:", "12 hrs 15 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["3 cups water", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 teaspoon dried oregano", "1 teaspoon dried basil", "1 teaspoon onion salt", "1 teaspoon dried parsley", "1 teaspoon garlic powder", "1  bay leaf", "1 (.7 ounce) package dry Italian-style salad dressing mix", "1 (5 pound) rump roast"], "direction": ["Combine water with salt, ground black pepper, oregano, basil, onion salt, parsley, garlic powder, bay leaf, and salad dressing mix in a saucepan. Stir well, and bring to a boil.", "Place roast in slow cooker, and pour salad dressing mixture over the meat.", "Cover, and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork."], "facts": "318 calories; protein 39.4g 79% DV; carbohydrates 1.6g 1% DV; fat 15.8g 24% DV; cholesterol 100.4mg 34% DV; sodium 819.1mg 33% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/40399/the-best-meatballs/", "name": "The Best Meatballs", "summary": "\nI never knew how to make good meatballs until I found this recipe. I normally make mine with just ground beef and they still taste great. I've used the combination of pork, beef and veal and they are equally good. Definitely use fresh bread crumbs and freshly grate your cheese instead of using the canned variety...it really does make a difference. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F887350.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "½ pound ground veal", "½ pound ground pork", "2 cloves garlic, minced", "2  eggs", "1 cup freshly grated Romano cheese", "1 ½ tablespoons chopped Italian flat leaf parsley", "salt and ground black pepper to taste", "2 cups stale Italian bread, crumbled", "1 ½ cups lukewarm water", "1 cup olive oil"], "direction": ["Combine beef, veal, and pork in a large bowl. Add garlic, eggs, cheese, parsley, salt and pepper.", "Blend bread crumbs into meat mixture. Slowly add the water 1/2 cup at a time. The mixture should be very moist but still hold its shape if rolled into meatballs. (I usually use about 1 1/4 cups of water). Shape into meatballs.", "Heat olive oil in a large skillet. Fry meatballs in batches. When the meatball is very brown and slightly crisp remove from the heat and drain on a paper towel. (If your mixture is too wet, cover the meatballs while they are cooking so that they hold their shape better.)"], "facts": "613 calories; protein 26.6g 53% DV; carbohydrates 6.6g 2% DV; fat 53.2g 82% DV; cholesterol 148.6mg 50% DV; sodium 333.1mg 13% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/", "name": "Spaghetti Sauce with Ground Beef", "summary": "\nThis recipe has been handed down from my mother.  It is a family favorite and will not be replaced! (Definite husband pleaser!) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667748.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "4 cloves garlic, minced", "1 small green bell pepper, diced", "1 (28 ounce) can diced tomatoes", "1 (16 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "2 teaspoons dried oregano", "2 teaspoons dried basil", "1 teaspoon salt", "½ teaspoon black pepper"], "direction": ["Combine ground beef, onion, garlic, and green pepper in a large saucepan.  Cook and stir until meat is brown and vegetables are tender. Drain grease.", "Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally."], "facts": "185 calories; protein 12.4g 25% DV; carbohydrates 15g 5% DV; fat 9.3g 14% DV; cholesterol 34.8mg 12% DV; sodium 930.8mg 37% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/", "name": "Chef John's Italian Meatballs", "summary": "\nHomemade meatballs are a very easy to make, and since we skip the very messy step of pan-frying these before they hit the sauce, it becomes downright simple. Here I use a standard half-beef/half-pork mixture. You can substitute water or beef broth for the milk, if preferred. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4531471.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "1 hr 20 mins"], ["total:", "2 hrs 15 mins"], ["Servings:", "30"], ["Yield:", "30 meatballs"]], "ingredients": ["⅓ cup plain bread crumbs", "½ cup milk", "2 tablespoons olive oil", "1  onion, diced", "1 pound ground beef", "1 pound ground pork", "2  eggs", "¼ bunch fresh parsley, chopped", "3 cloves garlic, crushed", "2 teaspoons salt", "1 teaspoon ground black pepper", "½ teaspoon red pepper flakes", "1 teaspoon dried Italian herb seasoning", "2 tablespoons grated Parmesan cheese"], "direction": ["Cover a baking sheet with foil and spray lightly with cooking spray.", "Soak bread crumbs in milk in a small bowl for 20 minutes.", "Heat olive oil in a skillet over medium heat. Cook and stir onions in hot oil until translucent, about 20 minutes.", "Mix beef and pork together in a large bowl. Stir onions, bread crumb mixture, eggs, parsley, garlic, salt, black pepper, red pepper flakes, Italian herb seasoning, and Parmesan cheese into meat mixture with a rubber spatula until combined. Cover and refrigerate for about one hour.", "Preheat an oven to 425 degrees F (220 degrees C).", "Using wet hands, form meat mixture into balls about 1 1/2 inches in diameter. Arrange onto prepared baking sheet.", "Bake in the preheated oven until browned and cooked through, 15 to 20 minutes."], "facts": "82 calories; protein 6.2g 12% DV; carbohydrates 1.7g 1% DV; fat 5.5g 8% DV; cholesterol 32.3mg 11% DV; sodium 192.1mg 8% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/54165/balsamic-bruschetta/", "name": "Balsamic Bruschetta", "summary": "\nSimple appetizer - the balsamic vinegar gives it a little kick. Best if the mixture has 1 or 2 hours to blend flavors before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F866248.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  roma (plum) tomatoes, diced", "⅓ cup chopped fresh basil", "¼ cup shredded Parmesan cheese", "2 cloves garlic, minced", "1 tablespoon balsamic vinegar", "1 teaspoon olive oil", "¼ teaspoon kosher salt", "¼ teaspoon freshly ground black pepper", "1 loaf French bread, toasted and sliced"], "direction": ["In a bowl, toss together the tomatoes, basil, Parmesan cheese, and garlic. Mix in the balsamic vinegar, olive oil, kosher salt, and pepper. Serve on toasted bread slices."], "facts": "194 calories; protein 8.3g 17% DV; carbohydrates 35.2g 11% DV; fat 2.5g 4% DV; cholesterol 2.2mg 1% DV; sodium 470.9mg 19% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/25321/eggplant-parmesan-ii/", "name": "Eggplant Parmesan II", "summary": "\nThis is a no fry variation of this popular dish, and is just as delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5068161.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "10"], ["Yield:", "8 to 10 servings"]], "ingredients": ["3  eggplant, peeled and thinly sliced", "2  eggs, beaten", "4 cups Italian seasoned bread crumbs", "6 cups spaghetti sauce, divided", "1 (16 ounce) package mozzarella cheese, shredded and divided", "½ cup grated Parmesan cheese, divided", "½ teaspoon dried basil"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Dip eggplant slices in egg, then in bread crumbs.  Place in a single layer on a baking sheet.  Bake in preheated oven for 5 minutes on each side.", "In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom.  Place a layer of eggplant slices in the sauce.  Sprinkle with mozzarella and Parmesan cheeses.  Repeat with remaining ingredients, ending with the cheeses.  Sprinkle basil on top.", "Bake in preheated oven for 35 minutes, or until golden brown."], "facts": "487 calories; protein 24.2g 48% DV; carbohydrates 62.1g 20% DV; fat 16g 25% DV; cholesterol 72.8mg 24% DV; sodium 1663.1mg 67% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/222000/spaghetti-aglio-e-olio/", "name": "Spaghetti Aglio e Olio", "summary": "\nNo two spaghetti aglio e olio recipes are alike, but this one is pretty true to the classic method. The key is slowly toasting the garlic slices to a perfect golden-brown in the olive oil. If it's too light, you don't get the full flavor and if it's too dark it gets bitter. My advice? Do it perfectly. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3727226.jpg", "meta": [["prep:", "10 mins"], ["cook:", "22 mins"], ["total:", "32 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound uncooked spaghetti", "6 cloves garlic, thinly sliced", "½ cup olive oil", "¼ teaspoon red pepper flakes, or to taste", "salt and freshly ground black pepper to taste", "¼ cup chopped fresh Italian parsley", "1 cup finely grated Parmigiano-Reggiano cheese"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and transfer to a pasta bowl.", "Combine garlic and olive oil in a cold skillet. Cook over medium heat to slowly toast garlic, about 10 minutes. Reduce heat to medium-low when olive oil begins to bubble. Cook and stir until garlic is golden brown, about another 5 minutes. Remove from heat.", "Stir red pepper flakes, black pepper, and salt into the pasta. Pour in olive oil and garlic, and sprinkle on Italian parsley and half of the Parmigiano-Reggiano cheese; stir until combined.", "Serve pasta topped with the remaining Parmigiano-Reggiano cheese."], "facts": "755 calories; protein 22.9g 46% DV; carbohydrates 87.4g 28% DV; fat 34.5g 53% DV; cholesterol 17.6mg 6% DV; sodium 354.8mg 14% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/", "name": "Shrimp Scampi with Pasta", "summary": "\nWell-rounded seafood and pasta dish. Good with any pasta; angel hair is less filling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2606852.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package linguine pasta", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "2  shallots, finely diced", "2 cloves garlic, minced", "1 pinch red pepper flakes  (Optional)", "1 pound shrimp, peeled and deveined", "1 pinch kosher salt and freshly ground pepper", "½ cup dry white wine", "1  lemon, juiced", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "¼ cup finely chopped fresh parsley leaves", "1 teaspoon extra-virgin olive oil, or to taste"], "direction": ["Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.", "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.", "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve."], "facts": "511 calories; protein 21.9g 44% DV; carbohydrates 57.5g 19% DV; fat 19.4g 30% DV; cholesterol 135.4mg 45% DV; sodium 260mg 10% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/234933/how-to-make-perfect-polenta/", "name": "How to Make Perfect Polenta", "summary": "\nPolenta is nothing more than coarsely ground cornmeal. The classic ratio is 1 part polenta to 4 parts water, but I like to measure the polenta just a little scant of a full cup. I often use chicken broth instead of water. It's a perfect base for any kind of saucy meat or mushroom ragout. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3778721.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "5 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups water", "1 teaspoon fine salt", "1 cup polenta", "3 tablespoons butter, divided", "½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"], "direction": ["Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps.", "Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender.", "Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish."], "facts": "291 calories; protein 9.2g 18% DV; carbohydrates 31g 10% DV; fat 14.7g 23% DV; cholesterol 33.4mg 11% DV; sodium 1186.1mg 47% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/88745/chicken-penne-italiano/", "name": "Chicken Penne Italiano", "summary": "\nAn Italian version of stir-fry, this tasty dish mixes cubed, boneless chicken and penne pasta with red and green peppers, garlic, tomatoes, oregano, and basil for an easy weeknight supper. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F685186.jpg", "meta": [["prep:", "25 mins"], ["cook:", "30 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces dry penne pasta", "1 tablespoon cornstarch", "1 (15 ounce) can chicken broth", "2 tablespoons olive oil", "1 tablespoon garlic, minced", "4  skinless, boneless chicken breast halves - cut into cubes", "1  onion, sliced", "½  green bell pepper, seeded and thinly sliced", "½  red bell pepper, seeded and thinly sliced", "1 (16 ounce) can diced tomatoes", "1 teaspoon dried oregano", "1 teaspoon dried basil", "¼ cup  medium-dry white wine", "½ cup freshly grated Parmesan cheese"], "direction": ["Bring a large pot of lightly salted water to a boil. Add the penne pasta and cook until al dente, 8 to 10 minutes. Drain, and reserve pasta.", "Whisk the cornstarch and chicken broth together in a bowl until smooth. Set aside until needed.", "Heat the olive oil in a skillet over medium heat. Add the garlic and chicken; stir and cook until the chicken is no longer pink and juices run clear, about 10 minutes. Stir in the onion, and green and red peppers; cook until tender, about 5 minutes. Stir in the tomatoes, and simmer for 10 minutes. Pour in the  chicken broth mixture and wine, if desired, and season with oregano and basil. Stir in the cooked pasta, and simmer over medium heat until thoroughly heated through, about 5 minutes. Serve garnished with Parmesan cheese."], "facts": "527 calories; protein 39.3g 79% DV; carbohydrates 56.4g 18% DV; fat 15g 23% DV; cholesterol 80.9mg 27% DV; sodium 926.7mg 37% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/18318/pan-fried-asparagus/", "name": "Pan-Fried Asparagus", "summary": "\nThis garlic asparagus dish is a Northern Italian side dish.  My family loves it!  Even the kids! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F214328.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["additional:", "5 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "2 tablespoons olive oil", "1 teaspoon coarse salt", "¼ teaspoon ground black pepper", "3 cloves garlic, minced", "1 pound fresh asparagus spears, trimmed"], "direction": ["Melt butter in a skillet over medium-high heat. Stir in the olive oil, salt, and pepper. Cook garlic in butter for a minute, but do not brown. Add asparagus, and cook for 10 minutes, turning asparagus to ensure even cooking."], "facts": "188 calories; protein 2.8g 6% DV; carbohydrates 5.2g 2% DV; fat 18.4g 28% DV; cholesterol 30.5mg 10% DV; sodium 524.6mg 21% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/13024/italian-wedding-soup-i/", "name": "Italian Wedding Soup I", "summary": "\nComing from Rhode Island, a very ethnic state, this soup was traditionally served at Italian weddings. Serve with grated Parmesan cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1087470.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ pound extra-lean ground beef", "1  egg, lightly beaten", "2 tablespoons dry bread crumbs", "1 tablespoon grated Parmesan cheese", "½ teaspoon dried basil", "½ teaspoon onion powder", "5 ¾ cups chicken broth", "2 cups thinly sliced escarole", "1 cup uncooked orzo pasta", "⅓ cup finely chopped carrot"], "direction": ["In medium bowl, combine meat, egg, bread crumbs, cheese, basil and onion powder; shape into 3/4 inch balls.", "In large saucepan, heat broth to boiling; stir in escarole, orzo pasta, chopped carrot and meatballs. Return to boil, then reduce heat to medium. Cook at slow boil for 10 minutes, or until pasta is al dente. Stir frequently to prevent sticking."], "facts": "416 calories; protein 27.3g 55% DV; carbohydrates 43.3g 14% DV; fat 14.2g 22% DV; cholesterol 86.8mg 29% DV; sodium 1211mg 48% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/8887/chicken-marsala/", "name": "Chicken Marsala", "summary": "\nA delicious, classic chicken dish -- lightly coated chicken breasts braised with Marsala wine and mushrooms. Easy and ideal for both a quick weeknight entree AND serving to company. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5107151.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup all-purpose flour for coating", "½ teaspoon salt", "¼ teaspoon ground black pepper", "½ teaspoon dried oregano", "4  skinless, boneless chicken breast halves - pounded 1/4 inch thick", "4 tablespoons butter", "4 tablespoons olive oil", "1 cup sliced mushrooms", "½ cup Marsala wine", "¼ cup cooking sherry"], "direction": ["In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.", "In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear."], "facts": "448 calories; protein 28.8g 58% DV; carbohydrates 13.3g 4% DV; fat 26.6g 41% DV; cholesterol 99mg 33% DV; sodium 543mg 22% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/", "name": "Homemade Lasagna", "summary": "\nThis is my mom's special homemade lasagna recipe with made from scratch tomato sauce and delicious, cheesy filling.  I have found none better anywhere.  Serve with a leafy green salad and crusty garlic bread, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581957.jpg", "meta": [["prep:", "1 hr"], ["cook:", "45 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (16 ounce) package lasagna noodles", "½ pound ground pork", "½ pound lean ground beef", "1 (8 ounce) can tomato sauce", "1 (28 ounce) can crushed tomatoes", "1 tablespoon chopped fresh parsley", "1 clove garlic, crushed", "½ teaspoon dried oregano", "½ cup minced onion", "⅛ teaspoon white sugar", "1 ½ teaspoons dried basil", "1 ½ teaspoons salt", "1 pound small curd cottage cheese", "3  eggs", "¾ cup grated Parmesan cheese", "2 teaspoons salt", "¼ teaspoon ground black pepper", "1 pound shredded mozzarella cheese"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).   Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain and set aside.", "Place pork and beef in a large, deep skillet. Cook over medium high heat until evenly brown.  Stir in tomato sauce, crushed tomatoes, parsley, garlic, oregano, onion, sugar, basil and salt. Simmer over medium-low heat for 30 minutes, stirring occasionally.", "In a large bowl, combine cottage cheese, eggs, Parmesan cheese, parsley, salt and pepper.", "In a 9x13 inch baking dish, place 2 layers of noodles on the bottom of dish; layer 1/2 of the cheese mixture, 1/2 of the mozzarella cheese and 1/2 of the sauce; repeat layers.", "Cover with aluminum foil and bake in preheated oven for 30 to 40 minutes. Remove foil and bake for another 5 to 10 minutes; let stand for 10 minutes before cutting; serve."], "facts": "638 calories; protein 45.7g 91% DV; carbohydrates 54g 17% DV; fat 27.2g 42% DV; cholesterol 160.8mg 54% DV; sodium 2053mg 82% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/143069/super-delicious-zuppa-toscana/", "name": "Super-Delicious Zuppa Toscana", "summary": "\nThis is an oh-so-good recipe. Just the right amount of spice to make you take a cold drink but definitely keep coming back for more! This soup is irresistible! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F23d2c233-8761-4375-8415-64043b233bf0%2Faa86db20-a368-4caf-b263-38e5c3a374d0%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound bulk mild Italian sausage", "1 ¼ teaspoons crushed red pepper flakes", "4 slices bacon, cut into 1/2 inch pieces", "1 large onion, diced", "1 tablespoon minced garlic", "5 (13.75 ounce) cans chicken broth", "6  potatoes, thinly sliced", "1 cup heavy cream", "¼ bunch fresh spinach, tough stems removed"], "direction": ["Cook the Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside.", "Cook the bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in the onions and garlic; cook until onions are soft and translucent, about 5 minutes.", "Pour the chicken broth into the Dutch oven with the bacon and onion mixture; bring to a boil over high heat. Add the potatoes, and boil until fork tender, about 20 minutes. Reduce the heat to medium and stir in the heavy cream and the cooked sausage; heat through. Mix the spinach into the soup just before serving."], "facts": "554 calories; protein 19.8g 40% DV; carbohydrates 45.8g 15% DV; fat 32.6g 50% DV; cholesterol 98.9mg 33% DV; sodium 2386.4mg 96% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/21353/italian-spaghetti-sauce-with-meatballs/", "name": "Italian Spaghetti Sauce with Meatballs", "summary": "\nThis is a recipe I got from my mother years ago --  it's great. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5864844.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound lean ground beef", "1 cup fresh bread crumbs", "1 tablespoon dried parsley", "1 tablespoon grated Parmesan cheese", "¼ teaspoon ground black pepper", "⅛ teaspoon garlic powder", "1  egg, beaten"], "direction": ["In a large bowl, combine ground beef, bread crumbs, parsley, Parmesan, 1/4 teaspoon black pepper, garlic powder and beaten egg.  Mix well and form into 12 balls.  Store, covered, in refrigerator until needed.", "In a large saucepan over medium heat, saute onion and garlic in olive oil until onion is translucent.  Stir in tomatoes, salt, sugar and bay leaf.  Cover, reduce heat to low, and simmer 90 minutes.  Stir in tomato paste, basil, 1/2 teaspoon pepper and meatballs and simmer 30 minutes more.  Serve."], "facts": "347 calories; protein 18.9g 38% DV; carbohydrates 23g 7% DV; fat 21.2g 33% DV; cholesterol 77.4mg 26% DV; sodium 1492.5mg 60% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/", "name": "Homemade Four Cheese Ravioli", "summary": "\nGreat homemade Italian ravioli recipe that I have recreated to taste like the ravioli at Maggiano's restaurant. Don't be intimidated by the large list of ingredients, it is well worth it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5943283.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "20 ravioli"]], "ingredients": ["2 cups all-purpose flour", "1 pinch salt", "1 teaspoon olive oil", "2  eggs", "1 ½ tablespoons water"], "direction": ["Mound the flour and salt together on a work surface and form a well. Beat the teaspoon of olive oil, 2 eggs, and water in a bowl. Pour half the egg mixture into the well. Begin mixing the egg with the flour with one hand; use your other hand to keep the flour mound steady. Add the remaining egg mixture and knead to form a dough.", "Knead the dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form the dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour.", "While the dough is resting, prepare the ravioli filling. Combine the ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley and mix well. Set the filling aside.", "Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the crushed garlic and pesto sauce and cook for one minute. Pour in the heavy cream, raise the heat to high, and bring the sauce to a boil. Reduce the heat and simmer for 5 minutes. Add the Parmesan cheese and stir until the cheese melts. Remove the pan from the heat and keep warm.", "Meanwhile, in a separate saucepan, warm the marinara sauce over medium-low heat.", "Preheat an oven to 375 degrees F (190 degrees C). Beat the egg with the tablespoon of water to make the egg wash.", "Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop the filling mixture on the dough by teaspoonfuls about one inch apart. Cover the filling with the top sheet of pasta, pressing out the air from around each portion of filling. Press firmly around the filling to seal. Cut into individual ravioli with a knife or pizza cutter. Seal the edges.", "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well.", "Grease a baking sheet. Place the cooked ravioli on the sheet pan and bake in the preheated oven until brown, about 4 minutes.", "To serve the ravioli, divide them among four warmed serving bowls. Drizzle the marinara sauce over the ravioli and then top with the cream sauce."], "facts": "1270 calories; protein 37.8g 76% DV; carbohydrates 80.4g 26% DV; fat 89.2g 137% DV; cholesterol 406.5mg 136% DV; sodium 1358.9mg 54% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/12942/italian-sausage-soup/", "name": "Italian Sausage Soup", "summary": "\nA hearty winter favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6285692.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound Italian sausage", "1 clove garlic, minced", "2 (14 ounce) cans beef broth", "1 (14.5 ounce) can Italian-style stewed tomatoes", "1 cup sliced carrots", "1 (14.5 ounce) can great Northern beans, undrained", "2 small zucchini, cubed", "2 cups spinach - packed, rinsed and torn", "¼ teaspoon ground black pepper", "¼ teaspoon salt"], "direction": ["In a stockpot or Dutch oven, brown sausage with garlic.  Stir in  broth, tomatoes and carrots, and season with salt and pepper. Reduce heat, cover, and simmer 15 minutes.", "Stir in beans with liquid and zucchini. Cover, and simmer another 15 minutes, or until zucchini is tender.", "Remove from heat, and add spinach.  Replace lid allowing the heat from the soup to cook the spinach leaves.  Soup is ready to serve after 5 minutes."], "facts": "385 calories; protein 18.8g 38% DV; carbohydrates 22.5g 7% DV; fat 24.4g 38% DV; cholesterol 57.5mg 19% DV; sodium 1258.7mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/219164/the-best-parmesan-chicken-bake/", "name": "The Best Parmesan Chicken Bake", "summary": "\nThis chicken Parmesan is done casserole style (so, no breading or frying!), but still offers up that irresistible combination of tender chicken, crunchy/cheesy coating, and flavorful sauce. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1010419.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons olive oil", "2 cloves garlic, crushed and finely chopped", "¼ teaspoon crushed red pepper flakes, or to taste", "6  skinless, boneless chicken breast halves", "2 cups prepared marinara sauce", "¼ cup chopped fresh basil", "1 (8 ounce) package shredded mozzarella cheese, divided", "½ cup grated Parmesan cheese, divided", "1 (5 ounce) package garlic croutons"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Coat the bottom of a 9x13 inch casserole dish with olive oil, and sprinkle with garlic and hot red pepper flakes.", "Arrange the chicken breasts in bottom of the dish, and pour marinara sauce over chicken. Sprinkle basil over marinara sauce, and top with half the mozzarella cheese, followed by half the Parmesan cheese. Sprinkle on the croutons, then top with the remaining mozzarella cheese and remaining Parmesan cheese.", "Bake in preheated oven until cheese and croutons are golden brown and the chicken is no longer pink inside, about 35 minutes to an hour, depending on the shape and thickness of your chicken breasts. An instant-read thermometer inserted into the thickest part of a chicken breast should read at least 160 degrees F (70 degrees C)."], "facts": "477 calories; protein 40.3g 81% DV; carbohydrates 28g 9% DV; fat 21.7g 33% DV; cholesterol 100.2mg 33% DV; sodium 1022.4mg 41% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/76808/italian-sausage-peppers-and-onions/", "name": "Italian Sausage, Peppers, and Onions", "summary": "\nMy family has been using this very simple and delicious recipe for sausage, peppers, and onions for years and years now. For an extra kick, try using half sweet sausage and half hot sausage! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F480124.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 (4 ounce) links sweet Italian sausage", "2 tablespoons butter", "1  yellow onion, sliced", "½  red onion, sliced", "4 cloves garlic, minced", "1 large red bell pepper, sliced", "1  green bell pepper, sliced", "1 teaspoon dried basil", "1 teaspoon dried oregano", "¼ cup white wine"], "direction": ["Place the sausage in a large skillet over medium heat, and brown on all sides. Remove from skillet, and slice.", "Melt butter in the skillet. Stir in the yellow onion, red onion, and garlic, and cook 2 to 3 minutes. Mix in red bell pepper and green bell pepper. Season with basil, and oregano. Stir in white wine. Continue to cook and stir until peppers and onions are tender.", "Return sausage slices to skillet with the vegetables. Reduce heat to low, cover, and simmer 15 minutes, or until sausage is heated through."], "facts": "461 calories; protein 17.1g 34% DV; carbohydrates 7g 2% DV; fat 39.4g 61% DV; cholesterol 96.1mg 32% DV; sodium 857mg 34% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11959/slow-cooker-lasagna/", "name": "Slow Cooker Lasagna", "summary": "\nThis recipe is so easy, you might think that you are doing something wrong. It is delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3605394.jpg", "meta": [["prep:", "20 mins"], ["cook:", "4 hrs 20 mins"], ["total:", "4 hrs 40 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 pound lean ground beef", "1  onion, chopped", "2 teaspoons minced garlic", "1 (29 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "1 ½ teaspoons salt", "1 teaspoon dried oregano", "1 (12 ounce) package lasagna noodles", "12 ounces cottage cheese", "½ cup grated Parmesan cheese", "16 ounces shredded mozzarella cheese"], "direction": ["In a large skillet over medium heat cook the ground beef, onion, and garlic until brown. Add the tomato sauce, tomato paste, salt, and oregano and stir until well incorporated. Cook until heated through.", "In a large bowl mix together the cottage cheese, grated Parmesan cheese, and shredded mozzarella cheese.", "Spoon a layer of the meat mixture onto the bottom of the slow cooker. Add a double layer of the uncooked lasagna noodles. Break to fit noodles into slow cooker. Top noodles with a portion of the cheese mixture. Repeat the layering of sauce, noodles, and cheese until all the ingredients are used.", "Cover, and cook on LOW setting  for 4 to 6 hours."], "facts": "446 calories; protein 31.2g 62% DV; carbohydrates 35.7g 12% DV; fat 20.3g 31% DV; cholesterol 71.6mg 24% DV; sodium 1420.2mg 57% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/132127/quick-bruschetta-chicken-bake/", "name": "Quick Bruschetta Chicken Bake", "summary": "\nA simple yet creative chicken meal mimics the popular Italian appetizer 'bruschetta' for a delicious entree reminiscent of romantic Italian evenings. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F254365.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds skinless, boneless chicken breast halves - cubed", "1 teaspoon salt", "1 (15 ounce) can diced tomatoes with juice", "½ cup water", "1 tablespoon minced garlic", "1 (6 ounce) box chicken-flavored dry bread stuffing mix", "2 cups shredded mozzarella cheese", "1 tablespoon Italian seasoning"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch glass baking dish with cooking spray.", "Toss the cubed chicken with the salt in a large bowl. Place the chicken in a layer into the bottom of the baking dish. Stir together tomatoes, water, garlic, and stuffing mix in a large bowl; set aside to soften. Sprinkle the cheese on top of the chicken, then sprinkle with the Italian seasoning. Spread the softened stuffing mixture on top.", "Bake uncovered until the chicken cubes have turned white and are no longer pink in the center, about 30 minutes."], "facts": "349 calories; protein 39.2g 79% DV; carbohydrates 25.9g 8% DV; fat 8.5g 13% DV; cholesterol 90.3mg 30% DV; sodium 1257.3mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/", "name": "Homemade Sweet Italian Sausage (Mild or Hot)", "summary": "\nThis is a very versatile Italian sausage which can be used in many different ways. You can take it from mild to hot and it's very easy to use. There are also different options for type of meat to use, like ground chuck or ground turkey (do not use ground beef). If using ground turkey, you'll have to coat your skillet with a little olive or veggie oil before cooking as it has very little fat and will stick to skillet. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F785124.jpg", "meta": [["prep:", "20 mins"], ["additional:", "12 hrs"], ["total:", "12 hrs 20 mins"], ["Servings:", "12"], ["Yield:", "3 1-pound portions"]], "ingredients": ["3 pounds ground pork", "3 tablespoons red wine vinegar", "1 tablespoon salt", "1 tablespoon freshly cracked black pepper", "1 ¼ tablespoons dried parsley", "1 tablespoon garlic powder", "1 tablespoon onion powder", "1 tablespoon dried basil", "2 teaspoons paprika", "2 teaspoons crushed red pepper flakes, or to taste", "¾ teaspoon ground fennel seed", "¼ teaspoon brown sugar", "⅛ teaspoon dried oregano", "⅛ teaspoon dried thyme"], "direction": ["Place the pork and red wine vinegar in a mixing bowl. Sprinkle with salt, black pepper, parsley, garlic powder, onion powder, basil, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed through the sausage.", "Divide the sausage into thirds, and form into 3 logs; wrap each in plastic wrap. Place wrapped sausage into a freezer bag before freezing, or store in refrigerator for at least 12 hours before cooking."], "facts": "243 calories; protein 20.5g 41% DV; carbohydrates 2.3g 1% DV; fat 16.4g 25% DV; cholesterol 73.6mg 25% DV; sodium 640.3mg 26% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11920/garlic-butter-sauce-i/", "name": "Garlic Butter Sauce I", "summary": "\nA rich, buttery sauce for pasta with herbs and garlic. Great with grated Parmesan or Romano cheese. Try serving it over your favorite pasta. Easy to double or triple. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1201086.jpg", "meta": [["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["⅓ cup butter", "1 clove crushed garlic", "¼ tablespoon dried basil", "2 teaspoons dried oregano"], "direction": ["In a small saucepan melt butter, add garlic and saute until cooked. Add dried oregano and dried basil and stir until heated through.", "Serve warm."], "facts": "559 calories; protein 1.3g 3% DV; carbohydrates 3.7g 1% DV; fat 61.7g 95% DV; cholesterol 162.7mg 54% DV; sodium 437.2mg 18% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/274411/bucatini-cacio-e-pepe-roman-sheep-herders-pasta/", "name": "Bucatini Cacio e Pepe (Roman Sheep Herder's Pasta)", "summary": "\nThis peasant food comes from Roman sheep herders who had little time and money to spend on eating. They used their sheep's cheese and a bit of the water that cooked the pasta to create a cream, then added black pepper to give it some extra flavor. Cheap, easy, and fast: this was perfect for them and for us even today! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2253389.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 teaspoon salt", "1 pound bucatini (dry)", "2 cups finely grated Pecorino Romano cheese", "1 ½ tablespoons freshly ground black pepper, or more to taste"], "direction": ["Bring a large pot of water to a boil and add salt. Cook bucatini in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes.", "Place grated Pecorino Romano cheese into a large glass bowl and mix with a fork to make sure the cheese contains no lumps.", "Once the bucatini are al dente, lift them out with a spaghetti fork or tongs and put them directly into the bowl with the cheese. Do not allow the water to drain too much.", "Add one ladle of pasta water to the bowl. Stir the bucatini around until a cream has formed. Add more pasta water, little by little, until a thick cream has formed. Sprinkle freshly ground pepper over the pasta. Toss and serve immediately."], "facts": "438 calories; protein 22.5g 45% DV; carbohydrates 59g 19% DV; fat 11.9g 18% DV; cholesterol 41.3mg 14% DV; sodium 869.6mg 35% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/264352/torta-di-mele-italian-apple-cake/", "name": "Torta di Mele (Italian Apple Cake)", "summary": "\nThis Italian apple cake recipe is from my mom and reminds me of my childhood. It tastes delicious, and I bake it for my family now. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5438948.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons unseasoned bread crumbs, or as needed", "½ cup unsalted butter, melted", "½ cup white sugar", "1  vanilla bean, split and scraped", "2  eggs", "1 ⅛ cups all-purpose flour", "1 teaspoon baking powder", "1 pinch salt", "1 tablespoon milk, or as needed  (Optional)", "2 pounds Granny Smith apples, peeled, cored and sliced thin", "¼ cup unsalted butter, cubed", "¼ cup white sugar"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C). Grease a pie plate and dust with bread crumbs", "Combine melted butter, 1/2 cup sugar, and vanilla bean seeds in a bowl. Add eggs and stir to combine. Mix flour, baking powder, and salt in a bowl and add to butter mixture. Add milk if batter is too thick", "Pour batter into the prepared pie plate. Distribute apple slices in a thick layer on top of the batter. Dot with cubed butter and sprinkle with 1/4 cup sugar.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 45 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto a serving plate or cooling rack. Let cool completely."], "facts": "379 calories; protein 4g 8% DV; carbohydrates 51.1g 17% DV; fat 18.8g 29% DV; cholesterol 86.8mg 29% DV; sodium 112.5mg 5% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/262799/italian-shrimp-and-scallop-risotto/", "name": "Italian Shrimp and Scallop Risotto", "summary": "\nThe secret to making a good seafood risotto is to use a high-quality fish stock and of course the freshest seafood you can find. Cook the shellfish and rice separately, as the rice needs more time. If you cook them together, the shellfish will overcook and get chewy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5171022.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "2 mins"], ["total:", "57 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons olive oil", "3 cloves garlic, peeled", "½ pound shelled sea scallops", "½ pound uncooked medium shrimp, peeled and deveined", "salt and ground black pepper to taste", "1 pinch red pepper flakes", "½ cup dry white wine", "½  lemon, juiced", "1 bunch fresh parsley, finely chopped"], "direction": ["Heat 3 tablespoons olive oil in a skillet over a medium heat. Add garlic; cook and stir until starting to sizzle, about 2 minutes. Stir in scallops and cook for 1 minute. Add shrimp and season with salt, pepper, and red pepper flakes. Cook over high heat until shrimp are pink, 3 to 5 minutes.", "Pour 1/2 cup white wine into the skillet and let the alcohol evaporate. Scrape the bottom of the skillet to deglaze; cook until the liquid is reduced, 2 to 3 minutes. Remove from heat, add lemon juice, and sprinkle with 1/2 of the parsley. Discard garlic. Cover the skillet to keep shellfish warm.", "Pour fish stock into a saucepan over medium heat and bring to a simmer.", "Melt butter in a skillet over low heat. Add 1 tablespoon olive oil and shallot. Cook until shallot is soft and translucent, but not brown, 3 to 5 minutes. Increase heat and add rice; cook until rice has absorbed the oil and butter and has a nutty aroma, stirring often, 1 to 2 minutes. Make sure not to burn the shallot and reduce heat if skillet gets too hot.", "Pour 1/2 cup white wine into the skillet and stir until alcohol has evaporated. Add 1 ladleful of fish stock, stir, and cook until rice has absorbed the stock. Add another ladleful and repeat the process until the rice is tender, 15 to 18 minutes in total.", "Add shellfish with their juices to the risotto pan 3 minutes before the end of cooking. Stir and finish cooking all together, adding stock if needed. Remove from heat. Stir in remaining parsley and 1 tablespoon extra-virgin olive oil. Let risotto stand for 2 minutes before serving."], "facts": "703 calories; protein 31g 62% DV; carbohydrates 75.2g 24% DV; fat 25.4g 39% DV; cholesterol 125mg 42% DV; sodium 1059.1mg 42% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/", "name": "Italian Baked Meatballs", "summary": "\nThis recipe makes the most tender and tasty meatballs. I also freeze these meatballs and take out how many servings I need for each meal. If cooking in sauce, add baked meatballs 20 minutes before serving time. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5834922.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "30 1-ounce meatballs"]], "ingredients": ["1 cup Italian-seasoned bread crumbs", "¼ cup grated Romano cheese", "2 tablespoons chopped fresh parsley", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ teaspoon garlic powder", "½ teaspoon onion powder", "½ cup water", "2  eggs", "1 ½ pounds ground beef"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together. Combine with water and eggs. Add ground beef and mix well. Roll mixture into balls and place on a nonstick baking sheet.", "Bake in the preheated oven until browned, about 30 minutes."], "facts": "343 calories; protein 24.4g 49% DV; carbohydrates 14.1g 5% DV; fat 20.4g 31% DV; cholesterol 135.2mg 45% DV; sodium 611.7mg 25% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/264440/traditional-spaghetti-allamatriciana/", "name": "Traditional Spaghetti all'Amatriciana", "summary": "\nThis classic Roman pasta dish is quick and easy to make with few ingredients. Traditionally, guanciale is used, but I prefer pancetta. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5443056.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound spaghetti", "3 tablespoons extra-virgin olive oil, divided, or more if needed", "1  onion, finely chopped", "7 ounces pancetta bacon, diced", "2 cups passata (crushed tomatoes)", "1 tablespoon water, or more as needed", "½ teaspoon white sugar", "2 tablespoons grated Parmesan cheese", "1 pinch red pepper flakes, or to taste", "salt and freshly ground black pepper to taste"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes.", "Meanwhile, heat 2 tablespoons olive oil in a large skillet over medium heat and cook onion until golden brown, about 5 minutes. Add pancetta and cook, stirring occasionally, until crisp, 2 to 3 minutes. Pour in passata, water, and sugar; cook until sauce has thickened, 10 to 15 minutes", "Drain spaghetti and toss with sauce, remaining olive oil, Parmesan cheese, and red pepper flakes. Season with salt and pepper."], "facts": "662 calories; protein 24g 48% DV; carbohydrates 97.2g 31% DV; fat 19.7g 30% DV; cholesterol 19.8mg 7% DV; sodium 615.7mg 25% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/262925/hearty-minestrone-soup-instant-pot/", "name": "Hearty Minestrone Soup (Instant Pot®)", "summary": "\nSo I feel like I am using my Instant Pot® at least 4 times a week. I have been having a great time experimenting and am amazed at the way the flavors are locked in and how quickly the meals are finished... not to say the super easy clean up. The main insert can go in the dishwasher and I hand-clean the top with very sudsy water. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5137405.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["additional:", "5 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1 pound beef stew meat", "1 large onion, diced", "2 stalks celery, diced", "⅓ pound green beans, trimmed and cut into 1/2-inch pieces", "1 large carrot, diced", "4 cloves garlic, minced", "1 teaspoon dried oregano", "1 teaspoon dried basil", "1 pinch ground black pepper to taste", "6 cups chicken bone broth (such as Kettle and Fire)", "1 (28 ounce) can no-salt-added diced tomatoes", "1 (14 ounce) can crushed tomatoes", "1 (15 ounce) can red kidney beans, drained and rinsed", "1 cup gluten-free ditalini pasta", "1 pinch kosher salt to taste", "⅓ cup finely grated Parmesan cheese", "2 tablespoons chopped fresh basil"], "direction": ["Heat oil in a multi-functional pressure cooker (such as Instant Pot®) on Saute mode. Add beef and onion; cook until beef is no longer pink on the outside, about 4 minutes. Add celery, green beans, carrot, garlic, oregano, dried basil, and pepper. Stir to combine.", "Pour broth, diced tomatoes, and crushed tomatoes into the pot with the beef. Stir well. Select Soup setting; close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 35 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Stir in kidney beans and pasta. Turn on Slow Cook mode and cook until pasta and vegetables are tender, about 10 minutes. Season with salt. Ladle soup into bowls and top with Parmesan cheese and fresh basil."], "facts": "369 calories; protein 23.4g 47% DV; carbohydrates 32.1g 10% DV; fat 16.8g 26% DV; cholesterol 56.7mg 19% DV; sodium 1214.6mg 49% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/257379/lasagne-alla-bolognese-saporite/", "name": "Lasagne Alla Bolognese Saporite", "summary": "\nThis is the classic lasagne alla Bolognese recipe from the Emilia region in Northern Italy. The Bolognese sauce is made with a mixture of beef and pork mince. The addition of prosciutto, red wine, cinnamon, and nutmeg make it truly authentic. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4506922.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 48 mins"], ["additional:", "3 mins"], ["total:", "3 hrs 21 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1 small onion, chopped", "1  carrot, chopped", "1  shallot, minced", "3 ½ ounces prosciutto, chopped", "11 ounces ground pork", "11 ounces ground beef", "1 teaspoon ground nutmeg", "½ teaspoon ground cinnamon", "salt to taste", "6 fluid ounces red wine", "21 ounces peeled San Marzano tomatoes"], "direction": ["Heat olive oil in a saucepan over medium heat; cook and stir onion, carrot, shallot, and prosciutto until onion is translucent and prosciutto releases some fat, about 10 minutes. Add pork and beef; season with 1 teaspoon nutmeg, cinnamon, and salt to taste. Cook and stir over medium-high heat until browned and crumbly, about 10 minutes.", "Pour red wine over meat mixture; increase heat and cook until wine evaporates, about 3 minutes. Add tomatoes and mix well; bring to a boil, cover, reduce heat, and simmer, stirring occasionally, until tomatoes break down and flavors of Bolognese sauce have combined, 1 1/2 to 2 hours.", "Melt butter in a saucepan over medium-low heat; add flour. Whisk vigorously until mixture is smooth. Pour in milk and cook, stirring occasionally, over medium heat until white sauce thickens enough to cover the back of a spoon, about 10 minutes; season with 1/2 teaspoon nutmeg, salt, and pepper.", "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain and run under cold water to stop the cooking process. Lay noodles on a clean towel and pat dry.", "Preheat oven to 350 degrees F (175 degrees C).", "Pour a ladleful of Bolognese sauce and a ladleful of white sauce over the bottom of a 9x13-inch baking dish; top with 3 or 4 lasagna noodles. Cover noodles with 1/3 of the white sauce and 1/3 of the Bolognese sauce. Sprinkle some of the Parmesan cheese on top; cover with lasagna noodles. Repeat layers, ending with white sauce and Parmesan cheese.", "Bake in the preheated oven until bubbling and top is golden brown, 30 to 40 minutes. Let stand 3 to 4 minutes before slicing."], "facts": "694 calories; protein 35.9g 72% DV; carbohydrates 48.2g 16% DV; fat 38g 59% DV; cholesterol 112.9mg 38% DV; sodium 822.2mg 33% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/246757/lemony-pork-piccata/", "name": "Lemony Pork Piccata", "summary": "\nA wonderful tender pork dish with a delicate piccata sauce. Very simple and really delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3491044.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 pork chops"]], "ingredients": ["4  pork chops", "½ cup all-purpose flour", "salt and ground black pepper to taste", "3 tablespoons unsalted butter", "2 tablespoons sliced shallots", "⅓ cup dry white wine", "¼ cup chicken stock", "1 tablespoon fresh lemon juice", "¼ cup chopped fresh parsley", "1 tablespoon lemon zest", "1 tablespoon capers"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Pound pork chops between 2 sheets waxed paper or plastic wrap until very thin, about 1/8 inch.", "Mix flour, salt, and pepper together in a shallow bowl. Dredge both sides of each pork chop through flour mixture, shaking off any excess flour.", "Heat butter in a large skillet over medium heat until butter starts to sizzle. Add shallots and pork chops in 1 layer, working in batches if needed.  Cook pork chops until golden brown and almost cooked through, 3 to 4 minutes per side. Transfer pork chops to a baking dish and lightly tent with aluminum foil, reserving the shallots and browned bits of food in the skillet.", "Bake pork chops in the preheated oven until cooked through, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).", "Pour wine and chicken stock into the skillet and bring to a boil while scraping the browned bits of food off of the bottom with a wooden spoon. Reduce heat and simmer until sauce is reduced by half, 2 to 5 minutes. Stir lemon juice into sauce.", "Drizzle sauce over pork chops and top with parsley, lemon zest, and capers."], "facts": "321 calories; protein 25.6g 51% DV; carbohydrates 14.3g 5% DV; fat 15.8g 24% DV; cholesterol 81.9mg 27% DV; sodium 184.6mg 7% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/", "name": "World's Best Lasagna", "summary": "\nIt takes a little work, but it is worth it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F11%2Fworlds-best-lasagna.jpeg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 30 mins"], ["additional:", "15 mins"], ["total:", "3 hrs 15 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 pound sweet Italian sausage", "¾ pound lean ground beef", "½ cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "½ cup water", "2 tablespoons white sugar", "1 ½ teaspoons dried basil leaves", "½ teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 ½ teaspoons salt, divided, or to taste", "¼ teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12  lasagna noodles", "16 ounces ricotta cheese", "1  egg", "¾ pound mozzarella cheese, sliced", "¾ cup grated Parmesan cheese"], "direction": ["In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.", "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.", "Preheat oven to 375  degrees F (190 degrees C).", "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.", "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."], "facts": "448 calories; protein 29.7g 59% DV; carbohydrates 36.5g 12% DV; fat 21.3g 33% DV; cholesterol 81.8mg 27% DV; sodium 1400.4mg 56% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/214500/sausage-peppers-onions-and-potato-bake/", "name": "Sausage, Peppers, Onions, and Potato Bake", "summary": "\nThis is an Italian comfort food classic!  The smell of this cooking in my kitchen transports me back to playing on the street in front of my Papa and Gigi's house in Brooklyn.  I make 2 trays of this for every family get-together, and it's gone in a flash! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F05%2F3384034_original.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 teaspoons olive oil", "2 pounds Italian sausage links, cut into 2-inch pieces", "¼ cup olive oil", "4 large potatoes, peeled and thickly sliced", "2 large green bell peppers, seeded and cut into wedges", "2 large red bell peppers, seeded and cut into wedges", "3 large onions, cut into wedges", "½ cup white wine", "½ cup chicken stock", "1 teaspoon Italian seasoning", "salt and pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Heat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned. Transfer the cooked sausage to a large baking dish.", "Pour 1/4 cup of olive oil into the skillet, and cook the potatoes, stirring occasionally, until browned, about 10 minutes. Place the potatoes into the baking dish, leaving some oil in the skillet.", "Cook and stir the green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes. Add the vegetables to the baking dish.", "Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper. Gently stir the sausage, potatoes, and vegetables together.", "Bake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot."], "facts": "539 calories; protein 20.2g 40% DV; carbohydrates 45.8g 15% DV; fat 29.8g 46% DV; cholesterol 44.9mg 15% DV; sodium 1041mg 42% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/", "name": "Chicken Parmesan", "summary": "\nMy version of chicken parmesan is a little different than what they do in the restaurants, with less sauce and a crispier crust. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6635156.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skinless, boneless chicken breast halves", "salt and freshly ground black pepper to taste", "2  eggs", "1 cup panko bread crumbs, or more as needed", "½ cup grated Parmesan cheese", "2 tablespoons all-purpose flour, or more if needed", "1 cup olive oil for frying", "½ cup prepared tomato sauce", "¼ cup fresh mozzarella, cut into small cubes", "¼ cup chopped fresh basil", "½ cup grated provolone cheese", "¼ cup grated Parmesan cheese", "1 tablespoon olive oil"], "direction": ["Preheat an oven to 450 degrees F (230 degrees C).", "Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.", "Beat eggs in a shallow bowl and set aside.", "Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.", "Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.", "Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes.", "Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven.", "Place chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil.", "Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."], "facts": "471 calories; protein 42.1g 84% DV; carbohydrates 24.8g 8% DV; fat 24.9g 38% DV; cholesterol 186.7mg 62% DV; sodium 840.3mg 34% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/85389/gourmet-mushroom-risotto/", "name": "Gourmet Mushroom Risotto", "summary": "\nAuthentic Italian-style risotto cooked the slow and painful way, but oh so worth it. Complements grilled meats and chicken dishes very well. Check the rice by biting into it. It should be slightly al dente (or resist slightly to the tooth but not be hard in the center). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F246711.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups chicken broth, divided", "3 tablespoons olive oil, divided", "1 pound portobello mushrooms, thinly sliced", "1 pound white mushrooms, thinly sliced", "2  shallots, diced", "1 ½ cups Arborio rice", "½ cup dry white wine", "sea salt to taste", "freshly ground black pepper to taste", "3 tablespoons finely chopped chives", "4 tablespoons butter", "⅓ cup freshly grated Parmesan cheese"], "direction": ["In a saucepan, warm the broth over low heat.", "Warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Stir in the mushrooms, and cook until soft, about 3 minutes. Remove mushrooms and their liquid, and set aside.", "Add 1 tablespoon olive oil to skillet,  and stir in the shallots. Cook 1 minute. Add rice, stirring to coat with oil, about 2 minutes. When the rice has taken on a pale, golden color, pour in wine, stirring constantly until the wine is fully absorbed. Add 1/2 cup broth to the rice, and stir until the broth is absorbed. Continue adding broth 1/2 cup at a time, stirring continuously, until the liquid is absorbed and the rice is al dente, about 15 to 20 minutes.", "Remove from heat, and stir in mushrooms with their liquid, butter, chives, and parmesan. Season with salt and pepper to taste."], "facts": "431 calories; protein 11.3g 23% DV; carbohydrates 56.6g 18% DV; fat 16.6g 26% DV; cholesterol 29.3mg 10% DV; sodium 1130.8mg 45% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11887/pesto-pasta/", "name": "Pesto Pasta", "summary": "\nEasy to make, but full of flavor!  Good hot or cold. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4475574.jpg", "meta": [["prep:", "5 mins"], ["additional:", "10 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["½ cup chopped onion", "2 ½ tablespoons pesto", "2 tablespoons olive oil", "2 tablespoons grated Parmesan cheese", "1 (16 ounce) package pasta", "salt to taste", "ground black pepper to taste"], "direction": ["Cook pasta in a large pot of boiling water until done.  Drain.", "Meanwhile, heat the oil in a frying pan over medium low heat.   Add pesto, onion, and salt and pepper.  Cook about five minutes, or until onions are soft.", "In a large bowl, mix pesto mixture into pasta.  Stir in grated cheese.  Serve."], "facts": "225 calories; protein 7.8g 16% DV; carbohydrates 32g 10% DV; fat 7.2g 11% DV; cholesterol 43.5mg 15% DV; sodium 71.3mg 3% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/12011/easy-lasagna-ii/", "name": "Easy Lasagna II", "summary": "\nMy family loves lasagna, but sometimes I lack the time for the long version. This is easy and satisfies everyone. Try it tonight! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4511968.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 pound lean ground beef", "1 (32 ounce) jar spaghetti sauce", "32 ounces cottage cheese", "3 cups shredded mozzarella cheese", "2  eggs", "½ cup grated Parmesan cheese", "2 teaspoons dried parsley", "salt to taste", "ground black pepper to taste", "9  lasagna noodles", "½ cup water"], "direction": ["In a large skillet over medium heat brown the ground beef. Drain the grease. Add spaghetti sauce and simmer for 5 minutes.", "In a large bowl, mix together the cottage cheese, 2 cups of the mozzarella cheese, eggs, half of the grated Parmesan cheese, dried parsley, salt and ground black pepper.", "To assemble, in the bottom of a 9x13 inch baking dish evenly spread 3/4 cup of the sauce mixture. Cover with 3 uncooked lasagna noodles, 1 3/4 cup of the cheese mixture, and 1/4 cup sauce. Repeat layers once more: top with 3 noodles, remaining sauce, remaining mozzarella and Parmesan cheese. Add 1/2 cup water to the edges of the pan. Cover with aluminum foil.", "Bake in a preheated 350 degree F(175 degrees C) oven for 45 minutes. Uncover and bake an additional 10 minutes. Let stand 10 minutes before serving."], "facts": "377 calories; protein 29.4g 59% DV; carbohydrates 26.4g 9% DV; fat 16.7g 26% DV; cholesterol 89.5mg 30% DV; sodium 870.3mg 35% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/36925/garlic-butter/", "name": "Garlic Butter", "summary": "\nSometimes the basics are the best!  I've used this simple recipe for years to make garlic bread, and any leftovers go great on barbequed steaks, pasta, rice or potatoes. You can use any butter or margarine you like. Also, fresh or minced garlic in a jar works well. Adjust the amount of garlic to your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5221403.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "16"], ["Yield:", "1 cup"]], "ingredients": ["1 cup butter, softened", "1 tablespoon minced garlic", "¼ cup grated Parmesan cheese", "1 tablespoon garlic salt", "1 teaspoon Italian seasoning", "½ teaspoon ground black pepper", "¼ teaspoon ground paprika"], "direction": ["In a small bowl, combine softened butter, minced garlic and parmesan cheese. Season with garlic salt, Italian seasoning, pepper and paprika. Mix until smooth."], "facts": "110 calories; protein 0.8g 2% DV; carbohydrates 0.5g; fat 12g 18% DV; cholesterol 31.9mg 11% DV; sodium 445.5mg 18% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/14385/pasta-salad/", "name": "Pasta Salad", "summary": "\nA dear friend gave me this recipe many years ago and I've been making it ever since. It's great for barbecues. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3512373.jpg", "meta": [["prep:", "20 mins"], ["cook:", "15 mins"], ["additional:", "13 hrs 20 mins"], ["total:", "13 hrs 55 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound tri-colored spiral pasta", "6 tablespoons salad seasoning mix", "1 (16 ounce) bottle Italian-style salad dressing", "2 cups cherry tomatoes, diced", "1  green bell pepper, chopped", "1  red bell pepper, diced", "½  yellow bell pepper, chopped", "1 (2.25 ounce) can black olives, chopped"], "direction": ["In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain.", "Whisk together the salad spice mix and Italian dressing.", "In a salad bowl, combine the pasta, cherry tomatoes, bell peppers and olives. Pour dressing over salad; toss and refrigerate overnight."], "facts": "400 calories; protein 7.9g 16% DV; carbohydrates 39g 13% DV; fat 24.8g 38% DV; cholesterol 2.7mg 1% DV; sodium 1904.2mg 76% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/13883/manicotti/", "name": "Manicotti", "summary": "\nDelicious!  Serve with a crispy salad and garlic bread, and you'll have a dish your family will love!  The kids like to help stuff the noodles too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F48652.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pint part-skim ricotta cheese", "8 ounces shredded mozzarella cheese", "¾ cup grated Parmesan cheese", "2  eggs", "1 teaspoon dried parsley", "salt to taste", "ground black pepper to taste", "1 (16 ounce) jar spaghetti sauce", "5 ½ ounces manicotti pasta"], "direction": ["Cook manicotti in boiling water until done.  Drain, and rinse with cold water.", "Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, combine ricotta, mozzarella, and 1/2 cup Parmesan, eggs, parsley, and salt and pepper.  Mix well.", "Pour 1/2 cup sauce into an 11x17 inch baking dish.  Fill each manicotti shell with 3 tablespoons cheese mixture, and arrange over sauce . Pour remaining sauce over top, and sprinkle with remaining Parmesan cheese.", "Bake 45 minutes, or until bubbly."], "facts": "676 calories; protein 46g 92% DV; carbohydrates 53.2g 17% DV; fat 30.9g 48% DV; cholesterol 188.8mg 63% DV; sodium 1254.7mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/16427/slow-cooker-italian-beef-for-sandwiches/", "name": "Slow Cooker Italian Beef for Sandwiches", "summary": "\nThis makes a sandwich similar to one I used to get at a local restaurant when I lived in a suburb of Chicago. My all time favorite! Serve on crusty rolls with roasted sweet or hot peppers, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F178087.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 hrs"], ["total:", "12 hrs 15 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["3 cups water", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 teaspoon dried oregano", "1 teaspoon dried basil", "1 teaspoon onion salt", "1 teaspoon dried parsley", "1 teaspoon garlic powder", "1  bay leaf", "1 (.7 ounce) package dry Italian-style salad dressing mix", "1 (5 pound) rump roast"], "direction": ["Combine water with salt, ground black pepper, oregano, basil, onion salt, parsley, garlic powder, bay leaf, and salad dressing mix in a saucepan. Stir well, and bring to a boil.", "Place roast in slow cooker, and pour salad dressing mixture over the meat.", "Cover, and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork."], "facts": "318 calories; protein 39.4g 79% DV; carbohydrates 1.6g 1% DV; fat 15.8g 24% DV; cholesterol 100.4mg 34% DV; sodium 819.1mg 33% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/40399/the-best-meatballs/", "name": "The Best Meatballs", "summary": "\nI never knew how to make good meatballs until I found this recipe. I normally make mine with just ground beef and they still taste great. I've used the combination of pork, beef and veal and they are equally good. Definitely use fresh bread crumbs and freshly grate your cheese instead of using the canned variety...it really does make a difference. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F887350.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["total:", "50 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "½ pound ground veal", "½ pound ground pork", "2 cloves garlic, minced", "2  eggs", "1 cup freshly grated Romano cheese", "1 ½ tablespoons chopped Italian flat leaf parsley", "salt and ground black pepper to taste", "2 cups stale Italian bread, crumbled", "1 ½ cups lukewarm water", "1 cup olive oil"], "direction": ["Combine beef, veal, and pork in a large bowl. Add garlic, eggs, cheese, parsley, salt and pepper.", "Blend bread crumbs into meat mixture. Slowly add the water 1/2 cup at a time. The mixture should be very moist but still hold its shape if rolled into meatballs. (I usually use about 1 1/4 cups of water). Shape into meatballs.", "Heat olive oil in a large skillet. Fry meatballs in batches. When the meatball is very brown and slightly crisp remove from the heat and drain on a paper towel. (If your mixture is too wet, cover the meatballs while they are cooking so that they hold their shape better.)"], "facts": "613 calories; protein 26.6g 53% DV; carbohydrates 6.6g 2% DV; fat 53.2g 82% DV; cholesterol 148.6mg 50% DV; sodium 333.1mg 13% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/", "name": "Spaghetti Sauce with Ground Beef", "summary": "\nThis recipe has been handed down from my mother.  It is a family favorite and will not be replaced! (Definite husband pleaser!) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667748.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "4 cloves garlic, minced", "1 small green bell pepper, diced", "1 (28 ounce) can diced tomatoes", "1 (16 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "2 teaspoons dried oregano", "2 teaspoons dried basil", "1 teaspoon salt", "½ teaspoon black pepper"], "direction": ["Combine ground beef, onion, garlic, and green pepper in a large saucepan.  Cook and stir until meat is brown and vegetables are tender. Drain grease.", "Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally."], "facts": "185 calories; protein 12.4g 25% DV; carbohydrates 15g 5% DV; fat 9.3g 14% DV; cholesterol 34.8mg 12% DV; sodium 930.8mg 37% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/", "name": "Chef John's Italian Meatballs", "summary": "\nHomemade meatballs are a very easy to make, and since we skip the very messy step of pan-frying these before they hit the sauce, it becomes downright simple. Here I use a standard half-beef/half-pork mixture. You can substitute water or beef broth for the milk, if preferred. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4531471.jpg", "meta": [["prep:", "20 mins"], ["cook:", "35 mins"], ["additional:", "1 hr 20 mins"], ["total:", "2 hrs 15 mins"], ["Servings:", "30"], ["Yield:", "30 meatballs"]], "ingredients": ["⅓ cup plain bread crumbs", "½ cup milk", "2 tablespoons olive oil", "1  onion, diced", "1 pound ground beef", "1 pound ground pork", "2  eggs", "¼ bunch fresh parsley, chopped", "3 cloves garlic, crushed", "2 teaspoons salt", "1 teaspoon ground black pepper", "½ teaspoon red pepper flakes", "1 teaspoon dried Italian herb seasoning", "2 tablespoons grated Parmesan cheese"], "direction": ["Cover a baking sheet with foil and spray lightly with cooking spray.", "Soak bread crumbs in milk in a small bowl for 20 minutes.", "Heat olive oil in a skillet over medium heat. Cook and stir onions in hot oil until translucent, about 20 minutes.", "Mix beef and pork together in a large bowl. Stir onions, bread crumb mixture, eggs, parsley, garlic, salt, black pepper, red pepper flakes, Italian herb seasoning, and Parmesan cheese into meat mixture with a rubber spatula until combined. Cover and refrigerate for about one hour.", "Preheat an oven to 425 degrees F (220 degrees C).", "Using wet hands, form meat mixture into balls about 1 1/2 inches in diameter. Arrange onto prepared baking sheet.", "Bake in the preheated oven until browned and cooked through, 15 to 20 minutes."], "facts": "82 calories; protein 6.2g 12% DV; carbohydrates 1.7g 1% DV; fat 5.5g 8% DV; cholesterol 32.3mg 11% DV; sodium 192.1mg 8% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/54165/balsamic-bruschetta/", "name": "Balsamic Bruschetta", "summary": "\nSimple appetizer - the balsamic vinegar gives it a little kick. Best if the mixture has 1 or 2 hours to blend flavors before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F866248.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  roma (plum) tomatoes, diced", "⅓ cup chopped fresh basil", "¼ cup shredded Parmesan cheese", "2 cloves garlic, minced", "1 tablespoon balsamic vinegar", "1 teaspoon olive oil", "¼ teaspoon kosher salt", "¼ teaspoon freshly ground black pepper", "1 loaf French bread, toasted and sliced"], "direction": ["In a bowl, toss together the tomatoes, basil, Parmesan cheese, and garlic. Mix in the balsamic vinegar, olive oil, kosher salt, and pepper. Serve on toasted bread slices."], "facts": "194 calories; protein 8.3g 17% DV; carbohydrates 35.2g 11% DV; fat 2.5g 4% DV; cholesterol 2.2mg 1% DV; sodium 470.9mg 19% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/25321/eggplant-parmesan-ii/", "name": "Eggplant Parmesan II", "summary": "\nThis is a no fry variation of this popular dish, and is just as delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5068161.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "10"], ["Yield:", "8 to 10 servings"]], "ingredients": ["3  eggplant, peeled and thinly sliced", "2  eggs, beaten", "4 cups Italian seasoned bread crumbs", "6 cups spaghetti sauce, divided", "1 (16 ounce) package mozzarella cheese, shredded and divided", "½ cup grated Parmesan cheese, divided", "½ teaspoon dried basil"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Dip eggplant slices in egg, then in bread crumbs.  Place in a single layer on a baking sheet.  Bake in preheated oven for 5 minutes on each side.", "In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom.  Place a layer of eggplant slices in the sauce.  Sprinkle with mozzarella and Parmesan cheeses.  Repeat with remaining ingredients, ending with the cheeses.  Sprinkle basil on top.", "Bake in preheated oven for 35 minutes, or until golden brown."], "facts": "487 calories; protein 24.2g 48% DV; carbohydrates 62.1g 20% DV; fat 16g 25% DV; cholesterol 72.8mg 24% DV; sodium 1663.1mg 67% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/222000/spaghetti-aglio-e-olio/", "name": "Spaghetti Aglio e Olio", "summary": "\nNo two spaghetti aglio e olio recipes are alike, but this one is pretty true to the classic method. The key is slowly toasting the garlic slices to a perfect golden-brown in the olive oil. If it's too light, you don't get the full flavor and if it's too dark it gets bitter. My advice? Do it perfectly. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3727226.jpg", "meta": [["prep:", "10 mins"], ["cook:", "22 mins"], ["total:", "32 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound uncooked spaghetti", "6 cloves garlic, thinly sliced", "½ cup olive oil", "¼ teaspoon red pepper flakes, or to taste", "salt and freshly ground black pepper to taste", "¼ cup chopped fresh Italian parsley", "1 cup finely grated Parmigiano-Reggiano cheese"], "direction": ["Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and transfer to a pasta bowl.", "Combine garlic and olive oil in a cold skillet. Cook over medium heat to slowly toast garlic, about 10 minutes. Reduce heat to medium-low when olive oil begins to bubble. Cook and stir until garlic is golden brown, about another 5 minutes. Remove from heat.", "Stir red pepper flakes, black pepper, and salt into the pasta. Pour in olive oil and garlic, and sprinkle on Italian parsley and half of the Parmigiano-Reggiano cheese; stir until combined.", "Serve pasta topped with the remaining Parmigiano-Reggiano cheese."], "facts": "755 calories; protein 22.9g 46% DV; carbohydrates 87.4g 28% DV; fat 34.5g 53% DV; cholesterol 17.6mg 6% DV; sodium 354.8mg 14% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/", "name": "Shrimp Scampi with Pasta", "summary": "\nWell-rounded seafood and pasta dish. Good with any pasta; angel hair is less filling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2606852.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package linguine pasta", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "2  shallots, finely diced", "2 cloves garlic, minced", "1 pinch red pepper flakes  (Optional)", "1 pound shrimp, peeled and deveined", "1 pinch kosher salt and freshly ground pepper", "½ cup dry white wine", "1  lemon, juiced", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "¼ cup finely chopped fresh parsley leaves", "1 teaspoon extra-virgin olive oil, or to taste"], "direction": ["Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.", "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.", "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve."], "facts": "511 calories; protein 21.9g 44% DV; carbohydrates 57.5g 19% DV; fat 19.4g 30% DV; cholesterol 135.4mg 45% DV; sodium 260mg 10% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/234933/how-to-make-perfect-polenta/", "name": "How to Make Perfect Polenta", "summary": "\nPolenta is nothing more than coarsely ground cornmeal. The classic ratio is 1 part polenta to 4 parts water, but I like to measure the polenta just a little scant of a full cup. I often use chicken broth instead of water. It's a perfect base for any kind of saucy meat or mushroom ragout. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3778721.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "5 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups water", "1 teaspoon fine salt", "1 cup polenta", "3 tablespoons butter, divided", "½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"], "direction": ["Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps.", "Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender.", "Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish."], "facts": "291 calories; protein 9.2g 18% DV; carbohydrates 31g 10% DV; fat 14.7g 23% DV; cholesterol 33.4mg 11% DV; sodium 1186.1mg 47% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/88745/chicken-penne-italiano/", "name": "Chicken Penne Italiano", "summary": "\nAn Italian version of stir-fry, this tasty dish mixes cubed, boneless chicken and penne pasta with red and green peppers, garlic, tomatoes, oregano, and basil for an easy weeknight supper. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F685186.jpg", "meta": [["prep:", "25 mins"], ["cook:", "30 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces dry penne pasta", "1 tablespoon cornstarch", "1 (15 ounce) can chicken broth", "2 tablespoons olive oil", "1 tablespoon garlic, minced", "4  skinless, boneless chicken breast halves - cut into cubes", "1  onion, sliced", "½  green bell pepper, seeded and thinly sliced", "½  red bell pepper, seeded and thinly sliced", "1 (16 ounce) can diced tomatoes", "1 teaspoon dried oregano", "1 teaspoon dried basil", "¼ cup  medium-dry white wine", "½ cup freshly grated Parmesan cheese"], "direction": ["Bring a large pot of lightly salted water to a boil. Add the penne pasta and cook until al dente, 8 to 10 minutes. Drain, and reserve pasta.", "Whisk the cornstarch and chicken broth together in a bowl until smooth. Set aside until needed.", "Heat the olive oil in a skillet over medium heat. Add the garlic and chicken; stir and cook until the chicken is no longer pink and juices run clear, about 10 minutes. Stir in the onion, and green and red peppers; cook until tender, about 5 minutes. Stir in the tomatoes, and simmer for 10 minutes. Pour in the  chicken broth mixture and wine, if desired, and season with oregano and basil. Stir in the cooked pasta, and simmer over medium heat until thoroughly heated through, about 5 minutes. Serve garnished with Parmesan cheese."], "facts": "527 calories; protein 39.3g 79% DV; carbohydrates 56.4g 18% DV; fat 15g 23% DV; cholesterol 80.9mg 27% DV; sodium 926.7mg 37% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/18318/pan-fried-asparagus/", "name": "Pan-Fried Asparagus", "summary": "\nThis garlic asparagus dish is a Northern Italian side dish.  My family loves it!  Even the kids! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F214328.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["additional:", "5 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "2 tablespoons olive oil", "1 teaspoon coarse salt", "¼ teaspoon ground black pepper", "3 cloves garlic, minced", "1 pound fresh asparagus spears, trimmed"], "direction": ["Melt butter in a skillet over medium-high heat. Stir in the olive oil, salt, and pepper. Cook garlic in butter for a minute, but do not brown. Add asparagus, and cook for 10 minutes, turning asparagus to ensure even cooking."], "facts": "188 calories; protein 2.8g 6% DV; carbohydrates 5.2g 2% DV; fat 18.4g 28% DV; cholesterol 30.5mg 10% DV; sodium 524.6mg 21% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/13024/italian-wedding-soup-i/", "name": "Italian Wedding Soup I", "summary": "\nComing from Rhode Island, a very ethnic state, this soup was traditionally served at Italian weddings. Serve with grated Parmesan cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1087470.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ pound extra-lean ground beef", "1  egg, lightly beaten", "2 tablespoons dry bread crumbs", "1 tablespoon grated Parmesan cheese", "½ teaspoon dried basil", "½ teaspoon onion powder", "5 ¾ cups chicken broth", "2 cups thinly sliced escarole", "1 cup uncooked orzo pasta", "⅓ cup finely chopped carrot"], "direction": ["In medium bowl, combine meat, egg, bread crumbs, cheese, basil and onion powder; shape into 3/4 inch balls.", "In large saucepan, heat broth to boiling; stir in escarole, orzo pasta, chopped carrot and meatballs. Return to boil, then reduce heat to medium. Cook at slow boil for 10 minutes, or until pasta is al dente. Stir frequently to prevent sticking."], "facts": "416 calories; protein 27.3g 55% DV; carbohydrates 43.3g 14% DV; fat 14.2g 22% DV; cholesterol 86.8mg 29% DV; sodium 1211mg 48% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/8887/chicken-marsala/", "name": "Chicken Marsala", "summary": "\nA delicious, classic chicken dish -- lightly coated chicken breasts braised with Marsala wine and mushrooms. Easy and ideal for both a quick weeknight entree AND serving to company. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5107151.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup all-purpose flour for coating", "½ teaspoon salt", "¼ teaspoon ground black pepper", "½ teaspoon dried oregano", "4  skinless, boneless chicken breast halves - pounded 1/4 inch thick", "4 tablespoons butter", "4 tablespoons olive oil", "1 cup sliced mushrooms", "½ cup Marsala wine", "¼ cup cooking sherry"], "direction": ["In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.", "In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear."], "facts": "448 calories; protein 28.8g 58% DV; carbohydrates 13.3g 4% DV; fat 26.6g 41% DV; cholesterol 99mg 33% DV; sodium 543mg 22% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/", "name": "Homemade Lasagna", "summary": "\nThis is my mom's special homemade lasagna recipe with made from scratch tomato sauce and delicious, cheesy filling.  I have found none better anywhere.  Serve with a leafy green salad and crusty garlic bread, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581957.jpg", "meta": [["prep:", "1 hr"], ["cook:", "45 mins"], ["total:", "1 hr 45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (16 ounce) package lasagna noodles", "½ pound ground pork", "½ pound lean ground beef", "1 (8 ounce) can tomato sauce", "1 (28 ounce) can crushed tomatoes", "1 tablespoon chopped fresh parsley", "1 clove garlic, crushed", "½ teaspoon dried oregano", "½ cup minced onion", "⅛ teaspoon white sugar", "1 ½ teaspoons dried basil", "1 ½ teaspoons salt", "1 pound small curd cottage cheese", "3  eggs", "¾ cup grated Parmesan cheese", "2 teaspoons salt", "¼ teaspoon ground black pepper", "1 pound shredded mozzarella cheese"], "direction": ["Preheat oven to 375  degrees F (190 degrees C).   Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain and set aside.", "Place pork and beef in a large, deep skillet. Cook over medium high heat until evenly brown.  Stir in tomato sauce, crushed tomatoes, parsley, garlic, oregano, onion, sugar, basil and salt. Simmer over medium-low heat for 30 minutes, stirring occasionally.", "In a large bowl, combine cottage cheese, eggs, Parmesan cheese, parsley, salt and pepper.", "In a 9x13 inch baking dish, place 2 layers of noodles on the bottom of dish; layer 1/2 of the cheese mixture, 1/2 of the mozzarella cheese and 1/2 of the sauce; repeat layers.", "Cover with aluminum foil and bake in preheated oven for 30 to 40 minutes. Remove foil and bake for another 5 to 10 minutes; let stand for 10 minutes before cutting; serve."], "facts": "638 calories; protein 45.7g 91% DV; carbohydrates 54g 17% DV; fat 27.2g 42% DV; cholesterol 160.8mg 54% DV; sodium 2053mg 82% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/143069/super-delicious-zuppa-toscana/", "name": "Super-Delicious Zuppa Toscana", "summary": "\nThis is an oh-so-good recipe. Just the right amount of spice to make you take a cold drink but definitely keep coming back for more! This soup is irresistible! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F23d2c233-8761-4375-8415-64043b233bf0%2Faa86db20-a368-4caf-b263-38e5c3a374d0%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound bulk mild Italian sausage", "1 ¼ teaspoons crushed red pepper flakes", "4 slices bacon, cut into 1/2 inch pieces", "1 large onion, diced", "1 tablespoon minced garlic", "5 (13.75 ounce) cans chicken broth", "6  potatoes, thinly sliced", "1 cup heavy cream", "¼ bunch fresh spinach, tough stems removed"], "direction": ["Cook the Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside.", "Cook the bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in the onions and garlic; cook until onions are soft and translucent, about 5 minutes.", "Pour the chicken broth into the Dutch oven with the bacon and onion mixture; bring to a boil over high heat. Add the potatoes, and boil until fork tender, about 20 minutes. Reduce the heat to medium and stir in the heavy cream and the cooked sausage; heat through. Mix the spinach into the soup just before serving."], "facts": "554 calories; protein 19.8g 40% DV; carbohydrates 45.8g 15% DV; fat 32.6g 50% DV; cholesterol 98.9mg 33% DV; sodium 2386.4mg 96% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/21353/italian-spaghetti-sauce-with-meatballs/", "name": "Italian Spaghetti Sauce with Meatballs", "summary": "\nThis is a recipe I got from my mother years ago --  it's great. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5864844.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound lean ground beef", "1 cup fresh bread crumbs", "1 tablespoon dried parsley", "1 tablespoon grated Parmesan cheese", "¼ teaspoon ground black pepper", "⅛ teaspoon garlic powder", "1  egg, beaten"], "direction": ["In a large bowl, combine ground beef, bread crumbs, parsley, Parmesan, 1/4 teaspoon black pepper, garlic powder and beaten egg.  Mix well and form into 12 balls.  Store, covered, in refrigerator until needed.", "In a large saucepan over medium heat, saute onion and garlic in olive oil until onion is translucent.  Stir in tomatoes, salt, sugar and bay leaf.  Cover, reduce heat to low, and simmer 90 minutes.  Stir in tomato paste, basil, 1/2 teaspoon pepper and meatballs and simmer 30 minutes more.  Serve."], "facts": "347 calories; protein 18.9g 38% DV; carbohydrates 23g 7% DV; fat 21.2g 33% DV; cholesterol 77.4mg 26% DV; sodium 1492.5mg 60% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/", "name": "Homemade Four Cheese Ravioli", "summary": "\nGreat homemade Italian ravioli recipe that I have recreated to taste like the ravioli at Maggiano's restaurant. Don't be intimidated by the large list of ingredients, it is well worth it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5943283.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "20 ravioli"]], "ingredients": ["2 cups all-purpose flour", "1 pinch salt", "1 teaspoon olive oil", "2  eggs", "1 ½ tablespoons water"], "direction": ["Mound the flour and salt together on a work surface and form a well. Beat the teaspoon of olive oil, 2 eggs, and water in a bowl. Pour half the egg mixture into the well. Begin mixing the egg with the flour with one hand; use your other hand to keep the flour mound steady. Add the remaining egg mixture and knead to form a dough.", "Knead the dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form the dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour.", "While the dough is resting, prepare the ravioli filling. Combine the ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley and mix well. Set the filling aside.", "Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the crushed garlic and pesto sauce and cook for one minute. Pour in the heavy cream, raise the heat to high, and bring the sauce to a boil. Reduce the heat and simmer for 5 minutes. Add the Parmesan cheese and stir until the cheese melts. Remove the pan from the heat and keep warm.", "Meanwhile, in a separate saucepan, warm the marinara sauce over medium-low heat.", "Preheat an oven to 375 degrees F (190 degrees C). Beat the egg with the tablespoon of water to make the egg wash.", "Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop the filling mixture on the dough by teaspoonfuls about one inch apart. Cover the filling with the top sheet of pasta, pressing out the air from around each portion of filling. Press firmly around the filling to seal. Cut into individual ravioli with a knife or pizza cutter. Seal the edges.", "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well.", "Grease a baking sheet. Place the cooked ravioli on the sheet pan and bake in the preheated oven until brown, about 4 minutes.", "To serve the ravioli, divide them among four warmed serving bowls. Drizzle the marinara sauce over the ravioli and then top with the cream sauce."], "facts": "1270 calories; protein 37.8g 76% DV; carbohydrates 80.4g 26% DV; fat 89.2g 137% DV; cholesterol 406.5mg 136% DV; sodium 1358.9mg 54% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/12942/italian-sausage-soup/", "name": "Italian Sausage Soup", "summary": "\nA hearty winter favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6285692.jpg", "meta": [["prep:", "10 mins"], ["cook:", "40 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound Italian sausage", "1 clove garlic, minced", "2 (14 ounce) cans beef broth", "1 (14.5 ounce) can Italian-style stewed tomatoes", "1 cup sliced carrots", "1 (14.5 ounce) can great Northern beans, undrained", "2 small zucchini, cubed", "2 cups spinach - packed, rinsed and torn", "¼ teaspoon ground black pepper", "¼ teaspoon salt"], "direction": ["In a stockpot or Dutch oven, brown sausage with garlic.  Stir in  broth, tomatoes and carrots, and season with salt and pepper. Reduce heat, cover, and simmer 15 minutes.", "Stir in beans with liquid and zucchini. Cover, and simmer another 15 minutes, or until zucchini is tender.", "Remove from heat, and add spinach.  Replace lid allowing the heat from the soup to cook the spinach leaves.  Soup is ready to serve after 5 minutes."], "facts": "385 calories; protein 18.8g 38% DV; carbohydrates 22.5g 7% DV; fat 24.4g 38% DV; cholesterol 57.5mg 19% DV; sodium 1258.7mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/219164/the-best-parmesan-chicken-bake/", "name": "The Best Parmesan Chicken Bake", "summary": "\nThis chicken Parmesan is done casserole style (so, no breading or frying!), but still offers up that irresistible combination of tender chicken, crunchy/cheesy coating, and flavorful sauce. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1010419.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons olive oil", "2 cloves garlic, crushed and finely chopped", "¼ teaspoon crushed red pepper flakes, or to taste", "6  skinless, boneless chicken breast halves", "2 cups prepared marinara sauce", "¼ cup chopped fresh basil", "1 (8 ounce) package shredded mozzarella cheese, divided", "½ cup grated Parmesan cheese, divided", "1 (5 ounce) package garlic croutons"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Coat the bottom of a 9x13 inch casserole dish with olive oil, and sprinkle with garlic and hot red pepper flakes.", "Arrange the chicken breasts in bottom of the dish, and pour marinara sauce over chicken. Sprinkle basil over marinara sauce, and top with half the mozzarella cheese, followed by half the Parmesan cheese. Sprinkle on the croutons, then top with the remaining mozzarella cheese and remaining Parmesan cheese.", "Bake in preheated oven until cheese and croutons are golden brown and the chicken is no longer pink inside, about 35 minutes to an hour, depending on the shape and thickness of your chicken breasts. An instant-read thermometer inserted into the thickest part of a chicken breast should read at least 160 degrees F (70 degrees C)."], "facts": "477 calories; protein 40.3g 81% DV; carbohydrates 28g 9% DV; fat 21.7g 33% DV; cholesterol 100.2mg 33% DV; sodium 1022.4mg 41% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/76808/italian-sausage-peppers-and-onions/", "name": "Italian Sausage, Peppers, and Onions", "summary": "\nMy family has been using this very simple and delicious recipe for sausage, peppers, and onions for years and years now. For an extra kick, try using half sweet sausage and half hot sausage! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F480124.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 (4 ounce) links sweet Italian sausage", "2 tablespoons butter", "1  yellow onion, sliced", "½  red onion, sliced", "4 cloves garlic, minced", "1 large red bell pepper, sliced", "1  green bell pepper, sliced", "1 teaspoon dried basil", "1 teaspoon dried oregano", "¼ cup white wine"], "direction": ["Place the sausage in a large skillet over medium heat, and brown on all sides. Remove from skillet, and slice.", "Melt butter in the skillet. Stir in the yellow onion, red onion, and garlic, and cook 2 to 3 minutes. Mix in red bell pepper and green bell pepper. Season with basil, and oregano. Stir in white wine. Continue to cook and stir until peppers and onions are tender.", "Return sausage slices to skillet with the vegetables. Reduce heat to low, cover, and simmer 15 minutes, or until sausage is heated through."], "facts": "461 calories; protein 17.1g 34% DV; carbohydrates 7g 2% DV; fat 39.4g 61% DV; cholesterol 96.1mg 32% DV; sodium 857mg 34% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11959/slow-cooker-lasagna/", "name": "Slow Cooker Lasagna", "summary": "\nThis recipe is so easy, you might think that you are doing something wrong. It is delicious! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3605394.jpg", "meta": [["prep:", "20 mins"], ["cook:", "4 hrs 20 mins"], ["total:", "4 hrs 40 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 pound lean ground beef", "1  onion, chopped", "2 teaspoons minced garlic", "1 (29 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "1 ½ teaspoons salt", "1 teaspoon dried oregano", "1 (12 ounce) package lasagna noodles", "12 ounces cottage cheese", "½ cup grated Parmesan cheese", "16 ounces shredded mozzarella cheese"], "direction": ["In a large skillet over medium heat cook the ground beef, onion, and garlic until brown. Add the tomato sauce, tomato paste, salt, and oregano and stir until well incorporated. Cook until heated through.", "In a large bowl mix together the cottage cheese, grated Parmesan cheese, and shredded mozzarella cheese.", "Spoon a layer of the meat mixture onto the bottom of the slow cooker. Add a double layer of the uncooked lasagna noodles. Break to fit noodles into slow cooker. Top noodles with a portion of the cheese mixture. Repeat the layering of sauce, noodles, and cheese until all the ingredients are used.", "Cover, and cook on LOW setting  for 4 to 6 hours."], "facts": "446 calories; protein 31.2g 62% DV; carbohydrates 35.7g 12% DV; fat 20.3g 31% DV; cholesterol 71.6mg 24% DV; sodium 1420.2mg 57% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/132127/quick-bruschetta-chicken-bake/", "name": "Quick Bruschetta Chicken Bake", "summary": "\nA simple yet creative chicken meal mimics the popular Italian appetizer 'bruschetta' for a delicious entree reminiscent of romantic Italian evenings. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F254365.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds skinless, boneless chicken breast halves - cubed", "1 teaspoon salt", "1 (15 ounce) can diced tomatoes with juice", "½ cup water", "1 tablespoon minced garlic", "1 (6 ounce) box chicken-flavored dry bread stuffing mix", "2 cups shredded mozzarella cheese", "1 tablespoon Italian seasoning"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch glass baking dish with cooking spray.", "Toss the cubed chicken with the salt in a large bowl. Place the chicken in a layer into the bottom of the baking dish. Stir together tomatoes, water, garlic, and stuffing mix in a large bowl; set aside to soften. Sprinkle the cheese on top of the chicken, then sprinkle with the Italian seasoning. Spread the softened stuffing mixture on top.", "Bake uncovered until the chicken cubes have turned white and are no longer pink in the center, about 30 minutes."], "facts": "349 calories; protein 39.2g 79% DV; carbohydrates 25.9g 8% DV; fat 8.5g 13% DV; cholesterol 90.3mg 30% DV; sodium 1257.3mg 50% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/", "name": "Homemade Sweet Italian Sausage (Mild or Hot)", "summary": "\nThis is a very versatile Italian sausage which can be used in many different ways. You can take it from mild to hot and it's very easy to use. There are also different options for type of meat to use, like ground chuck or ground turkey (do not use ground beef). If using ground turkey, you'll have to coat your skillet with a little olive or veggie oil before cooking as it has very little fat and will stick to skillet. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F785124.jpg", "meta": [["prep:", "20 mins"], ["additional:", "12 hrs"], ["total:", "12 hrs 20 mins"], ["Servings:", "12"], ["Yield:", "3 1-pound portions"]], "ingredients": ["3 pounds ground pork", "3 tablespoons red wine vinegar", "1 tablespoon salt", "1 tablespoon freshly cracked black pepper", "1 ¼ tablespoons dried parsley", "1 tablespoon garlic powder", "1 tablespoon onion powder", "1 tablespoon dried basil", "2 teaspoons paprika", "2 teaspoons crushed red pepper flakes, or to taste", "¾ teaspoon ground fennel seed", "¼ teaspoon brown sugar", "⅛ teaspoon dried oregano", "⅛ teaspoon dried thyme"], "direction": ["Place the pork and red wine vinegar in a mixing bowl. Sprinkle with salt, black pepper, parsley, garlic powder, onion powder, basil, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed through the sausage.", "Divide the sausage into thirds, and form into 3 logs; wrap each in plastic wrap. Place wrapped sausage into a freezer bag before freezing, or store in refrigerator for at least 12 hours before cooking."], "facts": "243 calories; protein 20.5g 41% DV; carbohydrates 2.3g 1% DV; fat 16.4g 25% DV; cholesterol 73.6mg 25% DV; sodium 640.3mg 26% DV."}, {"type": "By Cuisine  ", "package": "italian_recipes", "link": "https://www.allrecipes.com/recipe/11920/garlic-butter-sauce-i/", "name": "Garlic Butter Sauce I", "summary": "\nA rich, buttery sauce for pasta with herbs and garlic. Great with grated Parmesan or Romano cheese. Try serving it over your favorite pasta. Easy to double or triple. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1201086.jpg", "meta": [["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["⅓ cup butter", "1 clove crushed garlic", "¼ tablespoon dried basil", "2 teaspoons dried oregano"], "direction": ["In a small saucepan melt butter, add garlic and saute until cooked. Add dried oregano and dried basil and stir until heated through.", "Serve warm."], "facts": "559 calories; protein 1.3g 3% DV; carbohydrates 3.7g 1% DV; fat 61.7g 95% DV; cholesterol 162.7mg 54% DV; sodium 437.2mg 18% DV."}]