[{"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246198/easy-french-toast-waffles/", "name": "Easy French Toast Waffles", "summary": "\nMaking French toast in your waffle iron combines the best of both worlds. You get all the custardy richness of French toast plus waffle's signature crispy ridges. All the better to hold more maple syrup. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3242413.jpg", "meta": [["prep:", "10 mins"], ["cook:", "3 mins"], ["additional:", "2 mins"], ["total:", "15 mins"], ["Servings:", "2"], ["Yield:", "4 slices"]], "ingredients": ["cooking spray", "½ cup whole milk", "2  large eggs", "1 tablespoon maple syrup", "½ teaspoon vanilla extract", "1 pinch salt", "4 pieces 1/2-inch thick pieces brioche"], "direction": ["Preheat a waffle iron according to manufacturer's instructions and spray with cooking spray.", "Whisk milk, eggs, maple syrup, vanilla extract, and salt together in a wide bowl until thoroughly combined. Dip bread slices 1 at a time in the egg mixture, coating both sides completely. Lift bread with a slotted spatula to allow excess egg mixture to drain back into the bowl. Place dipped bread slices on a rimmed baking sheet and let rest until mixture soaks in, about 2 minutes.", "Place dipped bread in the preheated waffle iron. Gently close the lid without forcing it down. Cook according to manufacturer's instructions until golden brown, 3 to 5 minutes. Repeat with remaining slices."], "facts": "671 calories; protein 23.3g 47% DV; carbohydrates 81.3g 26% DV; fat 27.8g 43% DV; cholesterol 335.3mg 112% DV; sodium 799.7mg 32% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246835/barbacoa-style-shredded-beef/", "name": "Barbacoa-Style Shredded Beef", "summary": "\nSimilar to Chipotle's® barbacoa. Great over nachos, in tacos, and burritos. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3514633.jpg", "meta": [["prep:", "25 mins"], ["cook:", "8 hrs 4 mins"], ["additional:", "10 mins"], ["total:", "8 hrs 39 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (3 pound) beef chuck roast, cut into 6 to 8 chunks", "salt and ground black pepper to taste", "2 tablespoons vegetable oil", "½ cup beef broth", "¼ cup apple cider vinegar", "¼ cup fresh lime juice", "4  chipotle peppers in adobo sauce, chopped", "5 cloves garlic, chopped", "1 tablespoon ground cumin", "1 tablespoon dried oregano", "¼ teaspoon ground cloves", "3  bay leaves"], "direction": ["Season beef chunks with salt and pepper on all sides.", "Heat oil in a large skillet over medium-high heat. Add beef in batches; cook until browned, about 1 minute per side. Transfer beef to a slow cooker.", "Combine beef broth, apple cider vinegar, lime juice, chipotle peppers, garlic, cumin, oregano, and cloves in a bowl. Season with salt and pepper and mix well. Pour over beef in the slow cooker. Stir in bay leaves.", "Cook on Low until beef is fork-tender, 8 to 10 hours.", "Discard bay leaves. Remove beef and shred using 2 forks. Return beef to the slow cooker to marinate in the sauce for at least 10 more minutes before serving."], "facts": "303 calories; protein 20.3g 41% DV; carbohydrates 2.6g 1% DV; fat 22.9g 35% DV; cholesterol 77.5mg 26% DV; sodium 150.3mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246787/italian-sausage-stuffed-shells/", "name": "Italian Sausage Stuffed Shells", "summary": "\nBelieve it or not, I'm not a fan of cheese and try to avoid it whenever possible. So dishes that are stuffed with things like ricotta turn me off. I created this dish as a compromise to my cheese avoidance and my husband's love of Italian food. \nServe this with garlic bread and a salad for a wonderful family dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4621239.jpg", "meta": [["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (16 ounce) package jumbo pasta shells", "3 teaspoons vegetable oil, divided", "1 pound bulk Italian sausage", "1 (16 ounce) package finely shredded mozzarella cheese, divided", "1 teaspoon dried Italian seasoning, plus more for garnish if desired", "1 (24 ounce) jar prepared marinara sauce"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 baking dish.", "Bring a large pot of lightly salted water to a boil. Cook shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 to 12 minutes. Drain. Lightly oil a rimmed baking sheet; place drained pasta on baking sheet to cool.", "Heat 2 teaspoons vegetable oil over medium-high heat in a heavy skillet. Cook and crumble sausage until it has lost its pink color and begins to brown. Remove from heat; drain off grease.", "Stir half of the shredded cheese and the Italian seasoning into the browned sausage. Spoon mixture into the pasta shells (1 to 2 tablespoons per shell). Arrange stuffed shells in prepared baking dish. Pour marinara sauce evenly over the shells. Top with remaining shredded cheese. Cover tightly with aluminum foil.", "Bake in preheated oven until heated through and bubbly, about 30 minutes. Remove foil; bake until browned, 5 to 10 more minutes. Sprinkle with a pinch of Italian seasoning, if desired."], "facts": "578 calories; protein 30.2g 60% DV; carbohydrates 57.3g 19% DV; fat 24.6g 38% DV; cholesterol 60.3mg 20% DV; sodium 1171.4mg 47% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246569/roasted-potatoes-with-bacon-cheese-and-parsley/", "name": "Roasted Potatoes with Bacon, Cheese, and Parsley", "summary": "\nThese potatoes are hard to resist with their crispy roasted outsides and creamy delicious insides. I learned to shake the boiled potatoes before baking from an English caterer. Try it! It makes a difference. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3374993.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 7 mins"], ["additional:", "10 mins"], ["total:", "1 hr 47 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes", "1 tablespoon salt", "6 slices bacon, halved and cut crosswise into 1/2-inch pieces", "2 tablespoons olive oil", "salt and freshly ground black pepper to taste", "½ cup grated Parmigiano-Reggiano cheese", "2 cloves garlic, finely chopped", "¼ cup fresh Italian flat-leaf parsley"], "direction": ["Place an oven rack in the bottom third of the oven and preheat oven to 450 degrees F (230 degrees C).", "Place potatoes in a large pot and cover with cold water and salt. Bring to a boil; reduce heat to medium and simmer until potatoes are just tender when pierced with a fork, about 12 minutes. Drain.", "Return potatoes to the pot; cover with a lid and shake pot vigorously, about 1 minute. Uncover and cool potatoes until easily handled, about 10 minutes. Peel potatoes and cut them crosswise into chunks.", "Place bacon in a skillet and cook over medium-high heat, turning occasionally, until most of the fat has melted and bacon is tender, 5 to 7 minutes. Drain bacon slices on paper towels, reserving bacon fat in the skillet.", "Brush the bottom of a shallow 10x15-inch baking pan with half of the bacon fat and olive oil. Sprinkle salt and pepper over potatoes and arrange in the baking pan.", "Roast potatoes in the preheated oven until golden brown on the bottom, about 30 minutes. Remove potatoes from oven and reduce oven temperature to 375 degrees F (190 degrees C).", "Turn potatoes over in baking pan. Top with bacon pieces, Parmigiano-Reggiano cheese, and garlic. Drizzle remaining bacon fat on top.", "Return to the preheated oven and continue roasting until Parmigiano-Reggiano cheese is melted, about 15 minutes. Sprinkle with parsley and serve."], "facts": "222 calories; protein 8g 16% DV; carbohydrates 30.4g 10% DV; fat 7.8g 12% DV; cholesterol 12mg 4% DV; sodium 1138.2mg 46% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/257882/oatmeal-cream-pies-with-chocolate/", "name": "Oatmeal Cream Pies with Chocolate", "summary": "\nHomemade oatmeal cream pies. Mmmm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4507606.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 2 mins"], ["total:", "1 hr 42 mins"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["¾ cup butter, softened", "¾ cup light brown sugar", "½ cup white sugar", "1  egg", "1 tablespoon whole milk", "1 teaspoon vanilla extract", "1 ½ cups quick-cooking oats", "¾ cup all-purpose flour", "2 tablespoons cocoa powder, sifted", "1 teaspoon ground cinnamon", "½ teaspoon baking soda", "½ teaspoon baking powder", "½ teaspoon kosher salt", "½ cup mini chocolate chips"], "direction": ["Combine butter, brown sugar, and white sugar in a large bowl; beat with an electric mixer until smooth creamy, 3 to 5 minutes. Beat in egg, 1 tablespoon milk, and 1 teaspoon vanilla extract.", "Mix oats, flour, cocoa powder, cinnamon, baking soda, baking powder, and salt together in a separate bowl. Beat into the creamed butter mixture on low speed. Fold in chocolate chips using a rubber spatula.", "Cover bowl with plastic wrap and refrigerate dough until firm enough to scoop, at least 1 hour.", "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.", "Scoop small balls of dough onto the lined baking sheets using a small cookie scoop.", "Bake in the preheated oven until golden, about 10 minutes. Let cookies sit on the baking sheets for 2 minutes. Transfer to a wire rack to cool completely.", "Combine cream cheese and vegetable shortening in a bowl; beat with an electric mixer until smooth. Add marshmallow cream, 2 teaspoons milk, and 1/2 teaspoon vanilla extract; mix well. Beat in confectioners' sugar, 1/4 cup at a time, until filling reaches a thick consistency.", "Scoop some of the filling onto the flat side of 1 cookie using the cookie scoop. Press another cookie on top to sandwich the filling. Repeat with remaining cookies and filling."], "facts": "258 calories; protein 2g 4% DV; carbohydrates 33.9g 11% DV; fat 13.4g 21% DV; cholesterol 28.2mg 9% DV; sodium 140.6mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/257268/bunny-pretzels/", "name": "Bunny Pretzels", "summary": "\nA quick and easy way to make homemade pretzels. They can be brushed with butter or dipped in cinnamon sugar, just like they do at the mall. This is a treat I like to make for our Easter egg hunt. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4478032.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["total:", "45 mins"], ["Servings:", "12"], ["Yield:", "12 pretzels"]], "ingredients": ["cooking spray", "4 cups water", "¼ cup baking soda", "1 (11 ounce) package refrigerated French bread dough (such as Pillsbury®)", "1  egg yolk", "1 tablespoon water", "1 tablespoon coarse sea salt", "2 tablespoons butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet with cooking spray.", "Mix 4 cups water and baking soda together in a large saucepan; bring to a boil. Pour into a shallow dish.", "Flatten bread dough on a floured work surface; cut into 3 pieces, each about 6 inches long. Slice each piece into 4 long strips. Break a 1-inch piece off each strip; roll into a ball for the tail. Roll the remainder of each strip into a log about 9 inches long.", "Wrap 1 log around the tail to make the body; twist twice to make the head and ears. Repeat with remaining 11 strips.", "Submerge \"bunnies,\" 2 at a time, into the water-baking soda mixture for 30 seconds. Transfer to the prepared baking sheet. Adjust ears if they became untwisted.", "Whisk egg yolk and 1 tablespoon water together in a small bowl. Brush over bunnies. Sprinkle salt on top.", "Bake in the preheated oven until warmed through, about 5 minutes. Move around with a spatula to ensure they don't stick. Continue baking until golden brown, about 10 minutes. Transfer to cooling racks. Brush with melted butter while still warm."], "facts": "85 calories; protein 2.3g 5% DV; carbohydrates 11.4g 4% DV; fat 3.1g 5% DV; cholesterol 22.2mg 7% DV; sodium 1864.4mg 75% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/256625/grilled-lime-cilantro-chicken-with-sweet-chili-sauce/", "name": "Grilled Lime Cilantro Chicken with Sweet Chili Sauce", "summary": "\nPerfectly grilled tender and juicy chicken marinated in a lime cilantro marinade with soy sauce and topped with sweet chili sauce. Marinate the chicken the night before or the morning-of and you'll be ready for dinner in no time. This recipe was made in a Panasonic CIO. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4427327.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 mins"], ["additional:", "3 hrs"], ["total:", "3 hrs 27 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 (8 ounce) skinless, boneless chicken breasts", "¼ cup minced fresh cilantro", "2 tablespoons lime juice", "1 tablespoon low-sodium soy sauce", "1 tablespoon olive oil", "2 cloves garlic, minced", "¼ cup sweet chili sauce", "1 teaspoon minced fresh cilantro"], "direction": ["Place chicken in a resealable plastic bag. Combine 1/4 cup cilantro, lime juice, soy sauce, olive oil, and garlic in a small bowl. Pour over chicken and seal the bag. Let marinate in the refrigerator, 3 hours to overnight.", "Preheat Panasonic® Countertop Induction Oven to Medium on the \"Grill\" setting.", "Place chicken on the grill pan. Grill chicken for 6 to 7 minutes per side or until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C).", "Brush chicken with sweet chili sauce. Garnish with 1 teaspoon cilantro."], "facts": "353 calories; protein 44.8g 90% DV; carbohydrates 16.1g 5% DV; fat 11.6g 18% DV; cholesterol 117mg 39% DV; sodium 702.3mg 28% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/254495/herb-n-honey-cucumber-tomato-salad/", "name": "Herb 'n Honey Cucumber Tomato Salad", "summary": "\nCrisp and sweetly delicious, this salad is a wonderful addition to any summer picnic. May serve immediately or cover and refrigerate up to four hours before serving for enhanced flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3774683.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3  cucumbers, peeled and sliced", "2 large ripe tomatoes, sliced", "2  green onions, sliced thin", "8 leaves fresh basil, chopped", "½ cup crumbled feta cheese", "½ cup seasoned rice wine vinegar", "½ cup honey"], "direction": ["Layer cucumbers, tomatoes, green onions, and basil in a bowl; top with feta cheese. Drizzle rice wine vinegar over the surface; top with honey."], "facts": "167 calories; protein 3.2g 6% DV; carbohydrates 35.5g 12% DV; fat 2.9g 5% DV; cholesterol 11.1mg 4% DV; sodium 333.2mg 13% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/222037/tatertot-casserole/", "name": "Tatertot Casserole", "summary": "\nQuick and easy casserole everyone will love. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4482008.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1 pinch salt and ground black pepper to taste", "1 (10.75 ounce) can  condensed cream of mushroom soup", "2 cups shredded Cheddar cheese", "1 (16 ounce) package frozen tater tots"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cook and stir ground beef in a large skillet over medium heat until no longer pink and completely browned, 7 to 10 minutes; season with salt and black pepper. Stir cream of mushroom soup into the cooked ground beef; pour the mixture into a 9x13-inch baking dish. Layer tater tots evenly over the ground beef mixture; top with Cheddar cheese.", "Bake until tater tots are golden brown and hot, 30 to 45 minutes."], "facts": "345 calories; protein 18.5g 37% DV; carbohydrates 16.9g 6% DV; fat 23.8g 37% DV; cholesterol 65.1mg 22% DV; sodium 700.2mg 28% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/17481/simple-white-cake/", "name": "Simple White Cake", "summary": "\nThis cake was sent home from our children's school. It is the simplest, great tasting cake I've ever made. Great to make with the kids, especially for cupcakes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1437162.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes or 1- 9x9 inch pan"]], "ingredients": ["1 cup white sugar", "½ cup butter", "2  eggs", "2 teaspoons vanilla extract", "1 ½ cups all-purpose flour", "1 ¾ teaspoons baking powder", "½ cup milk"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan or line a muffin pan with paper liners.", "In a medium bowl, cream together the sugar and butter. Beat in the eggs, one at a time, then stir in the vanilla. Combine flour and baking powder, add to the creamed mixture and mix well. Finally stir in the milk until batter is smooth. Pour or spoon batter into the prepared pan.", "Bake for 30 to 40 minutes in the preheated oven. For cupcakes, bake 20 to 25 minutes. Cake is done when it springs back to the touch."], "facts": "209 calories; protein 3.1g 6% DV; carbohydrates 29.4g 10% DV; fat 8.9g 14% DV; cholesterol 52.1mg 17% DV; sodium 141.8mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/244638/no-yeast-pizza-crust/", "name": "No-Yeast Pizza Crust", "summary": "\nA tasty, quick pizza crust that uses no yeast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548649.jpg", "meta": [["prep:", "15 mins"], ["additional:", "10 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza"]], "ingredients": ["1 ⅓ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup fat-free milk", "2 tablespoons olive oil"], "direction": ["Mix flour, baking powder, and salt together in a bowl; stir in milk and olive oil until a soft dough forms. Turn dough onto a lightly floured surface and knead 10 times. Shape dough into a ball. Cover dough with an inverted bowl and let sit for 10 minutes.", "Roll dough into a 12-inch circle on a baking sheet."], "facts": "112 calories; protein 2.8g 6% DV; carbohydrates 16.9g 6% DV; fat 3.6g 6% DV; cholesterol 0.3mg; sodium 215.8mg 9% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/235589/chef-johns-creamy-mushroom-soup/", "name": "Chef John's Creamy Mushroom Soup", "summary": "\nThis is one of my favorite soups of all time. It is so easy. The secret to this deep, rich soup is a long slow caramelization, the key to unlocking the mushroom's magic. This is just pure essence of mushroom. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1072703.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¼ cup unsalted butter", "2 pounds sliced fresh mushrooms", "1 pinch salt", "1  yellow onion, diced", "1 ½ tablespoons all-purpose flour", "6 sprigs fresh thyme", "2 cloves garlic, peeled", "4 cups chicken broth", "1 cup water", "1 cup heavy whipping cream", "1 pinch salt and freshly ground black pepper to taste", "1 teaspoon fresh thyme leaves for garnish, or to taste"], "direction": ["Melt butter in a large soup pot over medium-high heat; cook mushrooms in butter with 1 pinch salt until the mushrooms give off their juices; reduce heat to low. Continue to cook, stirring often, until juices evaporate and the mushrooms are golden brown, about 15 minutes. Set aside a few attractive mushroom slices for garnish later, if desired. Mix onion into mushrooms and cook until onion is soft and translucent, about 5 more minutes.", "Stir flour into mushroom mixture and cook, stirring often, for 2 minutes to remove raw flour taste. Tie thyme sprigs into a small bundle with kitchen twine and add to mushroom mixture; add garlic cloves. Pour chicken stock and water into mushroom mixture. Bring to a simmer and cook for 1 hour. Remove thyme bundle.", "Transfer soup to a blender in small batches and puree on high speed until smooth and thick.", "Return soup to pot and stir in cream. Season with salt and black pepper and serve in bowls, garnished with reserved mushroom slices and a few thyme leaves."], "facts": "272 calories; protein 6.9g 14% DV; carbohydrates 12.2g 4% DV; fat 23.3g 36% DV; cholesterol 78mg 26% DV; sodium 666.6mg 27% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/36925/garlic-butter/", "name": "Garlic Butter", "summary": "\nSometimes the basics are the best!  I've used this simple recipe for years to make garlic bread, and any leftovers go great on barbequed steaks, pasta, rice or potatoes. You can use any butter or margarine you like. Also, fresh or minced garlic in a jar works well. Adjust the amount of garlic to your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5221403.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "16"], ["Yield:", "1 cup"]], "ingredients": ["1 cup butter, softened", "1 tablespoon minced garlic", "¼ cup grated Parmesan cheese", "1 tablespoon garlic salt", "1 teaspoon Italian seasoning", "½ teaspoon ground black pepper", "¼ teaspoon ground paprika"], "direction": ["In a small bowl, combine softened butter, minced garlic and parmesan cheese. Season with garlic salt, Italian seasoning, pepper and paprika. Mix until smooth."], "facts": "110 calories; protein 0.8g 2% DV; carbohydrates 0.5g; fat 12g 18% DV; cholesterol 31.9mg 11% DV; sodium 445.5mg 18% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/219646/authentic-mexican-chili-rellenos/", "name": "Authentic Mexican Chili Rellenos", "summary": "\nThis is an authentic Mexican recipe that has been handed down for generations in my family. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5362039.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  fresh Anaheim chile peppers", "1 (8 ounce) package queso asadero (white Mexican cheese), cut into 3/4-inch thick strips", "2  eggs, separated", "1 teaspoon baking powder", "¾ cup all-purpose flour", "1 cup vegetable shortening for frying"], "direction": ["Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Place peppers onto the prepared baking sheet, and cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 10 minutes. Turn the peppers often to blacken all sides. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 15 minutes.", "Rinse cooled peppers under cold water to peel off the skins, and cut a slit along the long side of each pepper to remove the seeds and core. Rinse the peppers inside and out, and pat dry with paper towels. Stuff the peppers with strips of the cheese.", "Whisk the egg yolks in a bowl with the baking powder. In a second metal bowl, beat the egg whites with an electric mixer until the whites form stiff peaks. Gently fold the beaten egg whites into the yolk mixture. Place flour into a shallow bowl.", "Heat the vegetable shortening in a skillet over medium heat. Roll each stuffed pepper in flour, tap off excess flour, and dip the peppers into the egg mixture to coat both sides. Gently lay the coated peppers into the hot shortening. Fry peppers until lightly golden brown and the cheese has melted, about 5 minutes per side."], "facts": "263 calories; protein 13.1g 26% DV; carbohydrates 17.3g 6% DV; fat 16g 25% DV; cholesterol 101.7mg 34% DV; sodium 356.6mg 14% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/32385/best-lemonade-ever/", "name": "Best Lemonade Ever", "summary": "\nThis is a very refreshing drink! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2503282.jpg", "meta": [["prep:", "30 mins"], ["cook:", "5 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 35 mins"], ["Servings:", "10"], ["Yield:", "10 (8 ounce) servings"]], "ingredients": ["1 ¾ cups white sugar", "8 cups water", "1 ½ cups lemon juice"], "direction": ["In a small saucepan, combine sugar and 1 cup water.  Bring to boil and stir to dissolve sugar. Allow to cool to room temperature, then cover and refrigerate until chilled.", "Remove seeds from lemon juice, but leave pulp. In pitcher, stir together chilled syrup, lemon juice and remaining 7 cups water."], "facts": "145 calories; protein 0.1g; carbohydrates 38.2g 12% DV; fat 0g; cholesterol 0mg; sodium 6.1mg."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/241925/super-easy-egg-casserole/", "name": "Super Easy Egg Casserole", "summary": "\nAnother husband-approved recipe. Made a couple times recently because of how easy it is to make! This recipe is easy to double or triple, but you may have to cook a bit longer if doing so. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2195255.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup shredded Cheddar cheese", "6  eggs, whisked", "6 slices bacon, diced", "2 slices bread, cubed", "⅓  red bell pepper, diced", "2  green onions, chopped", "3 tablespoons milk", "½ teaspoon minced garlic, or to taste  (Optional)", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.", "Stir Cheddar cheese, eggs, bacon, bread, red bell pepper, green onion, milk, garlic, salt, and black pepper together in a bowl until well-combined; pour into prepared baking dish.", "Bake in the preheated oven until eggs are set, 20 to 25 minutes."], "facts": "340 calories; protein 23.2g 46% DV; carbohydrates 9.3g 3% DV; fat 23.2g 36% DV; cholesterol 324.7mg 108% DV; sodium 728.3mg 29% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/20680/easy-mexican-casserole/", "name": "Easy Mexican Casserole", "summary": "\nThis is an easy and very tasty dish. I often substitute ground turkey and low fat dairy products and it is still delicious! Serve with chips, salsa and green salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5670908.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound lean ground beef", "2 cups salsa", "1 (16 ounce) can chili beans, drained", "3 cups tortilla chips, crushed", "2 cups sour cream", "1 (2 ounce) can sliced black olives, drained", "½ cup chopped green onion", "½ cup chopped fresh tomato", "2 cups shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large skillet over medium-high heat, cook ground beef until no longer pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until liquid is absorbed. Stir in beans, and heat through.", "Spray a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in dish, and then spoon beef mixture over chips. Spread sour cream over beef, and sprinkle olives, green onion, and tomato over the sour cream. Top with Cheddar cheese.", "Bake in preheated oven for 30 minutes, or until hot and bubbly."], "facts": "632 calories; protein 31.7g 63% DV; carbohydrates 32.8g 11% DV; fat 43.7g 67% DV; cholesterol 119.2mg 40% DV; sodium 1308.3mg 52% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/279593/slow-cooker-pineapple-teriyaki-pork-chops/", "name": "Slow Cooker Pineapple-Teriyaki Pork Chops", "summary": "\nThese teriyaki-pineapple pork chops are so delicious you might want to double this recipe. Serve with fresh raw or grilled pineapple slices. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8026172.jpg", "meta": [["prep:", "5 mins"], ["cook:", "4 hrs 5 mins"], ["total:", "4 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 pork chops"]], "ingredients": ["1 tablespoon olive oil, or more as needed", "4 (8 ounce) bone-in pork loin chops", "1 cup unsweetened pineapple juice", "½ cup teriyaki sauce", "1 teaspoon dried crushed rosemary", "1 teaspoon garlic powder", "½ teaspoon salt", "¼ teaspoon ground black pepper"], "direction": ["Heat oil in a skillet over medium-high heat. Add pork chops and brown for about 3 minutes. Transfer chops to a slow cooker.", "Combine pineapple juice, teriyaki sauce, rosemary, garlic powder, salt, and pepper in a bowl. Pour over pork chops.", "Cover and cook on Low, 4 to 5 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C)."], "facts": "283 calories; protein 28g 56% DV; carbohydrates 14.4g 5% DV; fat 11.8g 18% DV; cholesterol 65.3mg 22% DV; sodium 1728.7mg 69% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/216950/roasted-cauliflower-soup/", "name": "Roasted Cauliflower Soup", "summary": "\nThis is simple and delicious. The taste is so smooth and creamy most people think this is a fattening soup loaded with cream and potatoes. People are always shocked by how few ingredients are needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012540.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads   cauliflower, broken into florets", "olive oil cooking spray", "¼ cup olive oil", "1 large onion, chopped", "4 cloves garlic, chopped", "6 cups water", "salt and ground black pepper to taste"], "direction": ["Place the cauliflower florets into a large bowl of lightly salted water; allow to stand for 20 minutes. Drain well, and arrange on a sheet of heavy aluminum foil on a baking sheet. Spray the olive oil cooking spray evenly on the cauliflower.", "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.", "Broil the cauliflower until browned, 20 to 30 minutes.", "Meanwhile, heat olive oil in a large soup pot, and cook the onion until translucent, about 5 minutes; stir in the garlic and roasted cauliflower. Pour in the water, season with salt and black pepper, and simmer until all the vegetables are tender, about 30 minutes. Blend the soup in the pot with an immersion hand blender until creamy and smooth."], "facts": "141 calories; protein 4.2g 8% DV; carbohydrates 13.2g 4% DV; fat 9.2g 14% DV; cholesterol 0mg; sodium 92.6mg 4% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/228319/perfect-ten-baked-cod/", "name": "Perfect Ten Baked Cod", "summary": "\nSimple, fast, and delicious describes this baked cod recipe. Bake for two sets of 10 minutes each and you have the perfect ten dinner! This recipe was a favorite request from a local restaurant. They closed after years in business and we are happy to share a version of their most requested recipe. I serve this with rice pilaf and fresh spinach that has been lightly seared in olive oil and garlic. Yummy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4523973.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons butter", "½ sleeve buttery round crackers (such as Ritz®), crushed", "2 tablespoons butter", "1 pound thick-cut cod loin", "½  lemon, juiced", "¼ cup dry white wine", "1 tablespoon chopped fresh parsley", "1 tablespoon chopped green onion", "1  lemon, cut into wedges"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Place 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.", "Place remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.", "Coat both sides of cod in melted butter in the baking dish.", "Bake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.", "Garnish baked cod with parsley and green onion. Serve with lemon wedges."], "facts": "280 calories; protein 20.9g 42% DV; carbohydrates 9.3g 3% DV; fat 16.1g 25% DV; cholesterol 71.5mg 24% DV; sodium 282.3mg 11% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/", "name": "Broccoli, Rice, Cheese, and Chicken Casserole", "summary": "\nThis is a delicious twist to broccoli, rice, and cheese casserole, and is VERY easy to make. You can also cut this in half. I use the 1 can cream of mushroom soup when I make half.  You can also leave out the onion. It just gives it a little added flavor, but is still very good without it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3878110.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups water", "2 cups uncooked instant rice", "2 (10 ounce) cans chunk chicken, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (10.75 ounce) can  condensed cream of chicken soup", "¼ cup butter", "1 cup milk", "1 (16 ounce) package frozen chopped broccoli", "1 small white onion, chopped", "1 pound processed cheese food"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium saucepan, bring the water to a boil. Mix in the instant rice, cover, and remove from heat. Let stand 5 minutes.", "In a 9x13 inch baking dish, mix the prepared rice, chicken, cream of mushroom soup, cream of chicken soup, butter, milk, broccoli, onion, and processed cheese.", "Bake in the preheated oven for 30 to 35 minutes, or until cheese is melted. Stir halfway through cooking to help cheese melt evenly."], "facts": "756 calories; protein 36g 72% DV; carbohydrates 82.7g 27% DV; fat 30.8g 47% DV; cholesterol 109.5mg 37% DV; sodium 1642.3mg 66% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/222795/superb-sauteed-mushrooms/", "name": "Superb Sauteed Mushrooms", "summary": "\nThese mushrooms are the quintessential topping for all types of steak. Also excellent over baked potatoes. I have people calling me and asking me for the recipe even years after I have made them for them. They are that good!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6051829.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons olive oil", "3 tablespoons butter", "1 pound button mushrooms, sliced", "1 clove garlic, thinly sliced", "1 tablespoon red cooking wine", "1 tablespoon teriyaki sauce, or more to taste", "¼ teaspoon garlic salt, or to taste", "freshly ground black pepper to taste"], "direction": ["Heat olive oil and butter in a large saucepan over medium heat. Cook and stir mushrooms, garlic, cooking wine, teriyaki sauce, garlic salt, and black pepper in the hot oil and butter until mushrooms are lightly browned, about 5 minutes. Reduce heat to low and simmer until mushrooms are tender, 5 to 8 more minutes."], "facts": "199 calories; protein 3.9g 8% DV; carbohydrates 5.3g 2% DV; fat 19.2g 30% DV; cholesterol 22.9mg 8% DV; sodium 375.7mg 15% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/", "name": "Italian Baked Meatballs", "summary": "\nThis recipe makes the most tender and tasty meatballs. I also freeze these meatballs and take out how many servings I need for each meal. If cooking in sauce, add baked meatballs 20 minutes before serving time. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5834922.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "30 1-ounce meatballs"]], "ingredients": ["1 cup Italian-seasoned bread crumbs", "¼ cup grated Romano cheese", "2 tablespoons chopped fresh parsley", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ teaspoon garlic powder", "½ teaspoon onion powder", "½ cup water", "2  eggs", "1 ½ pounds ground beef"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together. Combine with water and eggs. Add ground beef and mix well. Roll mixture into balls and place on a nonstick baking sheet.", "Bake in the preheated oven until browned, about 30 minutes."], "facts": "343 calories; protein 24.4g 49% DV; carbohydrates 14.1g 5% DV; fat 20.4g 31% DV; cholesterol 135.2mg 45% DV; sodium 611.7mg 25% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/216758/moms-fabulous-chicken-pot-pie-with-biscuit-crust/", "name": "Mom's Fabulous Chicken Pot Pie with Biscuit Crust", "summary": "\nLeftover chicken or rotisserie chicken from the supermarket helps on the ease of preparation of this fabulous comfort style dinner. Fresh vegetables gives this a very special added flavor and is worth the effort. Everyone loves Mom's Chicken Pot Pie! Serve with a green salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6660391.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "1 pot pie"]], "ingredients": ["¼ cup butter", "1 small onion, chopped", "3  celery ribs, chopped", "3  carrots, chopped", "⅔ cup frozen peas", "3 tablespoons chopped fresh parsley", "¼ teaspoon dried thyme", "¼ cup all-purpose flour", "2 cups lower-sodium chicken broth", "⅔ cup half-and-half cream", "salt and ground black pepper to taste", "3 cups cooked chicken, cut into bite-size pieces", "1 (16.3 ounce) can refrigerated flaky-style biscuits (such as Pillsbury Grands®)", "1  egg yolk, beaten", "1 tablespoon water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Melt butter in a skillet over medium-low heat, and cook the onion, celery, and carrots until the celery and carrots are tender, about 15 minutes, stirring occasionally. Stir in peas, parsley, thyme and flour, and cook, stirring constantly, until the flour coats the vegetables and begins to fry, about 5 minutes. Whisk in chicken broth and half-and-half, and cook until the sauce is thick and bubbling. Season to taste with salt and black pepper, and mix in the chicken meat.", "Transfer the chicken, vegetables, and sauce into a 2-quart baking dish. Arrange biscuits on top of the filling. In a small bowl, beat egg yolk with water; brush egg yolk on the biscuits.", "Bake in the preheated oven until the biscuits are golden brown and the pie filling is bubbling, 20 to 25 minutes. Let rest 10 minutes before serving."], "facts": "577 calories; protein 27.1g 54% DV; carbohydrates 44.7g 14% DV; fat 31.2g 48% DV; cholesterol 120.4mg 40% DV; sodium 1026.1mg 41% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/", "name": "Quick Beef Stir-Fry", "summary": "\nQuick and easy. I make this on my busiest weeknights. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6263320.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 pound beef sirloin, cut into 2-inch strips", "1 ½ cups fresh broccoli florets", "1  red bell pepper, cut into matchsticks", "2  carrots, thinly sliced", "1  green onion, chopped", "1 teaspoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons sesame seeds, toasted"], "direction": ["Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.", "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes."], "facts": "268 calories; protein 22.6g 45% DV; carbohydrates 9.1g 3% DV; fat 15.8g 24% DV; cholesterol 48.9mg 16% DV; sodium 526.2mg 21% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/23891/grilled-cheese-sandwich/", "name": "Grilled Cheese Sandwich", "summary": "\nBread, butter and Cheddar cheese - here's a way to make this classic sandwich in a nonstick pan. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2206436.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["4 slices white bread", "3 tablespoons butter, divided", "2 slices Cheddar cheese"], "direction": ["Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese."], "facts": "400 calories; protein 11.1g 22% DV; carbohydrates 25.7g 8% DV; fat 28.3g 44% DV; cholesterol 75.6mg 25% DV; sodium 639.2mg 26% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/272858/air-fryer-chicken-thighs/", "name": "Air Fryer Chicken Thighs", "summary": "\nTasty, quick, chicken thighs, with juicy meat and a crispy skin; you will love this chicken that is ready for the table in less than 30 minutes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F272858.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skin-on, boneless chicken thighs", "2 teaspoons extra-virgin olive oil", "1 teaspoon smoked paprika", "¾ teaspoon garlic powder", "½ teaspoon salt", "½ teaspoon ground black pepper"], "direction": ["Preheat an air fryer to 400 degrees F (200 degrees C).", "Pat chicken thighs dry with a paper towel and brush the skin-side of each piece with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate.", "Combine smoked paprika, garlic powder, salt, and pepper in a bowl and sprinkle half the seasoning mixture evenly over the 4 chicken thighs. Turn thighs over and evenly sprinkle remaining seasoning mixture on top. Place chicken thighs in the air fryer basket in a single layer, skin-side up.", "Fry in the preheated air fryer until chicken is brown and juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."], "facts": "213 calories; protein 19.3g 39% DV; carbohydrates 0.9g; fat 14.2g 22% DV; cholesterol 70.9mg 24% DV; sodium 355.2mg 14% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/", "name": "Black Pepper Beef and Cabbage Stir Fry", "summary": "\nA very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8279013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "4 cloves garlic, chopped", "½ pound ground beef", "½ small head cabbage, shredded", "1  red bell pepper, cut into strips", "2 tablespoons soy sauce", "1 teaspoon cornstarch", "½ cup cold water", "1 teaspoon ground black pepper, or to taste", "1 pinch salt, to taste"], "direction": ["Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.", "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened."], "facts": "280 calories; protein 11.6g 23% DV; carbohydrates 9.5g 3% DV; fat 22.1g 34% DV; cholesterol 48.2mg 16% DV; sodium 547.3mg 22% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/244614/3-ingredient-peanut-butter-cookies/", "name": "3-Ingredient Peanut Butter Cookies", "summary": "\nThis is one of my favorite cookies to make. They are the only peanut butter cookies my family will eat! Sprinkle a pinch of sugar on cookies before baking, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2444026.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "2 mins"], ["total:", "22 mins"], ["Servings:", "24"], ["Yield:", "2 dozen cookies"]], "ingredients": ["1 cup peanut butter", "1 cup white sugar", "1  egg"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Mix peanut butter, sugar, and egg together in a bowl using an electric mixer until smooth and creamy. Roll mixture into small balls and arrange on a baking sheet; flatten each with a fork, making a criss-cross pattern.", "Bake in the preheated oven for 10 minutes. Cool cookies on the baking sheet for 2 minutes before moving to a plate."], "facts": "98 calories; protein 3g 6% DV; carbohydrates 10.5g 3% DV; fat 5.6g 9% DV; cholesterol 7.8mg 3% DV; sodium 52.3mg 2% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/223597/old-fashioned-potato-cakes/", "name": "Old Fashioned Potato Cakes", "summary": "\nThese potato cakes are great with any meal or as a snack. Simple and quick to make with only a few ingredients. Kids of ALL ages love 'em. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F874657.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 cups mashed potatoes", "1 cup all-purpose flour", "1  onion, diced", "1  egg", "½ teaspoon ground black pepper", "½ teaspoon salt", "½ cup vegetable oil, or as needed"], "direction": ["Mix mashed potatoes, flour, onion, egg, black pepper, and salt together in a bowl until batter consistency.", "Heat vegetable oil in a skillet over medium heat. Drop 4-inch circles of batter into hot oil. Cook until golden brown, about 5 minutes per side. Remove with a slotted spoon and drain on paper towels. Repeat with remaining batter."], "facts": "255 calories; protein 7.1g 14% DV; carbohydrates 45.1g 15% DV; fat 4.9g 8% DV; cholesterol 48.6mg 16% DV; sodium 627.1mg 25% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/260637/creepy-halloween-eyeballs/", "name": "Creepy Halloween Eyeballs", "summary": "\nIf you are looking for creepy Halloween food ideas, try these scary-looking eyeballs that actually taste delicious. You can use them as a cocktail garnish or serve in a bowl as a creepy snack for your kids. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565167.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "20"], ["Yield:", "20 eyeballs"]], "ingredients": ["¼ cup strawberry jam", "1 (11 ounce) can lychees, drained", "½ (6 ounce) container fresh blueberries", "toothpicks"], "direction": ["Spoon a little bit of strawberry jam into the hole of each lychee. Place a blueberry in the hole and secure blueberry with a toothpick."], "facts": "24 calories; protein 0.1g; carbohydrates 6.2g 2% DV; fat 0g; cholesterol 0mg; sodium 0.4mg."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/258468/beef-stroganoff-for-instant-pot/", "name": "Beef Stroganoff for Instant Pot®", "summary": "\nA truly one-pot meal! Fork-tender beef and mushrooms with egg noodles. This recipe is written using the Instant Pot®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6472891.jpg", "meta": [["prep:", "20 mins"], ["cook:", "37 mins"], ["additional:", "5 mins"], ["total:", "1 hr 2 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons canola oil", "½  onion, diced", "2 teaspoons salt, divided", "2 pounds beef stew meat, cut into 1-inch cubes", "1 teaspoon freshly ground black pepper", "3 cloves garlic, minced", "½ teaspoon dried thyme", "2 tablespoons soy sauce", "3 cups chopped mushrooms", "2 tablespoons all-purpose flour", "3 cups chicken broth", "1 (16 ounce) package wide egg noodles", "¾ cup sour cream, or to taste"], "direction": ["Turn on a multi-cooker (such as Instant Pot®) and select Saute function. Heat oil for 1 minute. Add onion and 1/2 teaspoon salt; cook and stir until onion begins to soften, 3 to 4 minutes.", "Season beef with 1 teaspoon salt and pepper. Add to the pot. Cook and stir until browned evenly on all sides, about 2 minutes. Add garlic and thyme; cook until fragrant, about 30 seconds. Pour in soy sauce.", "Stir mushrooms into the pot. Stir in flour until evenly incorporated. Pour in chicken broth and remaining 1/2 teaspoon salt. Close and lock the lid. Set timer for 10 minutes. Set to high pressure according to manufacturer's instructions, 10 to 15 minutes.", "Release pressure carefully using the quick-release method. Open pressure cooker; stir in egg noodles. Seal and bring to high pressure again, about 5 minutes; cook for 5 minutes.", "Release pressure naturally according to manufacturer's instruction for 5 minutes. Release remaining pressure using the quick-release method. Open pressure cooker; stir in sour cream."], "facts": "536 calories; protein 29g 58% DV; carbohydrates 45.2g 15% DV; fat 26.2g 40% DV; cholesterol 121.4mg 41% DV; sodium 1312.5mg 53% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/231808/grandmas-ground-beef-casserole/", "name": "Grandma's Ground Beef Casserole", "summary": "\nAs the title suggests, this was my Grandmother's recipe. I've tweaked the amount of cheese and sour cream depending on what I've got in the fridge and it always turns out great! My mother has suggested this was made up as a way to use up ingredients in the fridge. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F996886.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound ground beef", "1 teaspoon white sugar", "1 teaspoon salt", "1 teaspoon garlic salt", "2 (15 ounce) cans tomato sauce", "1 (8 ounce) package egg noodles", "1 cup sour cream", "1 (3 ounce) package cream cheese", "1 large white onion, diced", "½ cup shredded sharp Cheddar cheese, or more to taste"], "direction": ["Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix sugar, salt, garlic salt and tomato sauce into ground beef; simmer until flavors blend, about 20 minutes. Remove from heat, cover skillet, and cool to room temperature.", "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain and cool slightly.", "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish.", "Mix sour cream, cream cheese, and onion in a bowl.", "Scoop half the noodles into the prepared casserole dish; top with half the sour cream mixture. Spoon half the ground beef mixture atop sour cream layer. Repeat layering with remaining ingredients. Top casserole with Cheddar cheese.", "Bake in the preheated oven until Cheddar cheese has browned, 25 to 30 minutes."], "facts": "519 calories; protein 24.5g 49% DV; carbohydrates 39.4g 13% DV; fat 29.8g 46% DV; cholesterol 120.1mg 40% DV; sodium 1596.6mg 64% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/220869/easy-pressure-cooker-pot-roast/", "name": "Easy Pressure Cooker Pot Roast", "summary": "\nVERY tender and delicious. Using the pressure cooker saves SO much time that this recipe can be used on a weekday and still you can manage to eat dinner at a decent hour. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3553277.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 (3 pound) boneless beef chuck roast, trimmed", "ground black pepper to taste", "1 pinch seasoned salt, or to taste", "1 pinch onion powder, or to taste", "1 (14.5 ounce) can beef broth", "1 ½ tablespoons Worcestershire sauce", "1 large onion, cut into 4 wedges", "4  carrots, peeled and cut into bite-size pieces", "4 large potatoes, peeled and cut into bite-size pieces"], "direction": ["Heat oil in a pressure cooker over medium-high heat. Brown roast on all sides in the hot oil; season with pepper, seasoned salt, and onion powder.", "Pour in beef broth and Worcestershire sauce, add the quartered onion, and seal the lid. Bring the cooker up to full pressure. Reduce heat to low, maintaining full pressure, and cook for 30 minutes.", "Use the quick-release method to lower the pressure. Mix in carrots and potatoes, seal the lid again, and return the pressure cooker to the heat. Bring the cooker up to full pressure and cook for an additional 15 minutes. Use the quick-release method again and transfer the roast and vegetables to a serving dish."], "facts": "450 calories; protein 25.1g 50% DV; carbohydrates 38.3g 12% DV; fat 21.8g 34% DV; cholesterol 77.5mg 26% DV; sodium 310.6mg 12% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/275553/breaded-air-fryer-pork-chops/", "name": "Breaded Air Fryer Pork Chops", "summary": "\nPerfectly tender and juicy pork chops are what you'll get in just 10 minutes using your air fryer and basic pantry ingredients. Play around with different crouton flavors for variety. I like to use a Misto® sprayer with my own oil, but feel free to use regular cooking spray. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6960703.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  boneless, center-cut pork chops, 1-inch thick", "1 teaspoon Cajun seasoning", "1 ½ cups cheese and garlic flavored croutons", "2  eggs", "cooking spray"], "direction": ["Preheat the air fryer to 390 degrees F (200 degrees C).", "Place pork chops on a plate and season both sides with Cajun seasoning.", "Pulse croutons in a small food processor until they have a fine consistency; transfer to a shallow dish. Lightly beat eggs in a separate shallow dish. Dip pork chops into eggs, letting excess drip off. Coat chops in crouton breading and set on a plate. Mist chops with cooking spray.", "Spray basket of the air fryer with cooking spray and place chops inside, making sure to not overcrowd the fryer. You may have to do two batches depending on the size of your air fryer.", "Cook for 5 minutes. Flip chops and mist again with cooking spray if there are dry or powdery areas. Cook 5 minutes more. Repeat with remaining chops."], "facts": "394 calories; protein 44.7g 89% DV; carbohydrates 10g 3% DV; fat 18.1g 28% DV; cholesterol 218mg 73% DV; sodium 428.9mg 17% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/16895/fluffy-french-toast/", "name": "Fluffy French Toast", "summary": "\nThis French toast recipe is different because it uses flour. I have given it to some friends and they've all liked it better than the French toast they usually make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2049275.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 slices"]], "ingredients": ["¼ cup all-purpose flour", "1 cup milk", "1 pinch salt", "3  eggs", "½ teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 tablespoon white sugar", "12 thick slices bread"], "direction": ["Measure flour into a large mixing bowl. Slowly whisk in the milk. Whisk in the salt, eggs, cinnamon, vanilla extract and sugar until smooth.", "Heat a lightly oiled griddle or frying pan over medium heat.", "Soak bread slices in mixture until saturated. Cook bread on each side until golden brown. Serve hot."], "facts": "123 calories; protein 4.8g 10% DV; carbohydrates 19.4g 6% DV; fat 2.7g 4% DV; cholesterol 48.1mg 16% DV; sodium 230.2mg 9% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246198/easy-french-toast-waffles/", "name": "Easy French Toast Waffles", "summary": "\nMaking French toast in your waffle iron combines the best of both worlds. You get all the custardy richness of French toast plus waffle's signature crispy ridges. All the better to hold more maple syrup. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3242413.jpg", "meta": [["prep:", "10 mins"], ["cook:", "3 mins"], ["additional:", "2 mins"], ["total:", "15 mins"], ["Servings:", "2"], ["Yield:", "4 slices"]], "ingredients": ["cooking spray", "½ cup whole milk", "2  large eggs", "1 tablespoon maple syrup", "½ teaspoon vanilla extract", "1 pinch salt", "4 pieces 1/2-inch thick pieces brioche"], "direction": ["Preheat a waffle iron according to manufacturer's instructions and spray with cooking spray.", "Whisk milk, eggs, maple syrup, vanilla extract, and salt together in a wide bowl until thoroughly combined. Dip bread slices 1 at a time in the egg mixture, coating both sides completely. Lift bread with a slotted spatula to allow excess egg mixture to drain back into the bowl. Place dipped bread slices on a rimmed baking sheet and let rest until mixture soaks in, about 2 minutes.", "Place dipped bread in the preheated waffle iron. Gently close the lid without forcing it down. Cook according to manufacturer's instructions until golden brown, 3 to 5 minutes. Repeat with remaining slices."], "facts": "671 calories; protein 23.3g 47% DV; carbohydrates 81.3g 26% DV; fat 27.8g 43% DV; cholesterol 335.3mg 112% DV; sodium 799.7mg 32% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246835/barbacoa-style-shredded-beef/", "name": "Barbacoa-Style Shredded Beef", "summary": "\nSimilar to Chipotle's® barbacoa. Great over nachos, in tacos, and burritos. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3514633.jpg", "meta": [["prep:", "25 mins"], ["cook:", "8 hrs 4 mins"], ["additional:", "10 mins"], ["total:", "8 hrs 39 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (3 pound) beef chuck roast, cut into 6 to 8 chunks", "salt and ground black pepper to taste", "2 tablespoons vegetable oil", "½ cup beef broth", "¼ cup apple cider vinegar", "¼ cup fresh lime juice", "4  chipotle peppers in adobo sauce, chopped", "5 cloves garlic, chopped", "1 tablespoon ground cumin", "1 tablespoon dried oregano", "¼ teaspoon ground cloves", "3  bay leaves"], "direction": ["Season beef chunks with salt and pepper on all sides.", "Heat oil in a large skillet over medium-high heat. Add beef in batches; cook until browned, about 1 minute per side. Transfer beef to a slow cooker.", "Combine beef broth, apple cider vinegar, lime juice, chipotle peppers, garlic, cumin, oregano, and cloves in a bowl. Season with salt and pepper and mix well. Pour over beef in the slow cooker. Stir in bay leaves.", "Cook on Low until beef is fork-tender, 8 to 10 hours.", "Discard bay leaves. Remove beef and shred using 2 forks. Return beef to the slow cooker to marinate in the sauce for at least 10 more minutes before serving."], "facts": "303 calories; protein 20.3g 41% DV; carbohydrates 2.6g 1% DV; fat 22.9g 35% DV; cholesterol 77.5mg 26% DV; sodium 150.3mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246787/italian-sausage-stuffed-shells/", "name": "Italian Sausage Stuffed Shells", "summary": "\nBelieve it or not, I'm not a fan of cheese and try to avoid it whenever possible. So dishes that are stuffed with things like ricotta turn me off. I created this dish as a compromise to my cheese avoidance and my husband's love of Italian food. \nServe this with garlic bread and a salad for a wonderful family dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4621239.jpg", "meta": [["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (16 ounce) package jumbo pasta shells", "3 teaspoons vegetable oil, divided", "1 pound bulk Italian sausage", "1 (16 ounce) package finely shredded mozzarella cheese, divided", "1 teaspoon dried Italian seasoning, plus more for garnish if desired", "1 (24 ounce) jar prepared marinara sauce"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 baking dish.", "Bring a large pot of lightly salted water to a boil. Cook shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 to 12 minutes. Drain. Lightly oil a rimmed baking sheet; place drained pasta on baking sheet to cool.", "Heat 2 teaspoons vegetable oil over medium-high heat in a heavy skillet. Cook and crumble sausage until it has lost its pink color and begins to brown. Remove from heat; drain off grease.", "Stir half of the shredded cheese and the Italian seasoning into the browned sausage. Spoon mixture into the pasta shells (1 to 2 tablespoons per shell). Arrange stuffed shells in prepared baking dish. Pour marinara sauce evenly over the shells. Top with remaining shredded cheese. Cover tightly with aluminum foil.", "Bake in preheated oven until heated through and bubbly, about 30 minutes. Remove foil; bake until browned, 5 to 10 more minutes. Sprinkle with a pinch of Italian seasoning, if desired."], "facts": "578 calories; protein 30.2g 60% DV; carbohydrates 57.3g 19% DV; fat 24.6g 38% DV; cholesterol 60.3mg 20% DV; sodium 1171.4mg 47% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/246569/roasted-potatoes-with-bacon-cheese-and-parsley/", "name": "Roasted Potatoes with Bacon, Cheese, and Parsley", "summary": "\nThese potatoes are hard to resist with their crispy roasted outsides and creamy delicious insides. I learned to shake the boiled potatoes before baking from an English caterer. Try it! It makes a difference. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3374993.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 7 mins"], ["additional:", "10 mins"], ["total:", "1 hr 47 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds Yukon Gold potatoes", "1 tablespoon salt", "6 slices bacon, halved and cut crosswise into 1/2-inch pieces", "2 tablespoons olive oil", "salt and freshly ground black pepper to taste", "½ cup grated Parmigiano-Reggiano cheese", "2 cloves garlic, finely chopped", "¼ cup fresh Italian flat-leaf parsley"], "direction": ["Place an oven rack in the bottom third of the oven and preheat oven to 450 degrees F (230 degrees C).", "Place potatoes in a large pot and cover with cold water and salt. Bring to a boil; reduce heat to medium and simmer until potatoes are just tender when pierced with a fork, about 12 minutes. Drain.", "Return potatoes to the pot; cover with a lid and shake pot vigorously, about 1 minute. Uncover and cool potatoes until easily handled, about 10 minutes. Peel potatoes and cut them crosswise into chunks.", "Place bacon in a skillet and cook over medium-high heat, turning occasionally, until most of the fat has melted and bacon is tender, 5 to 7 minutes. Drain bacon slices on paper towels, reserving bacon fat in the skillet.", "Brush the bottom of a shallow 10x15-inch baking pan with half of the bacon fat and olive oil. Sprinkle salt and pepper over potatoes and arrange in the baking pan.", "Roast potatoes in the preheated oven until golden brown on the bottom, about 30 minutes. Remove potatoes from oven and reduce oven temperature to 375 degrees F (190 degrees C).", "Turn potatoes over in baking pan. Top with bacon pieces, Parmigiano-Reggiano cheese, and garlic. Drizzle remaining bacon fat on top.", "Return to the preheated oven and continue roasting until Parmigiano-Reggiano cheese is melted, about 15 minutes. Sprinkle with parsley and serve."], "facts": "222 calories; protein 8g 16% DV; carbohydrates 30.4g 10% DV; fat 7.8g 12% DV; cholesterol 12mg 4% DV; sodium 1138.2mg 46% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/257882/oatmeal-cream-pies-with-chocolate/", "name": "Oatmeal Cream Pies with Chocolate", "summary": "\nHomemade oatmeal cream pies. Mmmm. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4507606.jpg", "meta": [["prep:", "30 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 2 mins"], ["total:", "1 hr 42 mins"], ["Servings:", "24"], ["Yield:", "2 dozen"]], "ingredients": ["¾ cup butter, softened", "¾ cup light brown sugar", "½ cup white sugar", "1  egg", "1 tablespoon whole milk", "1 teaspoon vanilla extract", "1 ½ cups quick-cooking oats", "¾ cup all-purpose flour", "2 tablespoons cocoa powder, sifted", "1 teaspoon ground cinnamon", "½ teaspoon baking soda", "½ teaspoon baking powder", "½ teaspoon kosher salt", "½ cup mini chocolate chips"], "direction": ["Combine butter, brown sugar, and white sugar in a large bowl; beat with an electric mixer until smooth creamy, 3 to 5 minutes. Beat in egg, 1 tablespoon milk, and 1 teaspoon vanilla extract.", "Mix oats, flour, cocoa powder, cinnamon, baking soda, baking powder, and salt together in a separate bowl. Beat into the creamed butter mixture on low speed. Fold in chocolate chips using a rubber spatula.", "Cover bowl with plastic wrap and refrigerate dough until firm enough to scoop, at least 1 hour.", "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.", "Scoop small balls of dough onto the lined baking sheets using a small cookie scoop.", "Bake in the preheated oven until golden, about 10 minutes. Let cookies sit on the baking sheets for 2 minutes. Transfer to a wire rack to cool completely.", "Combine cream cheese and vegetable shortening in a bowl; beat with an electric mixer until smooth. Add marshmallow cream, 2 teaspoons milk, and 1/2 teaspoon vanilla extract; mix well. Beat in confectioners' sugar, 1/4 cup at a time, until filling reaches a thick consistency.", "Scoop some of the filling onto the flat side of 1 cookie using the cookie scoop. Press another cookie on top to sandwich the filling. Repeat with remaining cookies and filling."], "facts": "258 calories; protein 2g 4% DV; carbohydrates 33.9g 11% DV; fat 13.4g 21% DV; cholesterol 28.2mg 9% DV; sodium 140.6mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/257268/bunny-pretzels/", "name": "Bunny Pretzels", "summary": "\nA quick and easy way to make homemade pretzels. They can be brushed with butter or dipped in cinnamon sugar, just like they do at the mall. This is a treat I like to make for our Easter egg hunt. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4478032.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["total:", "45 mins"], ["Servings:", "12"], ["Yield:", "12 pretzels"]], "ingredients": ["cooking spray", "4 cups water", "¼ cup baking soda", "1 (11 ounce) package refrigerated French bread dough (such as Pillsbury®)", "1  egg yolk", "1 tablespoon water", "1 tablespoon coarse sea salt", "2 tablespoons butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet with cooking spray.", "Mix 4 cups water and baking soda together in a large saucepan; bring to a boil. Pour into a shallow dish.", "Flatten bread dough on a floured work surface; cut into 3 pieces, each about 6 inches long. Slice each piece into 4 long strips. Break a 1-inch piece off each strip; roll into a ball for the tail. Roll the remainder of each strip into a log about 9 inches long.", "Wrap 1 log around the tail to make the body; twist twice to make the head and ears. Repeat with remaining 11 strips.", "Submerge \"bunnies,\" 2 at a time, into the water-baking soda mixture for 30 seconds. Transfer to the prepared baking sheet. Adjust ears if they became untwisted.", "Whisk egg yolk and 1 tablespoon water together in a small bowl. Brush over bunnies. Sprinkle salt on top.", "Bake in the preheated oven until warmed through, about 5 minutes. Move around with a spatula to ensure they don't stick. Continue baking until golden brown, about 10 minutes. Transfer to cooling racks. Brush with melted butter while still warm."], "facts": "85 calories; protein 2.3g 5% DV; carbohydrates 11.4g 4% DV; fat 3.1g 5% DV; cholesterol 22.2mg 7% DV; sodium 1864.4mg 75% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/256625/grilled-lime-cilantro-chicken-with-sweet-chili-sauce/", "name": "Grilled Lime Cilantro Chicken with Sweet Chili Sauce", "summary": "\nPerfectly grilled tender and juicy chicken marinated in a lime cilantro marinade with soy sauce and topped with sweet chili sauce. Marinate the chicken the night before or the morning-of and you'll be ready for dinner in no time. This recipe was made in a Panasonic CIO. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4427327.jpg", "meta": [["prep:", "15 mins"], ["cook:", "12 mins"], ["additional:", "3 hrs"], ["total:", "3 hrs 27 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 (8 ounce) skinless, boneless chicken breasts", "¼ cup minced fresh cilantro", "2 tablespoons lime juice", "1 tablespoon low-sodium soy sauce", "1 tablespoon olive oil", "2 cloves garlic, minced", "¼ cup sweet chili sauce", "1 teaspoon minced fresh cilantro"], "direction": ["Place chicken in a resealable plastic bag. Combine 1/4 cup cilantro, lime juice, soy sauce, olive oil, and garlic in a small bowl. Pour over chicken and seal the bag. Let marinate in the refrigerator, 3 hours to overnight.", "Preheat Panasonic® Countertop Induction Oven to Medium on the \"Grill\" setting.", "Place chicken on the grill pan. Grill chicken for 6 to 7 minutes per side or until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C).", "Brush chicken with sweet chili sauce. Garnish with 1 teaspoon cilantro."], "facts": "353 calories; protein 44.8g 90% DV; carbohydrates 16.1g 5% DV; fat 11.6g 18% DV; cholesterol 117mg 39% DV; sodium 702.3mg 28% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/254495/herb-n-honey-cucumber-tomato-salad/", "name": "Herb 'n Honey Cucumber Tomato Salad", "summary": "\nCrisp and sweetly delicious, this salad is a wonderful addition to any summer picnic. May serve immediately or cover and refrigerate up to four hours before serving for enhanced flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3774683.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3  cucumbers, peeled and sliced", "2 large ripe tomatoes, sliced", "2  green onions, sliced thin", "8 leaves fresh basil, chopped", "½ cup crumbled feta cheese", "½ cup seasoned rice wine vinegar", "½ cup honey"], "direction": ["Layer cucumbers, tomatoes, green onions, and basil in a bowl; top with feta cheese. Drizzle rice wine vinegar over the surface; top with honey."], "facts": "167 calories; protein 3.2g 6% DV; carbohydrates 35.5g 12% DV; fat 2.9g 5% DV; cholesterol 11.1mg 4% DV; sodium 333.2mg 13% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/222037/tatertot-casserole/", "name": "Tatertot Casserole", "summary": "\nQuick and easy casserole everyone will love. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4482008.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1 pinch salt and ground black pepper to taste", "1 (10.75 ounce) can  condensed cream of mushroom soup", "2 cups shredded Cheddar cheese", "1 (16 ounce) package frozen tater tots"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cook and stir ground beef in a large skillet over medium heat until no longer pink and completely browned, 7 to 10 minutes; season with salt and black pepper. Stir cream of mushroom soup into the cooked ground beef; pour the mixture into a 9x13-inch baking dish. Layer tater tots evenly over the ground beef mixture; top with Cheddar cheese.", "Bake until tater tots are golden brown and hot, 30 to 45 minutes."], "facts": "345 calories; protein 18.5g 37% DV; carbohydrates 16.9g 6% DV; fat 23.8g 37% DV; cholesterol 65.1mg 22% DV; sodium 700.2mg 28% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/17481/simple-white-cake/", "name": "Simple White Cake", "summary": "\nThis cake was sent home from our children's school. It is the simplest, great tasting cake I've ever made. Great to make with the kids, especially for cupcakes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1437162.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "12 cupcakes or 1- 9x9 inch pan"]], "ingredients": ["1 cup white sugar", "½ cup butter", "2  eggs", "2 teaspoons vanilla extract", "1 ½ cups all-purpose flour", "1 ¾ teaspoons baking powder", "½ cup milk"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan or line a muffin pan with paper liners.", "In a medium bowl, cream together the sugar and butter. Beat in the eggs, one at a time, then stir in the vanilla. Combine flour and baking powder, add to the creamed mixture and mix well. Finally stir in the milk until batter is smooth. Pour or spoon batter into the prepared pan.", "Bake for 30 to 40 minutes in the preheated oven. For cupcakes, bake 20 to 25 minutes. Cake is done when it springs back to the touch."], "facts": "209 calories; protein 3.1g 6% DV; carbohydrates 29.4g 10% DV; fat 8.9g 14% DV; cholesterol 52.1mg 17% DV; sodium 141.8mg 6% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/244638/no-yeast-pizza-crust/", "name": "No-Yeast Pizza Crust", "summary": "\nA tasty, quick pizza crust that uses no yeast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4548649.jpg", "meta": [["prep:", "15 mins"], ["additional:", "10 mins"], ["total:", "25 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza"]], "ingredients": ["1 ⅓ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "½ cup fat-free milk", "2 tablespoons olive oil"], "direction": ["Mix flour, baking powder, and salt together in a bowl; stir in milk and olive oil until a soft dough forms. Turn dough onto a lightly floured surface and knead 10 times. Shape dough into a ball. Cover dough with an inverted bowl and let sit for 10 minutes.", "Roll dough into a 12-inch circle on a baking sheet."], "facts": "112 calories; protein 2.8g 6% DV; carbohydrates 16.9g 6% DV; fat 3.6g 6% DV; cholesterol 0.3mg; sodium 215.8mg 9% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/235589/chef-johns-creamy-mushroom-soup/", "name": "Chef John's Creamy Mushroom Soup", "summary": "\nThis is one of my favorite soups of all time. It is so easy. The secret to this deep, rich soup is a long slow caramelization, the key to unlocking the mushroom's magic. This is just pure essence of mushroom. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1072703.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¼ cup unsalted butter", "2 pounds sliced fresh mushrooms", "1 pinch salt", "1  yellow onion, diced", "1 ½ tablespoons all-purpose flour", "6 sprigs fresh thyme", "2 cloves garlic, peeled", "4 cups chicken broth", "1 cup water", "1 cup heavy whipping cream", "1 pinch salt and freshly ground black pepper to taste", "1 teaspoon fresh thyme leaves for garnish, or to taste"], "direction": ["Melt butter in a large soup pot over medium-high heat; cook mushrooms in butter with 1 pinch salt until the mushrooms give off their juices; reduce heat to low. Continue to cook, stirring often, until juices evaporate and the mushrooms are golden brown, about 15 minutes. Set aside a few attractive mushroom slices for garnish later, if desired. Mix onion into mushrooms and cook until onion is soft and translucent, about 5 more minutes.", "Stir flour into mushroom mixture and cook, stirring often, for 2 minutes to remove raw flour taste. Tie thyme sprigs into a small bundle with kitchen twine and add to mushroom mixture; add garlic cloves. Pour chicken stock and water into mushroom mixture. Bring to a simmer and cook for 1 hour. Remove thyme bundle.", "Transfer soup to a blender in small batches and puree on high speed until smooth and thick.", "Return soup to pot and stir in cream. Season with salt and black pepper and serve in bowls, garnished with reserved mushroom slices and a few thyme leaves."], "facts": "272 calories; protein 6.9g 14% DV; carbohydrates 12.2g 4% DV; fat 23.3g 36% DV; cholesterol 78mg 26% DV; sodium 666.6mg 27% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/36925/garlic-butter/", "name": "Garlic Butter", "summary": "\nSometimes the basics are the best!  I've used this simple recipe for years to make garlic bread, and any leftovers go great on barbequed steaks, pasta, rice or potatoes. You can use any butter or margarine you like. Also, fresh or minced garlic in a jar works well. Adjust the amount of garlic to your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5221403.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "16"], ["Yield:", "1 cup"]], "ingredients": ["1 cup butter, softened", "1 tablespoon minced garlic", "¼ cup grated Parmesan cheese", "1 tablespoon garlic salt", "1 teaspoon Italian seasoning", "½ teaspoon ground black pepper", "¼ teaspoon ground paprika"], "direction": ["In a small bowl, combine softened butter, minced garlic and parmesan cheese. Season with garlic salt, Italian seasoning, pepper and paprika. Mix until smooth."], "facts": "110 calories; protein 0.8g 2% DV; carbohydrates 0.5g; fat 12g 18% DV; cholesterol 31.9mg 11% DV; sodium 445.5mg 18% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/219646/authentic-mexican-chili-rellenos/", "name": "Authentic Mexican Chili Rellenos", "summary": "\nThis is an authentic Mexican recipe that has been handed down for generations in my family. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5362039.jpg", "meta": [["prep:", "25 mins"], ["cook:", "20 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6  fresh Anaheim chile peppers", "1 (8 ounce) package queso asadero (white Mexican cheese), cut into 3/4-inch thick strips", "2  eggs, separated", "1 teaspoon baking powder", "¾ cup all-purpose flour", "1 cup vegetable shortening for frying"], "direction": ["Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Place peppers onto the prepared baking sheet, and cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 10 minutes. Turn the peppers often to blacken all sides. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 15 minutes.", "Rinse cooled peppers under cold water to peel off the skins, and cut a slit along the long side of each pepper to remove the seeds and core. Rinse the peppers inside and out, and pat dry with paper towels. Stuff the peppers with strips of the cheese.", "Whisk the egg yolks in a bowl with the baking powder. In a second metal bowl, beat the egg whites with an electric mixer until the whites form stiff peaks. Gently fold the beaten egg whites into the yolk mixture. Place flour into a shallow bowl.", "Heat the vegetable shortening in a skillet over medium heat. Roll each stuffed pepper in flour, tap off excess flour, and dip the peppers into the egg mixture to coat both sides. Gently lay the coated peppers into the hot shortening. Fry peppers until lightly golden brown and the cheese has melted, about 5 minutes per side."], "facts": "263 calories; protein 13.1g 26% DV; carbohydrates 17.3g 6% DV; fat 16g 25% DV; cholesterol 101.7mg 34% DV; sodium 356.6mg 14% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/32385/best-lemonade-ever/", "name": "Best Lemonade Ever", "summary": "\nThis is a very refreshing drink! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2503282.jpg", "meta": [["prep:", "30 mins"], ["cook:", "5 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 35 mins"], ["Servings:", "10"], ["Yield:", "10 (8 ounce) servings"]], "ingredients": ["1 ¾ cups white sugar", "8 cups water", "1 ½ cups lemon juice"], "direction": ["In a small saucepan, combine sugar and 1 cup water.  Bring to boil and stir to dissolve sugar. Allow to cool to room temperature, then cover and refrigerate until chilled.", "Remove seeds from lemon juice, but leave pulp. In pitcher, stir together chilled syrup, lemon juice and remaining 7 cups water."], "facts": "145 calories; protein 0.1g; carbohydrates 38.2g 12% DV; fat 0g; cholesterol 0mg; sodium 6.1mg."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/241925/super-easy-egg-casserole/", "name": "Super Easy Egg Casserole", "summary": "\nAnother husband-approved recipe. Made a couple times recently because of how easy it is to make! This recipe is easy to double or triple, but you may have to cook a bit longer if doing so. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2195255.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup shredded Cheddar cheese", "6  eggs, whisked", "6 slices bacon, diced", "2 slices bread, cubed", "⅓  red bell pepper, diced", "2  green onions, chopped", "3 tablespoons milk", "½ teaspoon minced garlic, or to taste  (Optional)", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.", "Stir Cheddar cheese, eggs, bacon, bread, red bell pepper, green onion, milk, garlic, salt, and black pepper together in a bowl until well-combined; pour into prepared baking dish.", "Bake in the preheated oven until eggs are set, 20 to 25 minutes."], "facts": "340 calories; protein 23.2g 46% DV; carbohydrates 9.3g 3% DV; fat 23.2g 36% DV; cholesterol 324.7mg 108% DV; sodium 728.3mg 29% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/20680/easy-mexican-casserole/", "name": "Easy Mexican Casserole", "summary": "\nThis is an easy and very tasty dish. I often substitute ground turkey and low fat dairy products and it is still delicious! Serve with chips, salsa and green salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5670908.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound lean ground beef", "2 cups salsa", "1 (16 ounce) can chili beans, drained", "3 cups tortilla chips, crushed", "2 cups sour cream", "1 (2 ounce) can sliced black olives, drained", "½ cup chopped green onion", "½ cup chopped fresh tomato", "2 cups shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large skillet over medium-high heat, cook ground beef until no longer pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until liquid is absorbed. Stir in beans, and heat through.", "Spray a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in dish, and then spoon beef mixture over chips. Spread sour cream over beef, and sprinkle olives, green onion, and tomato over the sour cream. Top with Cheddar cheese.", "Bake in preheated oven for 30 minutes, or until hot and bubbly."], "facts": "632 calories; protein 31.7g 63% DV; carbohydrates 32.8g 11% DV; fat 43.7g 67% DV; cholesterol 119.2mg 40% DV; sodium 1308.3mg 52% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/279593/slow-cooker-pineapple-teriyaki-pork-chops/", "name": "Slow Cooker Pineapple-Teriyaki Pork Chops", "summary": "\nThese teriyaki-pineapple pork chops are so delicious you might want to double this recipe. Serve with fresh raw or grilled pineapple slices. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8026172.jpg", "meta": [["prep:", "5 mins"], ["cook:", "4 hrs 5 mins"], ["total:", "4 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 pork chops"]], "ingredients": ["1 tablespoon olive oil, or more as needed", "4 (8 ounce) bone-in pork loin chops", "1 cup unsweetened pineapple juice", "½ cup teriyaki sauce", "1 teaspoon dried crushed rosemary", "1 teaspoon garlic powder", "½ teaspoon salt", "¼ teaspoon ground black pepper"], "direction": ["Heat oil in a skillet over medium-high heat. Add pork chops and brown for about 3 minutes. Transfer chops to a slow cooker.", "Combine pineapple juice, teriyaki sauce, rosemary, garlic powder, salt, and pepper in a bowl. Pour over pork chops.", "Cover and cook on Low, 4 to 5 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C)."], "facts": "283 calories; protein 28g 56% DV; carbohydrates 14.4g 5% DV; fat 11.8g 18% DV; cholesterol 65.3mg 22% DV; sodium 1728.7mg 69% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/216950/roasted-cauliflower-soup/", "name": "Roasted Cauliflower Soup", "summary": "\nThis is simple and delicious. The taste is so smooth and creamy most people think this is a fattening soup loaded with cream and potatoes. People are always shocked by how few ingredients are needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012540.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads   cauliflower, broken into florets", "olive oil cooking spray", "¼ cup olive oil", "1 large onion, chopped", "4 cloves garlic, chopped", "6 cups water", "salt and ground black pepper to taste"], "direction": ["Place the cauliflower florets into a large bowl of lightly salted water; allow to stand for 20 minutes. Drain well, and arrange on a sheet of heavy aluminum foil on a baking sheet. Spray the olive oil cooking spray evenly on the cauliflower.", "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.", "Broil the cauliflower until browned, 20 to 30 minutes.", "Meanwhile, heat olive oil in a large soup pot, and cook the onion until translucent, about 5 minutes; stir in the garlic and roasted cauliflower. Pour in the water, season with salt and black pepper, and simmer until all the vegetables are tender, about 30 minutes. Blend the soup in the pot with an immersion hand blender until creamy and smooth."], "facts": "141 calories; protein 4.2g 8% DV; carbohydrates 13.2g 4% DV; fat 9.2g 14% DV; cholesterol 0mg; sodium 92.6mg 4% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/228319/perfect-ten-baked-cod/", "name": "Perfect Ten Baked Cod", "summary": "\nSimple, fast, and delicious describes this baked cod recipe. Bake for two sets of 10 minutes each and you have the perfect ten dinner! This recipe was a favorite request from a local restaurant. They closed after years in business and we are happy to share a version of their most requested recipe. I serve this with rice pilaf and fresh spinach that has been lightly seared in olive oil and garlic. Yummy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4523973.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons butter", "½ sleeve buttery round crackers (such as Ritz®), crushed", "2 tablespoons butter", "1 pound thick-cut cod loin", "½  lemon, juiced", "¼ cup dry white wine", "1 tablespoon chopped fresh parsley", "1 tablespoon chopped green onion", "1  lemon, cut into wedges"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Place 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.", "Place remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.", "Coat both sides of cod in melted butter in the baking dish.", "Bake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.", "Garnish baked cod with parsley and green onion. Serve with lemon wedges."], "facts": "280 calories; protein 20.9g 42% DV; carbohydrates 9.3g 3% DV; fat 16.1g 25% DV; cholesterol 71.5mg 24% DV; sodium 282.3mg 11% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/", "name": "Broccoli, Rice, Cheese, and Chicken Casserole", "summary": "\nThis is a delicious twist to broccoli, rice, and cheese casserole, and is VERY easy to make. You can also cut this in half. I use the 1 can cream of mushroom soup when I make half.  You can also leave out the onion. It just gives it a little added flavor, but is still very good without it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3878110.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 cups water", "2 cups uncooked instant rice", "2 (10 ounce) cans chunk chicken, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (10.75 ounce) can  condensed cream of chicken soup", "¼ cup butter", "1 cup milk", "1 (16 ounce) package frozen chopped broccoli", "1 small white onion, chopped", "1 pound processed cheese food"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium saucepan, bring the water to a boil. Mix in the instant rice, cover, and remove from heat. Let stand 5 minutes.", "In a 9x13 inch baking dish, mix the prepared rice, chicken, cream of mushroom soup, cream of chicken soup, butter, milk, broccoli, onion, and processed cheese.", "Bake in the preheated oven for 30 to 35 minutes, or until cheese is melted. Stir halfway through cooking to help cheese melt evenly."], "facts": "756 calories; protein 36g 72% DV; carbohydrates 82.7g 27% DV; fat 30.8g 47% DV; cholesterol 109.5mg 37% DV; sodium 1642.3mg 66% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/222795/superb-sauteed-mushrooms/", "name": "Superb Sauteed Mushrooms", "summary": "\nThese mushrooms are the quintessential topping for all types of steak. Also excellent over baked potatoes. I have people calling me and asking me for the recipe even years after I have made them for them. They are that good!! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6051829.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons olive oil", "3 tablespoons butter", "1 pound button mushrooms, sliced", "1 clove garlic, thinly sliced", "1 tablespoon red cooking wine", "1 tablespoon teriyaki sauce, or more to taste", "¼ teaspoon garlic salt, or to taste", "freshly ground black pepper to taste"], "direction": ["Heat olive oil and butter in a large saucepan over medium heat. Cook and stir mushrooms, garlic, cooking wine, teriyaki sauce, garlic salt, and black pepper in the hot oil and butter until mushrooms are lightly browned, about 5 minutes. Reduce heat to low and simmer until mushrooms are tender, 5 to 8 more minutes."], "facts": "199 calories; protein 3.9g 8% DV; carbohydrates 5.3g 2% DV; fat 19.2g 30% DV; cholesterol 22.9mg 8% DV; sodium 375.7mg 15% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/", "name": "Italian Baked Meatballs", "summary": "\nThis recipe makes the most tender and tasty meatballs. I also freeze these meatballs and take out how many servings I need for each meal. If cooking in sauce, add baked meatballs 20 minutes before serving time. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5834922.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "30 1-ounce meatballs"]], "ingredients": ["1 cup Italian-seasoned bread crumbs", "¼ cup grated Romano cheese", "2 tablespoons chopped fresh parsley", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ teaspoon garlic powder", "½ teaspoon onion powder", "½ cup water", "2  eggs", "1 ½ pounds ground beef"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together. Combine with water and eggs. Add ground beef and mix well. Roll mixture into balls and place on a nonstick baking sheet.", "Bake in the preheated oven until browned, about 30 minutes."], "facts": "343 calories; protein 24.4g 49% DV; carbohydrates 14.1g 5% DV; fat 20.4g 31% DV; cholesterol 135.2mg 45% DV; sodium 611.7mg 25% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/216758/moms-fabulous-chicken-pot-pie-with-biscuit-crust/", "name": "Mom's Fabulous Chicken Pot Pie with Biscuit Crust", "summary": "\nLeftover chicken or rotisserie chicken from the supermarket helps on the ease of preparation of this fabulous comfort style dinner. Fresh vegetables gives this a very special added flavor and is worth the effort. Everyone loves Mom's Chicken Pot Pie! Serve with a green salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6660391.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["additional:", "10 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "1 pot pie"]], "ingredients": ["¼ cup butter", "1 small onion, chopped", "3  celery ribs, chopped", "3  carrots, chopped", "⅔ cup frozen peas", "3 tablespoons chopped fresh parsley", "¼ teaspoon dried thyme", "¼ cup all-purpose flour", "2 cups lower-sodium chicken broth", "⅔ cup half-and-half cream", "salt and ground black pepper to taste", "3 cups cooked chicken, cut into bite-size pieces", "1 (16.3 ounce) can refrigerated flaky-style biscuits (such as Pillsbury Grands®)", "1  egg yolk, beaten", "1 tablespoon water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Melt butter in a skillet over medium-low heat, and cook the onion, celery, and carrots until the celery and carrots are tender, about 15 minutes, stirring occasionally. Stir in peas, parsley, thyme and flour, and cook, stirring constantly, until the flour coats the vegetables and begins to fry, about 5 minutes. Whisk in chicken broth and half-and-half, and cook until the sauce is thick and bubbling. Season to taste with salt and black pepper, and mix in the chicken meat.", "Transfer the chicken, vegetables, and sauce into a 2-quart baking dish. Arrange biscuits on top of the filling. In a small bowl, beat egg yolk with water; brush egg yolk on the biscuits.", "Bake in the preheated oven until the biscuits are golden brown and the pie filling is bubbling, 20 to 25 minutes. Let rest 10 minutes before serving."], "facts": "577 calories; protein 27.1g 54% DV; carbohydrates 44.7g 14% DV; fat 31.2g 48% DV; cholesterol 120.4mg 40% DV; sodium 1026.1mg 41% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/", "name": "Quick Beef Stir-Fry", "summary": "\nQuick and easy. I make this on my busiest weeknights. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6263320.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 pound beef sirloin, cut into 2-inch strips", "1 ½ cups fresh broccoli florets", "1  red bell pepper, cut into matchsticks", "2  carrots, thinly sliced", "1  green onion, chopped", "1 teaspoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons sesame seeds, toasted"], "direction": ["Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.", "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes."], "facts": "268 calories; protein 22.6g 45% DV; carbohydrates 9.1g 3% DV; fat 15.8g 24% DV; cholesterol 48.9mg 16% DV; sodium 526.2mg 21% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/23891/grilled-cheese-sandwich/", "name": "Grilled Cheese Sandwich", "summary": "\nBread, butter and Cheddar cheese - here's a way to make this classic sandwich in a nonstick pan. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2206436.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["4 slices white bread", "3 tablespoons butter, divided", "2 slices Cheddar cheese"], "direction": ["Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese."], "facts": "400 calories; protein 11.1g 22% DV; carbohydrates 25.7g 8% DV; fat 28.3g 44% DV; cholesterol 75.6mg 25% DV; sodium 639.2mg 26% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/272858/air-fryer-chicken-thighs/", "name": "Air Fryer Chicken Thighs", "summary": "\nTasty, quick, chicken thighs, with juicy meat and a crispy skin; you will love this chicken that is ready for the table in less than 30 minutes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F272858.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  skin-on, boneless chicken thighs", "2 teaspoons extra-virgin olive oil", "1 teaspoon smoked paprika", "¾ teaspoon garlic powder", "½ teaspoon salt", "½ teaspoon ground black pepper"], "direction": ["Preheat an air fryer to 400 degrees F (200 degrees C).", "Pat chicken thighs dry with a paper towel and brush the skin-side of each piece with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate.", "Combine smoked paprika, garlic powder, salt, and pepper in a bowl and sprinkle half the seasoning mixture evenly over the 4 chicken thighs. Turn thighs over and evenly sprinkle remaining seasoning mixture on top. Place chicken thighs in the air fryer basket in a single layer, skin-side up.", "Fry in the preheated air fryer until chicken is brown and juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."], "facts": "213 calories; protein 19.3g 39% DV; carbohydrates 0.9g; fat 14.2g 22% DV; cholesterol 70.9mg 24% DV; sodium 355.2mg 14% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/", "name": "Black Pepper Beef and Cabbage Stir Fry", "summary": "\nA very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8279013.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons vegetable oil", "4 cloves garlic, chopped", "½ pound ground beef", "½ small head cabbage, shredded", "1  red bell pepper, cut into strips", "2 tablespoons soy sauce", "1 teaspoon cornstarch", "½ cup cold water", "1 teaspoon ground black pepper, or to taste", "1 pinch salt, to taste"], "direction": ["Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.", "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened."], "facts": "280 calories; protein 11.6g 23% DV; carbohydrates 9.5g 3% DV; fat 22.1g 34% DV; cholesterol 48.2mg 16% DV; sodium 547.3mg 22% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/244614/3-ingredient-peanut-butter-cookies/", "name": "3-Ingredient Peanut Butter Cookies", "summary": "\nThis is one of my favorite cookies to make. They are the only peanut butter cookies my family will eat! Sprinkle a pinch of sugar on cookies before baking, if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2444026.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "2 mins"], ["total:", "22 mins"], ["Servings:", "24"], ["Yield:", "2 dozen cookies"]], "ingredients": ["1 cup peanut butter", "1 cup white sugar", "1  egg"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Mix peanut butter, sugar, and egg together in a bowl using an electric mixer until smooth and creamy. Roll mixture into small balls and arrange on a baking sheet; flatten each with a fork, making a criss-cross pattern.", "Bake in the preheated oven for 10 minutes. Cool cookies on the baking sheet for 2 minutes before moving to a plate."], "facts": "98 calories; protein 3g 6% DV; carbohydrates 10.5g 3% DV; fat 5.6g 9% DV; cholesterol 7.8mg 3% DV; sodium 52.3mg 2% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/223597/old-fashioned-potato-cakes/", "name": "Old Fashioned Potato Cakes", "summary": "\nThese potato cakes are great with any meal or as a snack. Simple and quick to make with only a few ingredients. Kids of ALL ages love 'em. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F874657.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 cups mashed potatoes", "1 cup all-purpose flour", "1  onion, diced", "1  egg", "½ teaspoon ground black pepper", "½ teaspoon salt", "½ cup vegetable oil, or as needed"], "direction": ["Mix mashed potatoes, flour, onion, egg, black pepper, and salt together in a bowl until batter consistency.", "Heat vegetable oil in a skillet over medium heat. Drop 4-inch circles of batter into hot oil. Cook until golden brown, about 5 minutes per side. Remove with a slotted spoon and drain on paper towels. Repeat with remaining batter."], "facts": "255 calories; protein 7.1g 14% DV; carbohydrates 45.1g 15% DV; fat 4.9g 8% DV; cholesterol 48.6mg 16% DV; sodium 627.1mg 25% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/260637/creepy-halloween-eyeballs/", "name": "Creepy Halloween Eyeballs", "summary": "\nIf you are looking for creepy Halloween food ideas, try these scary-looking eyeballs that actually taste delicious. You can use them as a cocktail garnish or serve in a bowl as a creepy snack for your kids. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565167.jpg", "meta": [["prep:", "20 mins"], ["total:", "20 mins"], ["Servings:", "20"], ["Yield:", "20 eyeballs"]], "ingredients": ["¼ cup strawberry jam", "1 (11 ounce) can lychees, drained", "½ (6 ounce) container fresh blueberries", "toothpicks"], "direction": ["Spoon a little bit of strawberry jam into the hole of each lychee. Place a blueberry in the hole and secure blueberry with a toothpick."], "facts": "24 calories; protein 0.1g; carbohydrates 6.2g 2% DV; fat 0g; cholesterol 0mg; sodium 0.4mg."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/258468/beef-stroganoff-for-instant-pot/", "name": "Beef Stroganoff for Instant Pot®", "summary": "\nA truly one-pot meal! Fork-tender beef and mushrooms with egg noodles. This recipe is written using the Instant Pot®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6472891.jpg", "meta": [["prep:", "20 mins"], ["cook:", "37 mins"], ["additional:", "5 mins"], ["total:", "1 hr 2 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons canola oil", "½  onion, diced", "2 teaspoons salt, divided", "2 pounds beef stew meat, cut into 1-inch cubes", "1 teaspoon freshly ground black pepper", "3 cloves garlic, minced", "½ teaspoon dried thyme", "2 tablespoons soy sauce", "3 cups chopped mushrooms", "2 tablespoons all-purpose flour", "3 cups chicken broth", "1 (16 ounce) package wide egg noodles", "¾ cup sour cream, or to taste"], "direction": ["Turn on a multi-cooker (such as Instant Pot®) and select Saute function. Heat oil for 1 minute. Add onion and 1/2 teaspoon salt; cook and stir until onion begins to soften, 3 to 4 minutes.", "Season beef with 1 teaspoon salt and pepper. Add to the pot. Cook and stir until browned evenly on all sides, about 2 minutes. Add garlic and thyme; cook until fragrant, about 30 seconds. Pour in soy sauce.", "Stir mushrooms into the pot. Stir in flour until evenly incorporated. Pour in chicken broth and remaining 1/2 teaspoon salt. Close and lock the lid. Set timer for 10 minutes. Set to high pressure according to manufacturer's instructions, 10 to 15 minutes.", "Release pressure carefully using the quick-release method. Open pressure cooker; stir in egg noodles. Seal and bring to high pressure again, about 5 minutes; cook for 5 minutes.", "Release pressure naturally according to manufacturer's instruction for 5 minutes. Release remaining pressure using the quick-release method. Open pressure cooker; stir in sour cream."], "facts": "536 calories; protein 29g 58% DV; carbohydrates 45.2g 15% DV; fat 26.2g 40% DV; cholesterol 121.4mg 41% DV; sodium 1312.5mg 53% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/231808/grandmas-ground-beef-casserole/", "name": "Grandma's Ground Beef Casserole", "summary": "\nAs the title suggests, this was my Grandmother's recipe. I've tweaked the amount of cheese and sour cream depending on what I've got in the fridge and it always turns out great! My mother has suggested this was made up as a way to use up ingredients in the fridge. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F996886.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound ground beef", "1 teaspoon white sugar", "1 teaspoon salt", "1 teaspoon garlic salt", "2 (15 ounce) cans tomato sauce", "1 (8 ounce) package egg noodles", "1 cup sour cream", "1 (3 ounce) package cream cheese", "1 large white onion, diced", "½ cup shredded sharp Cheddar cheese, or more to taste"], "direction": ["Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix sugar, salt, garlic salt and tomato sauce into ground beef; simmer until flavors blend, about 20 minutes. Remove from heat, cover skillet, and cool to room temperature.", "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain and cool slightly.", "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish.", "Mix sour cream, cream cheese, and onion in a bowl.", "Scoop half the noodles into the prepared casserole dish; top with half the sour cream mixture. Spoon half the ground beef mixture atop sour cream layer. Repeat layering with remaining ingredients. Top casserole with Cheddar cheese.", "Bake in the preheated oven until Cheddar cheese has browned, 25 to 30 minutes."], "facts": "519 calories; protein 24.5g 49% DV; carbohydrates 39.4g 13% DV; fat 29.8g 46% DV; cholesterol 120.1mg 40% DV; sodium 1596.6mg 64% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/220869/easy-pressure-cooker-pot-roast/", "name": "Easy Pressure Cooker Pot Roast", "summary": "\nVERY tender and delicious. Using the pressure cooker saves SO much time that this recipe can be used on a weekday and still you can manage to eat dinner at a decent hour. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3553277.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons vegetable oil", "1 (3 pound) boneless beef chuck roast, trimmed", "ground black pepper to taste", "1 pinch seasoned salt, or to taste", "1 pinch onion powder, or to taste", "1 (14.5 ounce) can beef broth", "1 ½ tablespoons Worcestershire sauce", "1 large onion, cut into 4 wedges", "4  carrots, peeled and cut into bite-size pieces", "4 large potatoes, peeled and cut into bite-size pieces"], "direction": ["Heat oil in a pressure cooker over medium-high heat. Brown roast on all sides in the hot oil; season with pepper, seasoned salt, and onion powder.", "Pour in beef broth and Worcestershire sauce, add the quartered onion, and seal the lid. Bring the cooker up to full pressure. Reduce heat to low, maintaining full pressure, and cook for 30 minutes.", "Use the quick-release method to lower the pressure. Mix in carrots and potatoes, seal the lid again, and return the pressure cooker to the heat. Bring the cooker up to full pressure and cook for an additional 15 minutes. Use the quick-release method again and transfer the roast and vegetables to a serving dish."], "facts": "450 calories; protein 25.1g 50% DV; carbohydrates 38.3g 12% DV; fat 21.8g 34% DV; cholesterol 77.5mg 26% DV; sodium 310.6mg 12% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/275553/breaded-air-fryer-pork-chops/", "name": "Breaded Air Fryer Pork Chops", "summary": "\nPerfectly tender and juicy pork chops are what you'll get in just 10 minutes using your air fryer and basic pantry ingredients. Play around with different crouton flavors for variety. I like to use a Misto® sprayer with my own oil, but feel free to use regular cooking spray. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6960703.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  boneless, center-cut pork chops, 1-inch thick", "1 teaspoon Cajun seasoning", "1 ½ cups cheese and garlic flavored croutons", "2  eggs", "cooking spray"], "direction": ["Preheat the air fryer to 390 degrees F (200 degrees C).", "Place pork chops on a plate and season both sides with Cajun seasoning.", "Pulse croutons in a small food processor until they have a fine consistency; transfer to a shallow dish. Lightly beat eggs in a separate shallow dish. Dip pork chops into eggs, letting excess drip off. Coat chops in crouton breading and set on a plate. Mist chops with cooking spray.", "Spray basket of the air fryer with cooking spray and place chops inside, making sure to not overcrowd the fryer. You may have to do two batches depending on the size of your air fryer.", "Cook for 5 minutes. Flip chops and mist again with cooking spray if there are dry or powdery areas. Cook 5 minutes more. Repeat with remaining chops."], "facts": "394 calories; protein 44.7g 89% DV; carbohydrates 10g 3% DV; fat 18.1g 28% DV; cholesterol 218mg 73% DV; sodium 428.9mg 17% DV."}, {"type": "By Audience ", "package": "kids_recipes", "link": "https://www.allrecipes.com/recipe/16895/fluffy-french-toast/", "name": "Fluffy French Toast", "summary": "\nThis French toast recipe is different because it uses flour. I have given it to some friends and they've all liked it better than the French toast they usually make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2049275.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 slices"]], "ingredients": ["¼ cup all-purpose flour", "1 cup milk", "1 pinch salt", "3  eggs", "½ teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 tablespoon white sugar", "12 thick slices bread"], "direction": ["Measure flour into a large mixing bowl. Slowly whisk in the milk. Whisk in the salt, eggs, cinnamon, vanilla extract and sugar until smooth.", "Heat a lightly oiled griddle or frying pan over medium heat.", "Soak bread slices in mixture until saturated. Cook bread on each side until golden brown. Serve hot."], "facts": "123 calories; protein 4.8g 10% DV; carbohydrates 19.4g 6% DV; fat 2.7g 4% DV; cholesterol 48.1mg 16% DV; sodium 230.2mg 9% DV."}]