[{"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/278981/grandmas-chocolate-texas-sheet-cake/", "name": "Grandma's Chocolate Texas Sheet Cake", "summary": "\nThis is hands-down my all-time favorite cake! I fell in love making it after my grandmother shared the recipe with me. This cake is super quick, easy, and fun to make! Definitely recommend this for first time bakers and anyone else who would love to take a bite out of a delicious chocolate Texas sheet cake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2341793.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "24"], ["Yield:", "1 10x15-inch cake"]], "ingredients": ["1 cup salted butter", "1 cup water", "3 tablespoons cocoa powder", "2 cups all-purpose flour", "2 cups white sugar", "½ teaspoon salt", "½ cup buttermilk", "2 large eggs", "1 teaspoon baking soda", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10x15-inch cake pan.", "Combine butter, water, and cocoa powder for cake in a saucepan over medium heat. Cook until butter has melted and mixture comes to a boil. Remove from the heat and cool slightly.", "Meanwhile, mix flour, sugar, and salt together in a large bowl. Beat buttermilk, eggs, baking soda, and vanilla extract together in a separate bowl.", "Add melted butter mixture to the flour mixture, then add buttermilk-egg mixture and beat until thoroughly combined. Pour into the prepared cake pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Remove cake from the oven and cool on a wire rack for 5 minutes.", "Meanwhile, combine butter, milk, cocoa powder, and vanilla extract for the frosting in a saucepan over medium heat. Stir until butter melts, then stir in powdered sugar. Spread frosting over the warm cake."], "facts": "259 calories; protein 2.3g 5% DV; carbohydrates 36.3g 12% DV; fat 12.3g 19% DV; cholesterol 46.5mg 16% DV; sodium 169.6mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/276472/pumpkin-shaped-dinner-rolls/", "name": "Pumpkin-Shaped Dinner Rolls", "summary": "\nThis very Instagram-friendly roll is the perfect thing to bring to that holiday gathering, and can be made using your favorite dinner roll recipe. Sure, these take longer to make than your already perfectly fine dinner rolls, but that's nothing when you consider all the compliments that will be coming your way. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7134118.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs 20 mins"], ["Servings:", "12"], ["Yield:", "12 rolls"]], "ingredients": ["1 cup warm milk", "1 (.25 ounce) package active dry yeast", "1 tablespoon honey, or more to taste", "4 tablespoons melted butter", "1 teaspoon fine salt", "3 cups all-purpose flour, or more as needed", "kitchen string (4 per roll)", "vegetable oil, or as needed"], "direction": ["Combine warm milk, yeast, honey, and butter in a bowl; stir. Add salt and most of the flour, reserving the rest for dusting. Stir using a wooden spoon until a sticky dough forms.", "Dust a work surface with the leftover flour. Knead the dough until smooth, elastic, and no longer sticky, adding more flour as needed. Form dough into a ball that springs back lightly when pressed.", "Transfer dough to a lightly greased bowl, cover with greased foil, and let rise in a warm place until doubled in size, about 1 1/2 hours.", "Meanwhile, cut kitchen string into 4 dozen 8- to 10-inch strands. Place strings in a bowl and toss with oil to coat; set aside.", "Press risen dough down on a work surface; reserve 3 to 4 tablespoons for forming \"stems.\" Cut remaining dough in half and cut each half into 6 wedges. Roll each into a round ball by cupping your hand over the dough and pressing and rolling lightly in a circular motion for 10 to 15 seconds. Cover and let rest for 15 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Line 2 baking sheets with silicone liners.", "Place 4 pieces of string on your work surface. Crisscross strings over a center point into a star formation. Place a dough ball, smooth side-down, onto the center point. Firmly tie each string into a knot over the center of the roll. Snip off excess string using scissors.", "Place tied roll onto a prepared baking sheet, knot side-down. Repeat with remaining strings and dough balls.", "Let rolls rise for about 30 minutes.", "Sift a little flour on top of rolls. Shape reserved dough into \"stems\" and place them on the sheet next to the rolls.", "Bake in the center of the preheated oven until lightly browned, 20 to 25 minutes.", "Remove from the oven and let cool until safe to handle, about 15 minutes. Cut strings off of each roll at the tops and peel down carefully and slowly to remove. Cut a small hole in the tops of each roll and press \"stems\" into each hole. Transfer pumpkin rolls to a serving platter."], "facts": "175 calories; protein 4.2g 8% DV; carbohydrates 26.5g 9% DV; fat 5.7g 9% DV; cholesterol 11.8mg 4% DV; sodium 230.4mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/7679/nutmeg-cake/", "name": "Nutmeg Cake", "summary": "\nThis is not that common of a cake, but it sure is good. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1066891.jpg", "meta": [["prep:", "35 mins"], ["cook:", "25 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "2 9-inch layers"]], "ingredients": ["3  eggs, room temperature", "½ cup butter, softened", "1 ½ cups white sugar", "1 cup buttermilk", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "2 teaspoons ground nutmeg", "¼ teaspoon salt"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9-inch round cake pans.", "Beat the butter and white sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs in three batches, blending them into the butter mixture fully. Stir in the vanilla.", "Sift together the flour, baking powder, baking soda, nutmeg, and salt.", "Pour 1/3 of the flour mixture into the bowl; mix just until incorporated. Stir in 1/2 the buttermilk, mixing gently. Continue adding the flour alternately with the buttermilk, mixing until combined. Spread the batter into the prepared pans.", "Bake in the preheated oven until a toothpick inserted in the center of the cakes comes out clean, about 25 to 30 minutes. Let the cakes cool in the pans for 10 minutes, then invert them on a wire rack to cool completely before icing.", "To make the Caramel Icing: In a medium saucepan, heat the brown sugar, cream or milk, and 1/4 cup butter until it boils. Boil for 2 minutes, then remove from heat. Let cool. Stir in confectioner's sugar and beat until smooth. Add more cream or milk or confectioner's sugar as needed to achieve desired spreading consistency. Makes about 1 1/3 cups."], "facts": "410 calories; protein 4.6g 9% DV; carbohydrates 66.4g 21% DV; fat 14.7g 23% DV; cholesterol 82.9mg 28% DV; sodium 319.3mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/276135/mini-brownie-turkeys/", "name": "Mini Brownie Turkeys", "summary": "\nMiniature brownies are the perfect little bite, and dressing them up for Thanksgiving makes a fun project to do with your kiddos or grands! Makes a great kid-friendly addition to your Thanksgiving dessert table. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7074829.jpg", "meta": [["prep:", "30 mins"], ["cook:", "15 mins"], ["additional:", "25 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "12"], ["Yield:", "12 mini brownies"]], "ingredients": ["nonstick cooking spray (such as BakeEasy®)"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Spray a 12-cup mini muffin tin with cooking spray.", "Cream 1/4 cup butter and sugar together in a bowl with an electric mixer. Add egg and vanilla extract; mix well. Stir flour, cocoa powder, baking powder, and salt together in a separate bowl. Add flour mixture to butter mixture and mix until batter is smooth. Divide batter evenly among the prepared muffin cups.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 14 minutes. Cool in the tin for 5 minutes. Transfer to a wire rack and let cool, about 20 minutes.", "Meanwhile, combine butter, cocoa powder, and milk in a bowl and mix with an electric mixer until smooth. Gradually add powdered sugar and mix until frosting is smooth and fluffy.", "Spoon frosting in a piping bag fitted with a Wilton #10 tip. Pipe a circle of frosting near the bottom half of each mini brownie to create the turkey's head. Add two candy eyes. Add 1 red chocolate piece to form the beak. Pipe 5 lines of frosting in the shape of a semi-circle formation coming up from the head. Place a piece of candy corn on each of the 5 lines to form the turkey's feathers."], "facts": "201 calories; protein 1.5g 3% DV; carbohydrates 32.3g 10% DV; fat 8.2g 13% DV; cholesterol 33.6mg 11% DV; sodium 86mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/260996/stuffed-hasselback-turkey-breast/", "name": "Stuffed Hasselback Turkey Breast", "summary": "\nMuch easier than a traditional roast turkey, this sliced and stuffed turkey breast takes far less time than a whole bird, and it's perfect for an everyday or holiday dinner for a smaller group. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4573281.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["additional:", "25 mins"], ["total:", "1 hr 55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup diced onion", "½ cup diced celery", "1 tablespoon butter", "2 cups small dry bread cubes", "1 teaspoon poultry seasoning (dried sage, rosemary, and thyme)", "½ teaspoon kosher salt", "1 pinch ground pepper, or to taste", "1 pinch cayenne pepper, or to taste", "1 cup hot chicken broth", "1 large egg yolk"], "direction": ["Melt 2 tablespoons butter in a skillet over medium heat. Add onions and celery; cook and stir until golden brown, about 6 minutes. Remove from heat.", "Place bread cubes, poultry seasoning, cooked onions and celery, salt, and pepper in a mixing bowl. Pour in chicken broth. Toss until thoroughly blended. Let mixture rest for about 15 minutes to allow broth to absorb into the stuffing. Add egg yolk; stir until evenly incorporated.", "Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper.", "Slice turkey breast crosswise in 3/4-inch slices down to the bone (do not cut through the bone). Divide stuffing mixture among the spaces between the slices. Transfer turkey breast to prepared baking sheet. Brush with melted butter.", "Roast in preheated oven until richly browned, 60 to 75 minutes. An instant-read thermometer inserted near the bone should read 150 degrees F (65 degrees C). Remove from oven and let rest 10 minutes before slicing sections from bone."], "facts": "1003 calories; protein 93.5g 187% DV; carbohydrates 79.4g 26% DV; fat 31.4g 48% DV; cholesterol 281.6mg 94% DV; sodium 2405.5mg 96% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/240329/thanksgiving-refreshment/", "name": "Thanksgiving Refreshment", "summary": "\nSparkling juice beverage. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1766759.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 drink"]], "ingredients": ["½ cup ice, or as desired", "8 fluid ounces cranberry juice cocktail, chilled", "2 fluid ounces sparkling water", "1  lime wedge"], "direction": ["Fill a tall glass with ice; add cranberry juice and top with sparkling water. Garnish drink with a lime wedge."], "facts": "138 calories; protein 0g; carbohydrates 34.7g 11% DV; fat 0.3g; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13462/cornucopia/", "name": "Cornucopia", "summary": "\nAn easy Cornucopia centerpiece for your Thanksgiving table. Fill the cornucopia with the assorted raw vegetables directly on table and let them spill out of opening  NOTE- To prevent this center-piece from absorbing atmospheric moisture, the baked cornucopia cone can be sprayed with shellac or clear enamel. If treated in this manner, the cornucopia will be inedible but can be preserved and re-used. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F523755.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["additional:", "25 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "1"], ["Yield:", "1 large centerpiece"]], "ingredients": ["3 (11 ounce) containers refrigerated soft bread stick dough", "1  egg", "1 tablespoon water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly spray a 17x14 inch (or lager) cookie sheet with non-stick cooking spray.", "Tear off a 30x18 inch sheet of heavy duty aluminum foil. Fold it in half to 18x15 inch. Roll diagonally to form a hollow cone, about 18 inches long with a diameter of 5 inches at the widest end (Cornucopia opening). Fasten end with clear tape. Stuff cone with crumpled regular foil until form is rigid. Bend tail of cone up then down at end. Spray outside of cone with non-stick cooking spray. Place on cookie sheet.", "Beat the egg with the water to make a glaze. Open and unroll the first can of breadstick dough on work surface. Separate breadsticks. Begin by wrapping one breadstick around tip of cone. Brush end of next breadstick with Glaze and press to attach to end of first breadstick. Continue spiral-wrapping cone, slightly overlapping dough until there are 3 breadsticks left.", "Pinch one end of the 3 breadsticks together, then braid. Brush bread around opening of cornucopia with glaze. Gently press on braid. Brush entire cornucopia with glaze.", "Bake at 350 degrees F (175 degrees C) for 45 minutes or until bread is a rich brown. (If parts start to darken too much, cover them with pieces of foil.)", "Remove from oven and let cool completely on cookie sheet on a wire rack. Carefully remove foil when cool. (If freezing, leave foil in bread for support. Remove when thawed.)"], "facts": "2639 calories; protein 72g 144% DV; carbohydrates 455.8g 152% DV; fat 48g 74% DV; cholesterol 0mg; sodium 6957.1mg 290% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/46653/taco-seasoning-i/", "name": "Taco Seasoning I", "summary": "\nDepending on how spicy you and your family like your dishes, use as little or as much as you want. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4538211.jpg", "meta": [["prep:", "1 min"], ["total:", "1 min"], ["Servings:", "10"], ["Yield:", "1 ounce"]], "ingredients": ["1 tablespoon chili powder", "¼ teaspoon garlic powder", "¼ teaspoon onion powder", "¼ teaspoon crushed red pepper flakes", "¼ teaspoon dried oregano", "½ teaspoon paprika", "1 ½ teaspoons ground cumin", "1 teaspoon sea salt", "1 teaspoon black pepper"], "direction": ["In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container."], "facts": "5 calories; protein 0.2g; carbohydrates 0.9g; fat 0.2g; cholesterol 0mg; sodium 184.8mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "name": "Apple Pie by Grandma Ople", "summary": "\nThis was my grandmother's apple pie recipe.  I have never seen another one quite like it.  It will always be my favorite and has won me several first place prizes in local competitions.  I hope it becomes one of your favorites as well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F736203.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "½ cup unsalted butter", "3 tablespoons all-purpose flour", "¼ cup water", "½ cup white sugar", "½ cup packed brown sugar", "8  Granny Smith apples - peeled, cored and sliced"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.", "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.", "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."], "facts": "512 calories; protein 3.6g 7% DV; carbohydrates 67.8g 22% DV; fat 26.7g 41% DV; cholesterol 30.5mg 10% DV; sodium 240.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/229733/simple-roasted-butternut-squash/", "name": "Simple Roasted Butternut Squash", "summary": "\nButternut squash is so good on its own, that barely any seasoning is needed. This recipe is so simple and easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F957758.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  butternut squash - peeled, seeded, and cut into 1-inch cubes", "2 tablespoons olive oil", "2 cloves garlic, minced", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Toss butternut squash with olive oil and garlic in a large bowl. Season with salt and black pepper. Arrange coated squash on a baking sheet.", "Roast in the preheated oven until squash is tender and lightly browned, 25 to 30 minutes."], "facts": "177 calories; protein 2.6g 5% DV; carbohydrates 30.3g 10% DV; fat 7g 11% DV; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/14231/guacamole/", "name": "Guacamole", "summary": "\nYou can make this avocado salad smooth or chunky depending on your tastes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521556.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3  avocados - peeled, pitted, and mashed", "1  lime, juiced", "1 teaspoon salt", "½ cup diced onion", "3 tablespoons chopped fresh cilantro", "2  roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper  (Optional)"], "direction": ["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."], "facts": "262 calories; protein 3.7g 7% DV; carbohydrates 18g 6% DV; fat 22.2g 34% DV; cholesterol 0mg; sodium 595.7mg 24% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/", "name": "Juicy Roasted Chicken", "summary": "\nMy grandmother's recipe for roasted chicken. We are German and she used to do it this way all the time. I never have had a chicken this juicy before; this little trick works and makes the people eating it go silent. It's funny. We nibble on the celery after. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389250.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["additional:", "15 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (3 pound) whole chicken, giblets removed", "salt and black pepper to taste", "1 tablespoon onion powder, or to taste", "½ cup margarine, divided", "1 stalk celery, leaves removed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.", "Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."], "facts": "423 calories; protein 30.9g 62% DV; carbohydrates 1.2g; fat 32.1g 49% DV; cholesterol 97mg 32% DV; sodium 661.9mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13768/roasted-pumpkin-seeds/", "name": "Roasted Pumpkin Seeds", "summary": "\nHere is an easy recipe for roasting fresh pumpkin seeds. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F729337.jpg", "meta": [["Servings:", "6"], ["Yield:", "1 1/2 cups"]], "ingredients": ["1 ½ cups raw whole pumpkin seeds", "2 teaspoons butter, melted", "1 pinch salt"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Toss seeds in a bowl with the melted butter and salt. Spread the seeds in a single layer on a baking sheet and bake for about 45 minutes or until golden brown; stir occasionally."], "facts": "83 calories; protein 3g 6% DV; carbohydrates 8.6g 3% DV; fat 4.5g 7% DV; cholesterol 3.6mg 1% DV; sodium 12.5mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/", "name": "Good Old Fashioned Pancakes", "summary": "\nThis is a great recipe that I found in my Grandma's recipe book. Judging from the weathered look of this recipe card, this was a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F05%2F07%2FGood-Old-Fashioned-Pancakes-2000.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 ½ cups all-purpose flour", "3 ½ teaspoons baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1 ¼ cups milk", "1  egg", "3 tablespoons butter, melted"], "direction": ["In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.", "Heat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot."], "facts": "158 calories; protein 4.5g 9% DV; carbohydrates 21.7g 7% DV; fat 5.9g 9% DV; cholesterol 37.7mg 13% DV; sodium 503.6mg 20% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F4565477.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "name": "Best Chocolate Chip Cookies", "summary": "\nCrisp edges, chewy middles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Fbest-chocolate-chip-cookies.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "½ teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.", "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."], "facts": "298 calories; protein 3.6g 7% DV; carbohydrates 38.9g 13% DV; fat 15.6g 24% DV; cholesterol 35.8mg 12% DV; sodium 165.8mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Feasy-sugar-cookies.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/10549/best-brownies/", "name": "Best Brownies", "summary": "\nThese brownies always turn out! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2014%2F09%2F1090243_-Best-Brownies-Photo-by-Paula.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["½ cup butter", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "⅓ cup unsweetened cocoa powder", "½ cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking powder"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.", "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.", "Bake in preheated oven for 25 to 30 minutes. Do not overcook.", "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."], "facts": "183 calories; protein 1.8g 4% DV; carbohydrates 25.7g 8% DV; fat 9g 14% DV; cholesterol 44.2mg 15% DV; sodium 109.7mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/92462/slow-cooker-texas-pulled-pork/", "name": "Slow Cooker Texas Pulled Pork", "summary": "\nSlow cooked, Texas-style pulled pork that is served on a buttered and toasted roll.  My family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4560053.jpg", "meta": [["prep:", "15 mins"], ["cook:", "5 hrs"], ["total:", "5 hrs 15 mins"], ["Servings:", "8"], ["Yield:", "8 sandwiches"]], "ingredients": ["1 teaspoon vegetable oil", "1 (4 pound) pork shoulder roast", "1 cup barbeque sauce", "½ cup apple cider vinegar", "½ cup chicken broth", "¼ cup light brown sugar", "1 tablespoon prepared yellow mustard", "1 tablespoon Worcestershire sauce", "1 tablespoon chili powder", "1 extra large onion, chopped", "2 large cloves garlic, crushed", "1 ½ teaspoons dried thyme", "8  hamburger buns, split", "2 tablespoons butter, or as needed"], "direction": ["Pour the vegetable oil into the bottom of a slow cooker. Place the pork roast into the slow cooker; pour in the barbecue sauce, apple cider vinegar, and chicken broth. Stir in the brown sugar, yellow mustard, Worcestershire sauce, chili powder, onion, garlic, and thyme. Cover and cook on High until the roast shreds easily with a fork, 5 to 6 hours.", "Remove the roast from the slow cooker, and shred the meat using two forks. Return the shredded pork to the slow cooker, and stir the meat into the juices.", "Spread the inside of both halves of hamburger buns with butter. Toast the buns, butter side down, in a skillet over medium heat until golden brown. Spoon pork into the toasted buns."], "facts": "528 calories; protein 31.9g 64% DV; carbohydrates 45.5g 15% DV; fat 23.2g 36% DV; cholesterol 98.4mg 33% DV; sodium 802.7mg 32% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/", "name": "Apple Crisp II", "summary": "\nA simple dessert that's great served with ice cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277929.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["10 cups all-purpose apples, peeled, cored and sliced", "1 cup white sugar", "1 tablespoon all-purpose flour", "1 teaspoon ground cinnamon", "½ cup water", "1 cup quick-cooking oats", "1 cup all-purpose flour", "1 cup packed brown sugar", "¼ teaspoon baking powder", "¼ teaspoon baking soda", "½ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degree C).", "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.", "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.", "Bake at 350 degrees F (175 degrees C) for about 45 minutes."], "facts": "316 calories; protein 2.4g 5% DV; carbohydrates 60.5g 20% DV; fat 8.4g 13% DV; cholesterol 20.3mg 7% DV; sodium 97.9mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/11679/homemade-mac-and-cheese/", "name": "Homemade Mac and Cheese", "summary": "\nThis is a nice rich mac and cheese.  Serve with a salad for a great meatless dinner. Hope you enjoy it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6174584.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces uncooked elbow macaroni", "2 cups shredded sharp Cheddar cheese", "½ cup grated Parmesan cheese", "3 cups milk", "¼ cup butter", "2 ½ tablespoons all-purpose flour", "2 tablespoons butter", "½ cup bread crumbs", "1 pinch paprika"], "direction": ["Cook macaroni according to the package directions.  Drain.", "In a saucepan, melt butter or margarine over medium heat.  Stir in enough flour to make a roux.  Add milk to roux slowly, stirring constantly.  Stir in cheeses, and cook over low heat until cheese is melted and the sauce is a little thick.  Put macaroni in large casserole dish, and pour sauce over macaroni.  Stir well.", "Melt butter or margarine in a skillet over medium heat.  Add breadcrumbs and brown.  Spread over the macaroni and cheese to cover.  Sprinkle with a little paprika.", "Bake at 350 degrees F (175 degrees C) for 30 minutes. Serve."], "facts": "858 calories; protein 37.7g 75% DV; carbohydrates 66.7g 22% DV; fat 48.7g 75% DV; cholesterol 141.6mg 47% DV; sodium 879.3mg 35% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/174347/quick-and-almost-professional-buttercream-icing/", "name": "Quick and Almost-Professional Buttercream Icing", "summary": "\nAfter failing to find the perfect recipe for buttercream icing, I found one that worked for me and then added my own two cents. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F572806.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["½ cup unsalted butter, softened", "1 ½ teaspoons vanilla extract", "2 cups confectioners' sugar, sifted", "2 tablespoons milk", "3 drops food coloring, or as needed  (Optional)"], "direction": ["Cream room temperature butter with a hand mixer, the paddle attachment of a stand mixer, or a wooden spoon until smooth and fluffy. Gradually beat in confectioners' sugar until fully incorporated. Beat in vanilla extract.", "Pour in milk and beat for an additional 3 to 4 minutes. Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached."], "facts": "228 calories; protein 0.2g 1% DV; carbohydrates 31.5g 10% DV; fat 11.6g 18% DV; cholesterol 30.8mg 10% DV; sodium 83.7mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/77981/butternut-squash-soup-ii/", "name": "Butternut Squash Soup II", "summary": "\nThis is a thick, rich soup with tons of flavor. Something I whipped up off the top of my head, with things I had on hand. Super easy, quick, and a great way to use squash. An instant hit at my house. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F964341.jpg", "meta": [["prep:", "25 mins"], ["cook:", "45 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons butter", "1 small onion, chopped", "1 stalk celery, chopped", "1 medium carrot, chopped", "2 medium potatoes, cubed", "1 medium butternut squash - peeled, seeded, and cubed", "1 (32 fluid ounce) container chicken stock", "salt and freshly ground black pepper to taste"], "direction": ["Melt the butter in a large pot, and cook the onion, celery, carrot, potatoes, and squash 5 minutes, or until lightly browned. Pour in enough of the chicken stock to cover vegetables. Bring to a boil. Reduce heat to low, cover pot, and simmer 40 minutes, or until all vegetables are tender.", "Transfer the soup to a blender, and blend until smooth. Return to pot, and mix in any remaining stock to attain desired consistency. Season with salt and pepper."], "facts": "305 calories; protein 6.9g 14% DV; carbohydrates 59.7g 19% DV; fat 6.8g 11% DV; cholesterol 20.9mg 7% DV; sodium 1151.4mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/", "name": "Homemade Fresh Pumpkin Pie", "summary": "\nThis recipe is made from fresh pumpkin, not canned. Hope you enjoy it as much as my family does.  Happy Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1071493.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 ⅓ cups all-purpose flour", "½ teaspoon salt", "½ cup shortening", "3 ½ tablespoons cold water"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Prepare pie crust by mixing together the flour and salt. Cut shortening into flour; add cold water 1 tablespoon at a time (you may need only 3 tablespoons, or up to 4 tablespoons). Mix dough and repeat until dough is moist enough to hold together.", "With lightly floured, hands shape dough into a ball. On a lightly floured board roll dough out to about 1/8 inch thickness. With a sharp knife, cut dough 1 1/2 inch larger than the upside-down 8- to 9-inch pie pan. Gently roll the dough around the rolling pin and transfer it right-side up onto the pie pan. Unroll, easing dough into the bottom of the pie pan.", "In a large bowl, beat pumpkin with evaporated milk, eggs, brown sugar, cinnamon, ginger, nutmeg and salt with an electric mixer or immersion blender. Mix well. Pour into a prepared crust. Bake 40 minutes or until when a knife is inserted 1 inch from the edge comes out clean."], "facts": "363 calories; protein 7.4g 15% DV; carbohydrates 44.3g 14% DV; fat 18g 28% DV; cholesterol 60.2mg 20% DV; sodium 365.3mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/16383/basic-crepes/", "name": "Basic Crepes", "summary": "\nHere is a simple but delicious crepe batter which can be made in minutes. It's made from ingredients that everyone has on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1266.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "8 crepes"]], "ingredients": ["1 cup all-purpose flour", "2  eggs", "½ cup milk", "½ cup water", "¼ teaspoon salt", "2 tablespoons butter, melted"], "direction": ["In a large mixing bowl, whisk together the flour and the eggs. Gradually add in the milk and water, stirring to combine. Add the salt and butter; beat until smooth.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly.", "Cook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot."], "facts": "216 calories; protein 7.4g 15% DV; carbohydrates 25.5g 8% DV; fat 9.2g 14% DV; cholesterol 110.7mg 37% DV; sodium 235.3mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/", "name": "Buffalo Chicken Dip", "summary": "\nThis tangy, creamy dip tastes just like Buffalo chicken wings. It's best served hot with crackers and celery sticks. Everyone loves the results! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3095600.jpg", "meta": [["prep:", "5 mins"], ["cook:", "40 mins"], ["total:", "45 mins"], ["Servings:", "20"], ["Yield:", "5 cups"]], "ingredients": ["2 (10 ounce) cans chunk chicken, drained", "2 (8 ounce) packages cream cheese, softened", "1 cup Ranch dressing", "¾ cup pepper sauce (such as Frank's Red Hot®)", "1 ½ cups shredded Cheddar cheese", "1 bunch celery, cleaned and cut into 4 inch pieces", "1 (8 ounce) box chicken-flavored crackers"], "direction": ["Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers."], "facts": "284 calories; protein 11.1g 22% DV; carbohydrates 8.6g 3% DV; fat 22.6g 35% DV; cholesterol 54.1mg 18% DV; sodium 551.8mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/", "name": "Downeast Maine Pumpkin Bread", "summary": "\nThis is a great old Maine recipe, moist and spicy. The bread actually tastes even better the day after it is baked. Great for holiday gift giving! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4567827.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "24"], ["Yield:", "3 - 7x3 inch loaf pans"]], "ingredients": ["1 (15 ounce) can pumpkin puree", "4  eggs", "1 cup vegetable oil", "⅔ cup water", "3 cups white sugar", "3 ½ cups all-purpose flour", "2 teaspoons baking soda", "1 ½ teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "½ teaspoon ground cloves", "¼ teaspoon ground ginger"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.", "In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.", "Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."], "facts": "263 calories; protein 3.1g 6% DV; carbohydrates 40.6g 13% DV; fat 10.3g 16% DV; cholesterol 31mg 10% DV; sodium 305.4mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/20171/quick-and-easy-pizza-crust/", "name": "Quick and Easy Pizza Crust", "summary": "\nThis is a great recipe when you don't want to wait for the dough to rise.  You just mix it and allow it to rest for 5 minutes and then it's ready to go!!  It yields a soft, chewy crust.  For a real treat, I recommend you use bread flour and bake it on a pizza stone, but all-purpose flour works well too. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F09%2FQuick-and-Easy-Pizza-Crust2-2000.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza crust"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "1 cup warm water (110 degrees F/45 degrees C)", "2 ½ cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.", "Stir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes.", "Turn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving."], "facts": "170 calories; protein 4.8g 10% DV; carbohydrates 28.1g 9% DV; fat 4g 6% DV; cholesterol 0mg; sodium 292.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/17891/golden-sweet-cornbread/", "name": "Golden Sweet Cornbread", "summary": "\nIf you like sweet cornbread, this is the recipe for you! My mom made this for me as a child, and now it's my family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F307059.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 - 9 inch round pan"]], "ingredients": ["1 cup all-purpose flour", "1 cup yellow cornmeal", "⅔ cup white sugar", "1 teaspoon salt", "3 ½ teaspoons baking powder", "1  egg", "1 cup milk", "⅓ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray or lightly grease a 9 inch round cake pan.", "In a large bowl, combine flour, cornmeal, sugar, salt and baking powder. Stir in egg, milk and vegetable oil until well combined. Pour batter into prepared pan.", "Bake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the loaf comes out clean."], "facts": "189 calories; protein 3.1g 6% DV; carbohydrates 28.2g 9% DV; fat 7.4g 11% DV; cholesterol 17.1mg 6% DV; sodium 353.9mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/147103/delicious-egg-salad-for-sandwiches/", "name": "Delicious Egg Salad for Sandwiches", "summary": "\nThis is a wonderful-tasting egg salad sandwich that you will definitely devour. It's really good on rye. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F191517.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "10 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  eggs", "½ cup mayonnaise", "1 teaspoon prepared yellow mustard", "¼ cup chopped green onion", "salt and pepper to taste", "¼ teaspoon paprika"], "direction": ["Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.", "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."], "facts": "344 calories; protein 13g 26% DV; carbohydrates 2.3g 1% DV; fat 31.9g 49% DV; cholesterol 382.5mg 128% DV; sodium 350.6mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/274670/jiffy-corn-casserole/", "name": "Jiffy® Corn Casserole", "summary": "\nMy  mother won an award many, many years ago with this recipe in the Arizona Republic newspaper. I think it is delish and so different from a lot of other corn casseroles. Everybody I know asks for this recipe so I am giving it to everyone! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5932679.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["¼ cup butter", "1 large onion, diced", "½ large green bell pepper, diced", "1 (4 ounce) jar chopped pimento peppers", "2  eggs", "1 (8 ounce) package corn muffin mix (such as Jiffy®)", "1 (4 ounce) can diced green chiles", "1 (15.25 ounce) can whole kernel corn, with liquid", "1 (15.25 ounce) can creamed corn", "1 pint sour cream", "1 cup shredded Cheddar cheese"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.", "Melt butter in a skillet over medium heat. Add onion, bell pepper, and pimento peppers and saute until tender, about 5 minutes.", "Combine eggs, corn muffin mix, green chiles, whole corn, and creamed corn in a large bowl with the onion mixture. Stir together and pour into the prepared baking pan. Drop sour cream by the spoonful on top of the mixture; cover with Cheddar cheese.", "Bake in the preheated oven until casserole is firm, about 45 minutes."], "facts": "527 calories; protein 15.9g 32% DV; carbohydrates 46.8g 15% DV; fat 32.8g 51% DV; cholesterol 125.3mg 42% DV; sodium 993mg 40% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/51301/sarahs-applesauce/", "name": "Sarah's Applesauce", "summary": "\nThis applesauce is delicious! I make it for my younger brother all the time and he loves it - and he hates canned applesauce! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F25840.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  apples - peeled, cored and chopped", "¾ cup water", "¼ cup white sugar", "½ teaspoon ground cinnamon"], "direction": ["In a saucepan, combine apples, water, sugar, and cinnamon. Cover, and cook over medium heat for 15 to 20 minutes, or until apples are soft. Allow to cool, then mash with a fork or potato masher."], "facts": "121 calories; protein 0.4g 1% DV; carbohydrates 31.8g 10% DV; fat 0.2g; cholesterol 0mg; sodium 2.7mg."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/278981/grandmas-chocolate-texas-sheet-cake/", "name": "Grandma's Chocolate Texas Sheet Cake", "summary": "\nThis is hands-down my all-time favorite cake! I fell in love making it after my grandmother shared the recipe with me. This cake is super quick, easy, and fun to make! Definitely recommend this for first time bakers and anyone else who would love to take a bite out of a delicious chocolate Texas sheet cake. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2341793.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "24"], ["Yield:", "1 10x15-inch cake"]], "ingredients": ["1 cup salted butter", "1 cup water", "3 tablespoons cocoa powder", "2 cups all-purpose flour", "2 cups white sugar", "½ teaspoon salt", "½ cup buttermilk", "2 large eggs", "1 teaspoon baking soda", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10x15-inch cake pan.", "Combine butter, water, and cocoa powder for cake in a saucepan over medium heat. Cook until butter has melted and mixture comes to a boil. Remove from the heat and cool slightly.", "Meanwhile, mix flour, sugar, and salt together in a large bowl. Beat buttermilk, eggs, baking soda, and vanilla extract together in a separate bowl.", "Add melted butter mixture to the flour mixture, then add buttermilk-egg mixture and beat until thoroughly combined. Pour into the prepared cake pan.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Remove cake from the oven and cool on a wire rack for 5 minutes.", "Meanwhile, combine butter, milk, cocoa powder, and vanilla extract for the frosting in a saucepan over medium heat. Stir until butter melts, then stir in powdered sugar. Spread frosting over the warm cake."], "facts": "259 calories; protein 2.3g 5% DV; carbohydrates 36.3g 12% DV; fat 12.3g 19% DV; cholesterol 46.5mg 16% DV; sodium 169.6mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/276472/pumpkin-shaped-dinner-rolls/", "name": "Pumpkin-Shaped Dinner Rolls", "summary": "\nThis very Instagram-friendly roll is the perfect thing to bring to that holiday gathering, and can be made using your favorite dinner roll recipe. Sure, these take longer to make than your already perfectly fine dinner rolls, but that's nothing when you consider all the compliments that will be coming your way. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7134118.jpg", "meta": [["prep:", "30 mins"], ["cook:", "20 mins"], ["additional:", "2 hrs 30 mins"], ["total:", "3 hrs 20 mins"], ["Servings:", "12"], ["Yield:", "12 rolls"]], "ingredients": ["1 cup warm milk", "1 (.25 ounce) package active dry yeast", "1 tablespoon honey, or more to taste", "4 tablespoons melted butter", "1 teaspoon fine salt", "3 cups all-purpose flour, or more as needed", "kitchen string (4 per roll)", "vegetable oil, or as needed"], "direction": ["Combine warm milk, yeast, honey, and butter in a bowl; stir. Add salt and most of the flour, reserving the rest for dusting. Stir using a wooden spoon until a sticky dough forms.", "Dust a work surface with the leftover flour. Knead the dough until smooth, elastic, and no longer sticky, adding more flour as needed. Form dough into a ball that springs back lightly when pressed.", "Transfer dough to a lightly greased bowl, cover with greased foil, and let rise in a warm place until doubled in size, about 1 1/2 hours.", "Meanwhile, cut kitchen string into 4 dozen 8- to 10-inch strands. Place strings in a bowl and toss with oil to coat; set aside.", "Press risen dough down on a work surface; reserve 3 to 4 tablespoons for forming \"stems.\" Cut remaining dough in half and cut each half into 6 wedges. Roll each into a round ball by cupping your hand over the dough and pressing and rolling lightly in a circular motion for 10 to 15 seconds. Cover and let rest for 15 minutes.", "Preheat the oven to 375 degrees F (190 degrees C). Line 2 baking sheets with silicone liners.", "Place 4 pieces of string on your work surface. Crisscross strings over a center point into a star formation. Place a dough ball, smooth side-down, onto the center point. Firmly tie each string into a knot over the center of the roll. Snip off excess string using scissors.", "Place tied roll onto a prepared baking sheet, knot side-down. Repeat with remaining strings and dough balls.", "Let rolls rise for about 30 minutes.", "Sift a little flour on top of rolls. Shape reserved dough into \"stems\" and place them on the sheet next to the rolls.", "Bake in the center of the preheated oven until lightly browned, 20 to 25 minutes.", "Remove from the oven and let cool until safe to handle, about 15 minutes. Cut strings off of each roll at the tops and peel down carefully and slowly to remove. Cut a small hole in the tops of each roll and press \"stems\" into each hole. Transfer pumpkin rolls to a serving platter."], "facts": "175 calories; protein 4.2g 8% DV; carbohydrates 26.5g 9% DV; fat 5.7g 9% DV; cholesterol 11.8mg 4% DV; sodium 230.4mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/7679/nutmeg-cake/", "name": "Nutmeg Cake", "summary": "\nThis is not that common of a cake, but it sure is good. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1066891.jpg", "meta": [["prep:", "35 mins"], ["cook:", "25 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs"], ["Servings:", "12"], ["Yield:", "2 9-inch layers"]], "ingredients": ["3  eggs, room temperature", "½ cup butter, softened", "1 ½ cups white sugar", "1 cup buttermilk", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "2 teaspoons ground nutmeg", "¼ teaspoon salt"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9-inch round cake pans.", "Beat the butter and white sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs in three batches, blending them into the butter mixture fully. Stir in the vanilla.", "Sift together the flour, baking powder, baking soda, nutmeg, and salt.", "Pour 1/3 of the flour mixture into the bowl; mix just until incorporated. Stir in 1/2 the buttermilk, mixing gently. Continue adding the flour alternately with the buttermilk, mixing until combined. Spread the batter into the prepared pans.", "Bake in the preheated oven until a toothpick inserted in the center of the cakes comes out clean, about 25 to 30 minutes. Let the cakes cool in the pans for 10 minutes, then invert them on a wire rack to cool completely before icing.", "To make the Caramel Icing: In a medium saucepan, heat the brown sugar, cream or milk, and 1/4 cup butter until it boils. Boil for 2 minutes, then remove from heat. Let cool. Stir in confectioner's sugar and beat until smooth. Add more cream or milk or confectioner's sugar as needed to achieve desired spreading consistency. Makes about 1 1/3 cups."], "facts": "410 calories; protein 4.6g 9% DV; carbohydrates 66.4g 21% DV; fat 14.7g 23% DV; cholesterol 82.9mg 28% DV; sodium 319.3mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/276135/mini-brownie-turkeys/", "name": "Mini Brownie Turkeys", "summary": "\nMiniature brownies are the perfect little bite, and dressing them up for Thanksgiving makes a fun project to do with your kiddos or grands! Makes a great kid-friendly addition to your Thanksgiving dessert table. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7074829.jpg", "meta": [["prep:", "30 mins"], ["cook:", "15 mins"], ["additional:", "25 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "12"], ["Yield:", "12 mini brownies"]], "ingredients": ["nonstick cooking spray (such as BakeEasy®)"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Spray a 12-cup mini muffin tin with cooking spray.", "Cream 1/4 cup butter and sugar together in a bowl with an electric mixer. Add egg and vanilla extract; mix well. Stir flour, cocoa powder, baking powder, and salt together in a separate bowl. Add flour mixture to butter mixture and mix until batter is smooth. Divide batter evenly among the prepared muffin cups.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 14 minutes. Cool in the tin for 5 minutes. Transfer to a wire rack and let cool, about 20 minutes.", "Meanwhile, combine butter, cocoa powder, and milk in a bowl and mix with an electric mixer until smooth. Gradually add powdered sugar and mix until frosting is smooth and fluffy.", "Spoon frosting in a piping bag fitted with a Wilton #10 tip. Pipe a circle of frosting near the bottom half of each mini brownie to create the turkey's head. Add two candy eyes. Add 1 red chocolate piece to form the beak. Pipe 5 lines of frosting in the shape of a semi-circle formation coming up from the head. Place a piece of candy corn on each of the 5 lines to form the turkey's feathers."], "facts": "201 calories; protein 1.5g 3% DV; carbohydrates 32.3g 10% DV; fat 8.2g 13% DV; cholesterol 33.6mg 11% DV; sodium 86mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/260996/stuffed-hasselback-turkey-breast/", "name": "Stuffed Hasselback Turkey Breast", "summary": "\nMuch easier than a traditional roast turkey, this sliced and stuffed turkey breast takes far less time than a whole bird, and it's perfect for an everyday or holiday dinner for a smaller group. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4573281.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr 10 mins"], ["additional:", "25 mins"], ["total:", "1 hr 55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup diced onion", "½ cup diced celery", "1 tablespoon butter", "2 cups small dry bread cubes", "1 teaspoon poultry seasoning (dried sage, rosemary, and thyme)", "½ teaspoon kosher salt", "1 pinch ground pepper, or to taste", "1 pinch cayenne pepper, or to taste", "1 cup hot chicken broth", "1 large egg yolk"], "direction": ["Melt 2 tablespoons butter in a skillet over medium heat. Add onions and celery; cook and stir until golden brown, about 6 minutes. Remove from heat.", "Place bread cubes, poultry seasoning, cooked onions and celery, salt, and pepper in a mixing bowl. Pour in chicken broth. Toss until thoroughly blended. Let mixture rest for about 15 minutes to allow broth to absorb into the stuffing. Add egg yolk; stir until evenly incorporated.", "Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper.", "Slice turkey breast crosswise in 3/4-inch slices down to the bone (do not cut through the bone). Divide stuffing mixture among the spaces between the slices. Transfer turkey breast to prepared baking sheet. Brush with melted butter.", "Roast in preheated oven until richly browned, 60 to 75 minutes. An instant-read thermometer inserted near the bone should read 150 degrees F (65 degrees C). Remove from oven and let rest 10 minutes before slicing sections from bone."], "facts": "1003 calories; protein 93.5g 187% DV; carbohydrates 79.4g 26% DV; fat 31.4g 48% DV; cholesterol 281.6mg 94% DV; sodium 2405.5mg 96% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/240329/thanksgiving-refreshment/", "name": "Thanksgiving Refreshment", "summary": "\nSparkling juice beverage. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1766759.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 drink"]], "ingredients": ["½ cup ice, or as desired", "8 fluid ounces cranberry juice cocktail, chilled", "2 fluid ounces sparkling water", "1  lime wedge"], "direction": ["Fill a tall glass with ice; add cranberry juice and top with sparkling water. Garnish drink with a lime wedge."], "facts": "138 calories; protein 0g; carbohydrates 34.7g 11% DV; fat 0.3g; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13462/cornucopia/", "name": "Cornucopia", "summary": "\nAn easy Cornucopia centerpiece for your Thanksgiving table. Fill the cornucopia with the assorted raw vegetables directly on table and let them spill out of opening  NOTE- To prevent this center-piece from absorbing atmospheric moisture, the baked cornucopia cone can be sprayed with shellac or clear enamel. If treated in this manner, the cornucopia will be inedible but can be preserved and re-used. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F523755.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["additional:", "25 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "1"], ["Yield:", "1 large centerpiece"]], "ingredients": ["3 (11 ounce) containers refrigerated soft bread stick dough", "1  egg", "1 tablespoon water"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly spray a 17x14 inch (or lager) cookie sheet with non-stick cooking spray.", "Tear off a 30x18 inch sheet of heavy duty aluminum foil. Fold it in half to 18x15 inch. Roll diagonally to form a hollow cone, about 18 inches long with a diameter of 5 inches at the widest end (Cornucopia opening). Fasten end with clear tape. Stuff cone with crumpled regular foil until form is rigid. Bend tail of cone up then down at end. Spray outside of cone with non-stick cooking spray. Place on cookie sheet.", "Beat the egg with the water to make a glaze. Open and unroll the first can of breadstick dough on work surface. Separate breadsticks. Begin by wrapping one breadstick around tip of cone. Brush end of next breadstick with Glaze and press to attach to end of first breadstick. Continue spiral-wrapping cone, slightly overlapping dough until there are 3 breadsticks left.", "Pinch one end of the 3 breadsticks together, then braid. Brush bread around opening of cornucopia with glaze. Gently press on braid. Brush entire cornucopia with glaze.", "Bake at 350 degrees F (175 degrees C) for 45 minutes or until bread is a rich brown. (If parts start to darken too much, cover them with pieces of foil.)", "Remove from oven and let cool completely on cookie sheet on a wire rack. Carefully remove foil when cool. (If freezing, leave foil in bread for support. Remove when thawed.)"], "facts": "2639 calories; protein 72g 144% DV; carbohydrates 455.8g 152% DV; fat 48g 74% DV; cholesterol 0mg; sodium 6957.1mg 290% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/46653/taco-seasoning-i/", "name": "Taco Seasoning I", "summary": "\nDepending on how spicy you and your family like your dishes, use as little or as much as you want. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4538211.jpg", "meta": [["prep:", "1 min"], ["total:", "1 min"], ["Servings:", "10"], ["Yield:", "1 ounce"]], "ingredients": ["1 tablespoon chili powder", "¼ teaspoon garlic powder", "¼ teaspoon onion powder", "¼ teaspoon crushed red pepper flakes", "¼ teaspoon dried oregano", "½ teaspoon paprika", "1 ½ teaspoons ground cumin", "1 teaspoon sea salt", "1 teaspoon black pepper"], "direction": ["In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container."], "facts": "5 calories; protein 0.2g; carbohydrates 0.9g; fat 0.2g; cholesterol 0mg; sodium 184.8mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "name": "Apple Pie by Grandma Ople", "summary": "\nThis was my grandmother's apple pie recipe.  I have never seen another one quite like it.  It will always be my favorite and has won me several first place prizes in local competitions.  I hope it becomes one of your favorites as well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F736203.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "½ cup unsalted butter", "3 tablespoons all-purpose flour", "¼ cup water", "½ cup white sugar", "½ cup packed brown sugar", "8  Granny Smith apples - peeled, cored and sliced"], "direction": ["Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.", "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.", "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."], "facts": "512 calories; protein 3.6g 7% DV; carbohydrates 67.8g 22% DV; fat 26.7g 41% DV; cholesterol 30.5mg 10% DV; sodium 240.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/229733/simple-roasted-butternut-squash/", "name": "Simple Roasted Butternut Squash", "summary": "\nButternut squash is so good on its own, that barely any seasoning is needed. This recipe is so simple and easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F957758.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  butternut squash - peeled, seeded, and cut into 1-inch cubes", "2 tablespoons olive oil", "2 cloves garlic, minced", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Toss butternut squash with olive oil and garlic in a large bowl. Season with salt and black pepper. Arrange coated squash on a baking sheet.", "Roast in the preheated oven until squash is tender and lightly browned, 25 to 30 minutes."], "facts": "177 calories; protein 2.6g 5% DV; carbohydrates 30.3g 10% DV; fat 7g 11% DV; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/14231/guacamole/", "name": "Guacamole", "summary": "\nYou can make this avocado salad smooth or chunky depending on your tastes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521556.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3  avocados - peeled, pitted, and mashed", "1  lime, juiced", "1 teaspoon salt", "½ cup diced onion", "3 tablespoons chopped fresh cilantro", "2  roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper  (Optional)"], "direction": ["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."], "facts": "262 calories; protein 3.7g 7% DV; carbohydrates 18g 6% DV; fat 22.2g 34% DV; cholesterol 0mg; sodium 595.7mg 24% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/", "name": "Juicy Roasted Chicken", "summary": "\nMy grandmother's recipe for roasted chicken. We are German and she used to do it this way all the time. I never have had a chicken this juicy before; this little trick works and makes the people eating it go silent. It's funny. We nibble on the celery after. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389250.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 15 mins"], ["additional:", "15 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (3 pound) whole chicken, giblets removed", "salt and black pepper to taste", "1 tablespoon onion powder, or to taste", "½ cup margarine, divided", "1 stalk celery, leaves removed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.", "Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."], "facts": "423 calories; protein 30.9g 62% DV; carbohydrates 1.2g; fat 32.1g 49% DV; cholesterol 97mg 32% DV; sodium 661.9mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13768/roasted-pumpkin-seeds/", "name": "Roasted Pumpkin Seeds", "summary": "\nHere is an easy recipe for roasting fresh pumpkin seeds. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F729337.jpg", "meta": [["Servings:", "6"], ["Yield:", "1 1/2 cups"]], "ingredients": ["1 ½ cups raw whole pumpkin seeds", "2 teaspoons butter, melted", "1 pinch salt"], "direction": ["Preheat oven to 300 degrees F (150 degrees C).", "Toss seeds in a bowl with the melted butter and salt. Spread the seeds in a single layer on a baking sheet and bake for about 45 minutes or until golden brown; stir occasionally."], "facts": "83 calories; protein 3g 6% DV; carbohydrates 8.6g 3% DV; fat 4.5g 7% DV; cholesterol 3.6mg 1% DV; sodium 12.5mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/", "name": "Good Old Fashioned Pancakes", "summary": "\nThis is a great recipe that I found in my Grandma's recipe book. Judging from the weathered look of this recipe card, this was a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F05%2F07%2FGood-Old-Fashioned-Pancakes-2000.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 ½ cups all-purpose flour", "3 ½ teaspoons baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1 ¼ cups milk", "1  egg", "3 tablespoons butter, melted"], "direction": ["In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.", "Heat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot."], "facts": "158 calories; protein 4.5g 9% DV; carbohydrates 21.7g 7% DV; fat 5.9g 9% DV; cholesterol 37.7mg 13% DV; sodium 503.6mg 20% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/", "name": "Banana Banana Bread", "summary": "\nWhy compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F4565477.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 loaf"]], "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2  eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "facts": "229 calories; protein 3.8g 8% DV; carbohydrates 34.8g 11% DV; fat 8.8g 14% DV; cholesterol 51.3mg 17% DV; sodium 222.9mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "name": "Best Chocolate Chip Cookies", "summary": "\nCrisp edges, chewy middles. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Fbest-chocolate-chip-cookies.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "24"], ["Yield:", "4 dozen"]], "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2  eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "½ teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.", "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."], "facts": "298 calories; protein 3.6g 7% DV; carbohydrates 38.9g 13% DV; fat 15.6g 24% DV; cholesterol 35.8mg 12% DV; sodium 165.8mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/9870/easy-sugar-cookies/", "name": "Easy Sugar Cookies", "summary": "\nQuick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F12%2Feasy-sugar-cookies.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "48"], ["Yield:", "4 dozen"]], "ingredients": ["2 ¾ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon baking powder", "1 cup butter, softened", "1 ½ cups white sugar", "1  egg", "1 teaspoon vanilla extract"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "facts": "86 calories; protein 0.9g 2% DV; carbohydrates 11.7g 4% DV; fat 4g 6% DV; cholesterol 14mg 5% DV; sodium 60.1mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/10549/best-brownies/", "name": "Best Brownies", "summary": "\nThese brownies always turn out! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2014%2F09%2F1090243_-Best-Brownies-Photo-by-Paula.jpg", "meta": [["prep:", "25 mins"], ["cook:", "35 mins"], ["total:", "1 hr"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["½ cup butter", "1 cup white sugar", "2  eggs", "1 teaspoon vanilla extract", "⅓ cup unsweetened cocoa powder", "½ cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking powder"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.", "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.", "Bake in preheated oven for 25 to 30 minutes. Do not overcook.", "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."], "facts": "183 calories; protein 1.8g 4% DV; carbohydrates 25.7g 8% DV; fat 9g 14% DV; cholesterol 44.2mg 15% DV; sodium 109.7mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/92462/slow-cooker-texas-pulled-pork/", "name": "Slow Cooker Texas Pulled Pork", "summary": "\nSlow cooked, Texas-style pulled pork that is served on a buttered and toasted roll.  My family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4560053.jpg", "meta": [["prep:", "15 mins"], ["cook:", "5 hrs"], ["total:", "5 hrs 15 mins"], ["Servings:", "8"], ["Yield:", "8 sandwiches"]], "ingredients": ["1 teaspoon vegetable oil", "1 (4 pound) pork shoulder roast", "1 cup barbeque sauce", "½ cup apple cider vinegar", "½ cup chicken broth", "¼ cup light brown sugar", "1 tablespoon prepared yellow mustard", "1 tablespoon Worcestershire sauce", "1 tablespoon chili powder", "1 extra large onion, chopped", "2 large cloves garlic, crushed", "1 ½ teaspoons dried thyme", "8  hamburger buns, split", "2 tablespoons butter, or as needed"], "direction": ["Pour the vegetable oil into the bottom of a slow cooker. Place the pork roast into the slow cooker; pour in the barbecue sauce, apple cider vinegar, and chicken broth. Stir in the brown sugar, yellow mustard, Worcestershire sauce, chili powder, onion, garlic, and thyme. Cover and cook on High until the roast shreds easily with a fork, 5 to 6 hours.", "Remove the roast from the slow cooker, and shred the meat using two forks. Return the shredded pork to the slow cooker, and stir the meat into the juices.", "Spread the inside of both halves of hamburger buns with butter. Toast the buns, butter side down, in a skillet over medium heat until golden brown. Spoon pork into the toasted buns."], "facts": "528 calories; protein 31.9g 64% DV; carbohydrates 45.5g 15% DV; fat 23.2g 36% DV; cholesterol 98.4mg 33% DV; sodium 802.7mg 32% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/", "name": "Apple Crisp II", "summary": "\nA simple dessert that's great served with ice cream. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277929.jpg", "meta": [["prep:", "30 mins"], ["cook:", "45 mins"], ["additional:", "5 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "12"], ["Yield:", "1 9x13-inch pan"]], "ingredients": ["10 cups all-purpose apples, peeled, cored and sliced", "1 cup white sugar", "1 tablespoon all-purpose flour", "1 teaspoon ground cinnamon", "½ cup water", "1 cup quick-cooking oats", "1 cup all-purpose flour", "1 cup packed brown sugar", "¼ teaspoon baking powder", "¼ teaspoon baking soda", "½ cup butter, melted"], "direction": ["Preheat oven to 350 degrees F (175 degree C).", "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.", "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.", "Bake at 350 degrees F (175 degrees C) for about 45 minutes."], "facts": "316 calories; protein 2.4g 5% DV; carbohydrates 60.5g 20% DV; fat 8.4g 13% DV; cholesterol 20.3mg 7% DV; sodium 97.9mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/23439/perfect-pumpkin-pie/", "name": "Perfect Pumpkin Pie", "summary": "\nThe one and only!  EAGLE BRAND® makes this traditional dessert the perfect ending to a Thanksgiving feast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895606.jpg", "meta": [["prep:", "15 mins"], ["cook:", "55 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "1 - 9 inch pie"]], "ingredients": ["1 (15 ounce) can pumpkin", "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk", "2  large eggs", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "½ teaspoon salt", "1 (9 inch) unbaked pie crust"], "direction": ["Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.", "Reduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."], "facts": "379 calories; protein 5.9g 12% DV; carbohydrates 30.5g 10% DV; fat 14.3g 22% DV; cholesterol 64mg 21% DV; sodium 352.1mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/11679/homemade-mac-and-cheese/", "name": "Homemade Mac and Cheese", "summary": "\nThis is a nice rich mac and cheese.  Serve with a salad for a great meatless dinner. Hope you enjoy it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6174584.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces uncooked elbow macaroni", "2 cups shredded sharp Cheddar cheese", "½ cup grated Parmesan cheese", "3 cups milk", "¼ cup butter", "2 ½ tablespoons all-purpose flour", "2 tablespoons butter", "½ cup bread crumbs", "1 pinch paprika"], "direction": ["Cook macaroni according to the package directions.  Drain.", "In a saucepan, melt butter or margarine over medium heat.  Stir in enough flour to make a roux.  Add milk to roux slowly, stirring constantly.  Stir in cheeses, and cook over low heat until cheese is melted and the sauce is a little thick.  Put macaroni in large casserole dish, and pour sauce over macaroni.  Stir well.", "Melt butter or margarine in a skillet over medium heat.  Add breadcrumbs and brown.  Spread over the macaroni and cheese to cover.  Sprinkle with a little paprika.", "Bake at 350 degrees F (175 degrees C) for 30 minutes. Serve."], "facts": "858 calories; protein 37.7g 75% DV; carbohydrates 66.7g 22% DV; fat 48.7g 75% DV; cholesterol 141.6mg 47% DV; sodium 879.3mg 35% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/174347/quick-and-almost-professional-buttercream-icing/", "name": "Quick and Almost-Professional Buttercream Icing", "summary": "\nAfter failing to find the perfect recipe for buttercream icing, I found one that worked for me and then added my own two cents. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F572806.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "2 1/2 cups"]], "ingredients": ["½ cup unsalted butter, softened", "1 ½ teaspoons vanilla extract", "2 cups confectioners' sugar, sifted", "2 tablespoons milk", "3 drops food coloring, or as needed  (Optional)"], "direction": ["Cream room temperature butter with a hand mixer, the paddle attachment of a stand mixer, or a wooden spoon until smooth and fluffy. Gradually beat in confectioners' sugar until fully incorporated. Beat in vanilla extract.", "Pour in milk and beat for an additional 3 to 4 minutes. Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached."], "facts": "228 calories; protein 0.2g 1% DV; carbohydrates 31.5g 10% DV; fat 11.6g 18% DV; cholesterol 30.8mg 10% DV; sodium 83.7mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/77981/butternut-squash-soup-ii/", "name": "Butternut Squash Soup II", "summary": "\nThis is a thick, rich soup with tons of flavor. Something I whipped up off the top of my head, with things I had on hand. Super easy, quick, and a great way to use squash. An instant hit at my house. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F964341.jpg", "meta": [["prep:", "25 mins"], ["cook:", "45 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons butter", "1 small onion, chopped", "1 stalk celery, chopped", "1 medium carrot, chopped", "2 medium potatoes, cubed", "1 medium butternut squash - peeled, seeded, and cubed", "1 (32 fluid ounce) container chicken stock", "salt and freshly ground black pepper to taste"], "direction": ["Melt the butter in a large pot, and cook the onion, celery, carrot, potatoes, and squash 5 minutes, or until lightly browned. Pour in enough of the chicken stock to cover vegetables. Bring to a boil. Reduce heat to low, cover pot, and simmer 40 minutes, or until all vegetables are tender.", "Transfer the soup to a blender, and blend until smooth. Return to pot, and mix in any remaining stock to attain desired consistency. Season with salt and pepper."], "facts": "305 calories; protein 6.9g 14% DV; carbohydrates 59.7g 19% DV; fat 6.8g 11% DV; cholesterol 20.9mg 7% DV; sodium 1151.4mg 46% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/", "name": "Homemade Fresh Pumpkin Pie", "summary": "\nThis recipe is made from fresh pumpkin, not canned. Hope you enjoy it as much as my family does.  Happy Thanksgiving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1071493.jpg", "meta": [["prep:", "20 mins"], ["cook:", "40 mins"], ["total:", "1 hr"], ["Servings:", "8"], ["Yield:", "1 pie"]], "ingredients": ["1 ⅓ cups all-purpose flour", "½ teaspoon salt", "½ cup shortening", "3 ½ tablespoons cold water"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Prepare pie crust by mixing together the flour and salt. Cut shortening into flour; add cold water 1 tablespoon at a time (you may need only 3 tablespoons, or up to 4 tablespoons). Mix dough and repeat until dough is moist enough to hold together.", "With lightly floured, hands shape dough into a ball. On a lightly floured board roll dough out to about 1/8 inch thickness. With a sharp knife, cut dough 1 1/2 inch larger than the upside-down 8- to 9-inch pie pan. Gently roll the dough around the rolling pin and transfer it right-side up onto the pie pan. Unroll, easing dough into the bottom of the pie pan.", "In a large bowl, beat pumpkin with evaporated milk, eggs, brown sugar, cinnamon, ginger, nutmeg and salt with an electric mixer or immersion blender. Mix well. Pour into a prepared crust. Bake 40 minutes or until when a knife is inserted 1 inch from the edge comes out clean."], "facts": "363 calories; protein 7.4g 15% DV; carbohydrates 44.3g 14% DV; fat 18g 28% DV; cholesterol 60.2mg 20% DV; sodium 365.3mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/16383/basic-crepes/", "name": "Basic Crepes", "summary": "\nHere is a simple but delicious crepe batter which can be made in minutes. It's made from ingredients that everyone has on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1266.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "8 crepes"]], "ingredients": ["1 cup all-purpose flour", "2  eggs", "½ cup milk", "½ cup water", "¼ teaspoon salt", "2 tablespoons butter, melted"], "direction": ["In a large mixing bowl, whisk together the flour and the eggs. Gradually add in the milk and water, stirring to combine. Add the salt and butter; beat until smooth.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly.", "Cook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot."], "facts": "216 calories; protein 7.4g 15% DV; carbohydrates 25.5g 8% DV; fat 9.2g 14% DV; cholesterol 110.7mg 37% DV; sodium 235.3mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/", "name": "Buffalo Chicken Dip", "summary": "\nThis tangy, creamy dip tastes just like Buffalo chicken wings. It's best served hot with crackers and celery sticks. Everyone loves the results! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3095600.jpg", "meta": [["prep:", "5 mins"], ["cook:", "40 mins"], ["total:", "45 mins"], ["Servings:", "20"], ["Yield:", "5 cups"]], "ingredients": ["2 (10 ounce) cans chunk chicken, drained", "2 (8 ounce) packages cream cheese, softened", "1 cup Ranch dressing", "¾ cup pepper sauce (such as Frank's Red Hot®)", "1 ½ cups shredded Cheddar cheese", "1 bunch celery, cleaned and cut into 4 inch pieces", "1 (8 ounce) box chicken-flavored crackers"], "direction": ["Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers."], "facts": "284 calories; protein 11.1g 22% DV; carbohydrates 8.6g 3% DV; fat 22.6g 35% DV; cholesterol 54.1mg 18% DV; sodium 551.8mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/", "name": "Downeast Maine Pumpkin Bread", "summary": "\nThis is a great old Maine recipe, moist and spicy. The bread actually tastes even better the day after it is baked. Great for holiday gift giving! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4567827.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "24"], ["Yield:", "3 - 7x3 inch loaf pans"]], "ingredients": ["1 (15 ounce) can pumpkin puree", "4  eggs", "1 cup vegetable oil", "⅔ cup water", "3 cups white sugar", "3 ½ cups all-purpose flour", "2 teaspoons baking soda", "1 ½ teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "½ teaspoon ground cloves", "¼ teaspoon ground ginger"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.", "In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.", "Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."], "facts": "263 calories; protein 3.1g 6% DV; carbohydrates 40.6g 13% DV; fat 10.3g 16% DV; cholesterol 31mg 10% DV; sodium 305.4mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/", "name": "Original Nestle® Toll House Chocolate Chip Cookies", "summary": "\nThis famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4109813.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 mins"], ["additional:", "15 mins"], ["total:", "39 mins"], ["Servings:", "60"], ["Yield:", "60 servings"]], "ingredients": ["2 ¼ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 cup butter, softened", "¾ cup granulated sugar", "¾ cup packed brown sugar", "1 teaspoon vanilla extract", "2  large eggs", "2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels", "1 cup chopped nuts"], "direction": ["Preheat oven to 375 degrees F.", "Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets.", "Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely."], "facts": "108 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 6.2g 10% DV; cholesterol 14.3mg 5% DV; sodium 84.8mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/20171/quick-and-easy-pizza-crust/", "name": "Quick and Easy Pizza Crust", "summary": "\nThis is a great recipe when you don't want to wait for the dough to rise.  You just mix it and allow it to rest for 5 minutes and then it's ready to go!!  It yields a soft, chewy crust.  For a real treat, I recommend you use bread flour and bake it on a pizza stone, but all-purpose flour works well too. Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F09%2FQuick-and-Easy-Pizza-Crust2-2000.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "1 12-inch pizza crust"]], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "1 cup warm water (110 degrees F/45 degrees C)", "2 ½ cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "direction": ["Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.", "Stir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes.", "Turn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving."], "facts": "170 calories; protein 4.8g 10% DV; carbohydrates 28.1g 9% DV; fat 4g 6% DV; cholesterol 0mg; sodium 292.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/17891/golden-sweet-cornbread/", "name": "Golden Sweet Cornbread", "summary": "\nIf you like sweet cornbread, this is the recipe for you! My mom made this for me as a child, and now it's my family's favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F307059.jpg", "meta": [["prep:", "10 mins"], ["cook:", "25 mins"], ["total:", "35 mins"], ["Servings:", "12"], ["Yield:", "1 - 9 inch round pan"]], "ingredients": ["1 cup all-purpose flour", "1 cup yellow cornmeal", "⅔ cup white sugar", "1 teaspoon salt", "3 ½ teaspoons baking powder", "1  egg", "1 cup milk", "⅓ cup vegetable oil"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Spray or lightly grease a 9 inch round cake pan.", "In a large bowl, combine flour, cornmeal, sugar, salt and baking powder. Stir in egg, milk and vegetable oil until well combined. Pour batter into prepared pan.", "Bake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the loaf comes out clean."], "facts": "189 calories; protein 3.1g 6% DV; carbohydrates 28.2g 9% DV; fat 7.4g 11% DV; cholesterol 17.1mg 6% DV; sodium 353.9mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/147103/delicious-egg-salad-for-sandwiches/", "name": "Delicious Egg Salad for Sandwiches", "summary": "\nThis is a wonderful-tasting egg salad sandwich that you will definitely devour. It's really good on rye. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F191517.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "10 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  eggs", "½ cup mayonnaise", "1 teaspoon prepared yellow mustard", "¼ cup chopped green onion", "salt and pepper to taste", "¼ teaspoon paprika"], "direction": ["Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.", "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."], "facts": "344 calories; protein 13g 26% DV; carbohydrates 2.3g 1% DV; fat 31.9g 49% DV; cholesterol 382.5mg 128% DV; sodium 350.6mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/274670/jiffy-corn-casserole/", "name": "Jiffy® Corn Casserole", "summary": "\nMy  mother won an award many, many years ago with this recipe in the Arizona Republic newspaper. I think it is delish and so different from a lot of other corn casseroles. Everybody I know asks for this recipe so I am giving it to everyone! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5932679.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["¼ cup butter", "1 large onion, diced", "½ large green bell pepper, diced", "1 (4 ounce) jar chopped pimento peppers", "2  eggs", "1 (8 ounce) package corn muffin mix (such as Jiffy®)", "1 (4 ounce) can diced green chiles", "1 (15.25 ounce) can whole kernel corn, with liquid", "1 (15.25 ounce) can creamed corn", "1 pint sour cream", "1 cup shredded Cheddar cheese"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.", "Melt butter in a skillet over medium heat. Add onion, bell pepper, and pimento peppers and saute until tender, about 5 minutes.", "Combine eggs, corn muffin mix, green chiles, whole corn, and creamed corn in a large bowl with the onion mixture. Stir together and pour into the prepared baking pan. Drop sour cream by the spoonful on top of the mixture; cover with Cheddar cheese.", "Bake in the preheated oven until casserole is firm, about 45 minutes."], "facts": "527 calories; protein 15.9g 32% DV; carbohydrates 46.8g 15% DV; fat 32.8g 51% DV; cholesterol 125.3mg 42% DV; sodium 993mg 40% DV."}, {"type": "By Holidays and Events  ", "package": "more_holidays_and_events", "link": "https://www.allrecipes.com/recipe/51301/sarahs-applesauce/", "name": "Sarah's Applesauce", "summary": "\nThis applesauce is delicious! I make it for my younger brother all the time and he loves it - and he hates canned applesauce! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F25840.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  apples - peeled, cored and chopped", "¾ cup water", "¼ cup white sugar", "½ teaspoon ground cinnamon"], "direction": ["In a saucepan, combine apples, water, sugar, and cinnamon. Cover, and cook over medium heat for 15 to 20 minutes, or until apples are soft. Allow to cool, then mash with a fork or potato masher."], "facts": "121 calories; protein 0.4g 1% DV; carbohydrates 31.8g 10% DV; fat 0.2g; cholesterol 0mg; sodium 2.7mg."}]