[{"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/235449/skillet-braised-brussels-sprouts/", "name": "Skillet-Braised Brussels Sprouts", "summary": "\nBrussels sprouts with bacon and garlic are skillet-braised until tender and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7923937.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 slices thick-cut bacon, sliced into 1/4-inch strips, or more to taste", "1 pound Brussels sprouts, trimmed and halved, or more to taste", "1 clove garlic, thinly sliced, or more to taste", "½ cup chicken stock, or more as needed", "1 tablespoon butter, or to taste", "1 tablespoon balsamic vinegar, or more to taste", "salt and ground black pepper to taste"], "direction": ["Place bacon in a large skillet over medium-low heat; cook until just crisp, about 10 minutes. Transfer bacon to a paper towel-lined plate, reserving bacon grease in skillet.", "Increase heat to medium-high under skillet; saute Brussels sprouts in the bacon grease until lightly browned, 2 to 3 minutes. Add garlic to Brussels sprouts; saute until garlic is fragrant, 1 to 2 minutes.", "Pour chicken stock over Brussels sprouts mixture and cover skillet with a lid; simmer until Brussels sprouts are bright green, 4 to 5 minutes. Remove lid and continue simmering until liquid is evaporated and sprouts are tender, about 5 more minutes.", "Remove skillet from heat and stir bacon, butter, vinegar, salt, and pepper into Brussels sprouts mixture until butter is melted."], "facts": "128 calories; protein 7.3g 15% DV; carbohydrates 11.3g 4% DV; fat 7.1g 11% DV; cholesterol 17.6mg 6% DV; sodium 382.3mg 15% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/231713/chef-johns-baked-mushroom-risotto/", "name": "Chef John's Baked Mushroom Risotto", "summary": "\nThe beginning and the end of this risotto recipe are pretty standard, but we've moved the middle 15 minutes into the oven in an attempt to eliminate those dreaded 'variables.'  Besides being easier and more repeatable, this method produced a risotto that was identical in looks, taste, and texture to anything I can do on the stove. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1207574.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons butter", "3 cups diced mushrooms", "salt to taste", "½  yellow onion, diced", "ground black pepper to taste", "1 pinch cayenne pepper", "1 cup carnaroli rice", "2 cups chicken broth, divided", "½ cup heavy whipping cream", "½ cup chicken broth", "2 tablespoons heavy whipping cream", "½ cup finely grated Parmigiano-Reggiano cheese", "2 tablespoons chopped fresh chives"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Melt butter in large, oven-proof skillet over medium-high heat. Add mushrooms; season with salt, and cook and stir mushrooms until brown. They will begin browning after the moisture evaporates.", "Reduce heat to medium and stir in onion. Sprinkle with black pepper and cayenne pepper. Cook and stir until onions are translucent and soft.", "Pour rice into skillet and stir until each rice grain is coated with butter. Season with salt.", "Pour 1 cup chicken broth into the rice mixture. Raise heat to medium-high and cook, stirring rice until liquid is completely absorbed by the rice.", "Pour another cup chicken stock into the rice and stir until mixture comes to a simmer.", "Bake in preheated oven until grains are almost tender but still slightly firm, about 15 minutes. Transfer skillet to stovetop. Season with more salt, if necessary.", "Combine the remaining 1/2 cup chicken broth and cream; pour into the skillet. Cook on medium heat, stirring constantly until rice is tender, 1 or 2 minutes. Remove skillet from heat.", "Drizzle 2 tablespoons cream over rice. Add the grated Parmigiano-Reggiano and chives; stir. Serve immediately."], "facts": "480 calories; protein 11.1g 22% DV; carbohydrates 51.1g 17% DV; fat 25.9g 40% DV; cholesterol 86.4mg 29% DV; sodium 997.8mg 40% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/241074/easy-garlic-kale/", "name": "Easy Garlic Kale", "summary": "\nKale is supposed to have cancer-fighting properties. I love it, but my husband hates it. Cooking it this way is the only way he'll eat it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2094708.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "5 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch kale", "1 tablespoon olive oil", "1 teaspoon minced garlic"], "direction": ["Soak kale leaves in a large bowl of water until dirt and sand begin to fall to the bottom, about 2 minutes. Lift kale from the bowl without drying the leaves and immediately remove and discard stems. Chop the kale leaves into 1-inch pieces.", "Heat olive oil in a large skillet over medium heat; cook and stir garlic until sizzling, about 1 minute. Add kale to the skillet and place a cover over the top.", "Cook, stirring occasionally with tongs, until kale is bright green and slightly tender, 5 to 7 minutes."], "facts": "87 calories; protein 3.7g 8% DV; carbohydrates 11.4g 4% DV; fat 4.2g 6% DV; cholesterol 0mg; sodium 48.3mg 2% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/79518/hasselback-potatoes/", "name": "Hasselback Potatoes", "summary": "\nThis Swedish dish takes its name from Hasselbacken, the Stockholm restaurant where it was first served. The seasoned potatoes turn out crisp on the outside and tender on the inside. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2918307.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (8 ounce) baking potatoes", "2 tablespoons butter, melted", "salt and pepper to taste", "2 tablespoons finely grated fresh Romano cheese", "1 tablespoon seasoned dry bread crumbs"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C).", "Peel the potatoes, and place in bowl of cold water to prevent browning. Place potatoes into a large wooden or metal spoon. Using a sharp knife, make slices across the potato the short way about 1/8 to 1/4 inch apart, making sure to cut down to the lip of the spoon, not all the way through the potato. The slices should stay connected at the bottom, and the spoon helps keep the depth even. Return the potato to the bowl of water, and proceed with the remaining potatoes.", "When all of the potatoes are cut, place them cut side up in a shallow baking dish or small roasting pan. Drizzle with half of the butter, then season with salt and pepper.", "Bake for 35 to 40 minutes in the preheated oven. Remove from the oven, and drizzle with the remaining butter. Sprinkle Romano cheese and bread crumbs onto the tops of the potatoes, and season with a little more salt and pepper. Return to the oven, and bake for an additional 20 minutes, or until nicely browned."], "facts": "247 calories; protein 6.1g 12% DV; carbohydrates 41.1g 13% DV; fat 7.1g 11% DV; cholesterol 19.2mg 6% DV; sodium 171.2mg 7% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/242232/lemon-couscous/", "name": "Lemon Couscous", "summary": "\nThis is light and fresh and accompanies fish (i.e. habanero-lime butter grilled salmon) and chicken well. It is a refreshing change to the rice or potato side dish, and everyone always loves it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2276861.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "3"], ["Yield:", "3 servings"]], "ingredients": ["1 cup chicken broth", "2 tablespoons fresh lemon juice", "1 tablespoon lemon zest", "1 tablespoon butter", "¼ teaspoon salt", "⅔ cup couscous", "1 (2 ounce) jar sliced pimento peppers, drained", "2 tablespoons toasted pine nuts", "2 tablespoons chopped fresh parsley"], "direction": ["Stir chicken broth, lemon juice, lemon zest, butter, and salt together in a saucepan; bring to a boil. Add couscous to the liquid and stir to coat completely. Place a cover on the saucepan, remove from heat, and let couscous soak in hot liquid until the moisture is mostly absorbed, about 5 minutes.", "Fluff couscous with a fork. Stir pimento peppers, pine nuts, and parsley into the couscous."], "facts": "225 calories; protein 7g 14% DV; carbohydrates 33.2g 11% DV; fat 7.2g 11% DV; cholesterol 11.8mg 4% DV; sodium 549.4mg 22% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/", "name": "Spiced Slow Cooker Applesauce", "summary": "\nThis easy and delicious spiced applesauce slow cooks to perfection. My kids and I came up with this recipe one fall weekend. It's a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277498.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 hrs 30 mins"], ["total:", "6 hrs 40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  apples - peeled, cored, and thinly sliced", "½ cup water", "¾ cup packed brown sugar", "½ teaspoon pumpkin pie spice"], "direction": ["Combine the apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in the brown sugar and pumpkin pie spice; continue cooking another 30 minutes."], "facts": "151 calories; protein 0.4g 1% DV; carbohydrates 39.4g 13% DV; fat 0.2g; cholesterol 0mg; sodium 7.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/239180/greek-style-lemon-roasted-potatoes/", "name": "Greek-Style Lemon Roasted Potatoes", "summary": "\nA great complement with souvlaki. I often cook this on the BBQ with the souvlaki. All you need is a great Greek salad for a full meal! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1439519.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds potatoes, peeled and cut into thick wedges", "⅓ cup olive oil", "2  lemons, juiced", "2 teaspoons salt", "1 teaspoon oregano", "½ teaspoon ground black pepper", "3 cups chicken broth"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Put potato wedges into a large bowl. Drizzle olive oil and lemon juice over the wedges and toss to coat. Season potatoes with salt, oregano, and black pepper; toss again to coat.", "Spread potato wedges in a single layer in a 2 inch-deep pan. Pour chicken broth over the potatoes.", "Roast potatoes in preheated oven until tender and golden brown, about 1 hour."], "facts": "282 calories; protein 4.6g 9% DV; carbohydrates 39.9g 13% DV; fat 12.2g 19% DV; cholesterol 0mg; sodium 789.1mg 32% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/275886/instant-pot-brown-rice/", "name": "Instant Pot® Brown Rice", "summary": "\nI haven't cooked rice on the stove since buying my electric pressure cooker! It's so easy and you can vary it up however you like; add spices or seasonings before cooking or fold in nuts and dried fruit after cooking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7165111.jpg", "meta": [["prep:", "5 mins"], ["cook:", "35 mins"], ["additional:", "10 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "6 cups cooked"]], "ingredients": ["2 ½ cups water", "2 cups brown basmati rice", "1 tablespoon grapeseed oil", "1 teaspoon kosher salt"], "direction": ["Combine water, brown rice, oil, and salt in a multi-functional pressure cooker (such as Instant Pot®). Close and lock the lid. Select Manual; set timer for 25 minutes on high pressure according to manufacturer's instructions. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Carefully release any remaining pressure. Unlock and remove the lid. Fluff rice with a fork or a rice paddle."], "facts": "106 calories; protein 2g 4% DV; carbohydrates 21.2g 7% DV; fat 2.2g 3% DV; cholesterol 0mg; sodium 161.5mg 7% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/163145/creamed-cabbage/", "name": "Creamed Cabbage", "summary": "\nThis is yummy for St. Paddy's Day! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2284428.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4 slices bacon", "¼ cup butter", "1 tablespoon all-purpose flour", "1 teaspoon salt", "1 large head cabbage, cored and shredded", "½ cup sour cream"], "direction": ["Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to cool.", "Whisk the butter, flour, and salt into the drippings in the same pan. Stir in the cabbage, and cook, stirring occasionally, over medium heat until cabbage is tender, about 15 minutes. Crumble the bacon; stir the bacon pieces and sour cream into the cabbage mixture."], "facts": "251 calories; protein 5.6g 11% DV; carbohydrates 14g 5% DV; fat 20.3g 31% DV; cholesterol 41.5mg 14% DV; sodium 645.2mg 26% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/268230/instant-pot-refried-beans/", "name": "Instant Pot® Refried Beans", "summary": "\nMake beans from dried to refried in less than an hour through the courtesy of your Instant Pot®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6252480.jpg", "meta": [["prep:", "5 mins"], ["cook:", "50 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["¼ cup vegetable oil", "1 medium white onion, chopped", "2 cloves garlic", "1 teaspoon dried Mexican oregano", "1 pound dried pinto beans", "8 cups water", "2 teaspoons salt"], "direction": ["Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Add oil, onion, garlic, and oregano; cook for 5 minutes. Add beans and water; stir. Close and lock the lid. Choose high pressure and set timer for 35 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes.", "Remove the lid and check a bean; if not yet tender, close and lock the lid and cook another 5 minutes at high pressure.", "Drain beans, reserving 2 cups of liquid. Return beans to pot and add salt and 1 cup reserved liquid. Puree using a stick blender, adding additional cooking liquid as needed. Keep warm using the slow cooker function."], "facts": "212 calories; protein 9.9g 20% DV; carbohydrates 29.7g 10% DV; fat 6g 9% DV; cholesterol 0mg; sodium 476.8mg 19% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/234933/how-to-make-perfect-polenta/", "name": "How to Make Perfect Polenta", "summary": "\nPolenta is nothing more than coarsely ground cornmeal. The classic ratio is 1 part polenta to 4 parts water, but I like to measure the polenta just a little scant of a full cup. I often use chicken broth instead of water. It's a perfect base for any kind of saucy meat or mushroom ragout. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3778721.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "5 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups water", "1 teaspoon fine salt", "1 cup polenta", "3 tablespoons butter, divided", "½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"], "direction": ["Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps.", "Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender.", "Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish."], "facts": "291 calories; protein 9.2g 18% DV; carbohydrates 31g 10% DV; fat 14.7g 23% DV; cholesterol 33.4mg 11% DV; sodium 1186.1mg 47% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/278479/grandmas-meat-and-tater-hotdish/", "name": "Grandma's Meat and Tater Hotdish", "summary": "\nVery good hotdish recipe from my late grandmother that can also be eaten as a meal with a salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7732955.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "1 (10.75 ounce) can  condensed cream of mushroom soup", "¾ cup sour cream", "1 (15 ounce) can green beans, drained and liquid reserved, divided", "1  processed cheese (such as Velveeta®), sliced", "1 pound frozen bite-sized potato nuggets (such as Tater Tots®)"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain grease. Add onion and cook until soft and translucent, about 5 minutes.", "Meanwhile, combine condensed soup, sour cream, and green bean liquid in a small bowl. Set sauce aside.", "Add green beans to the cooked beef and onions; mix to combine and transfer to a casserole dish. Top with sliced cheese and cover with frozen potato nuggets. Pour sauce over top.", "Bake in the preheated oven potatoes are browned and sauce is bubbly, about 1 hour."], "facts": "534 calories; protein 23.9g 48% DV; carbohydrates 31.9g 10% DV; fat 36.5g 56% DV; cholesterol 89.5mg 30% DV; sodium 1281mg 51% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/219109/buffalo-chicken-wing-sauce/", "name": "Buffalo Chicken Wing Sauce", "summary": "\nIf you know someone from Buffalo, they know someone who told them the secret ingredients to the Anchor Bar's famous Buffalo chicken wings. I know people from Buffalo. This is my version, as described to me many years ago, over almost as many beers. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5931512.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["⅔ cup hot pepper sauce (such as Frank's RedHot®)", "½ cup cold unsalted butter", "1 ½ tablespoons white vinegar", "¼ teaspoon Worcestershire sauce", "¼ teaspoon cayenne pepper", "⅛ teaspoon garlic powder", "salt to taste"], "direction": ["Combine the hot sauce, butter, vinegar, Worcestershire sauce, cayenne pepper, garlic powder, and salt in a pot and place over medium heat. Bring to a simmer while stirring with a whisk. As soon as the liquid begins to bubble on the sides of the pot, remove from heat, stir with the whisk, and set aside for use."], "facts": "104 calories; protein 0.2g 1% DV; carbohydrates 0.4g; fat 11.6g 18% DV; cholesterol 30.5mg 10% DV; sodium 576.2mg 23% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/9377/roasted-vegetables/", "name": "Roasted Vegetables", "summary": "\nA casserole dish of seasonal vegetables that is so easy to prepare. It can be made a day ahead - just reheat before serving. Lemon juice can be substituted for balsamic vinegar, and you can use baking potatoes if you don't have any Yukon Golds on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1486.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 small butternut squash, cubed", "2  red bell peppers, seeded and diced", "1  sweet potato, peeled and cubed", "3  Yukon Gold potatoes, cubed", "1  red onion, quartered", "1 tablespoon chopped fresh thyme", "2 tablespoons chopped fresh rosemary", "¼ cup olive oil", "2 tablespoons balsamic vinegar", "salt and freshly ground black pepper"], "direction": ["Preheat oven to 475 degrees F (245 degrees C).", "In a large bowl, combine the squash, red bell peppers, sweet potato, and Yukon Gold potatoes. Separate the red onion quarters into pieces, and add them to the mixture.", "In a small bowl, stir together thyme, rosemary, olive oil, vinegar, salt, and pepper. Toss with vegetables until they are coated. Spread evenly on a large roasting pan.", "Roast for 35 to 40 minutes in the preheated oven, stirring every 10 minutes, or until vegetables are cooked through and browned."], "facts": "123 calories; protein 2g 4% DV; carbohydrates 20g 6% DV; fat 4.7g 7% DV; cholesterol 0mg; sodium 26mg 1% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/230103/buttery-garlic-green-beans/", "name": "Buttery Garlic Green Beans", "summary": "\nOnly fresh green beans and garlic will do for this easy, healthy, and flavorful side dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6487180.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound fresh green beans, trimmed and snapped in half", "3 tablespoons butter", "3 cloves garlic, minced", "2 pinches lemon pepper", "salt to taste"], "direction": ["Place green beans into a large skillet and cover with water; bring to a boil. Reduce heat to medium-low and simmer until beans start to soften, about 5 minutes. Drain water. Add butter to green beans; cook and stir until butter is melted, 2 to 3 minutes.", "Cook and stir garlic with green beans until garlic is tender and fragrant, 3 to 4 minutes. Season with lemon pepper and salt."], "facts": "116 calories; protein 2.3g 5% DV; carbohydrates 8.9g 3% DV; fat 8.8g 14% DV; cholesterol 22.9mg 8% DV; sodium 222.5mg 9% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/79300/real-poutine/", "name": "Real Poutine", "summary": "\nAn indulgence of fries, gravy and cheese. A Canadian specialty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F153593.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 quart vegetable oil for frying", "1 (10.25 ounce) can beef gravy", "5 medium potatoes, cut into fries", "2 cups cheese curds"], "direction": ["Heat oil in a deep fryer or deep heavy skillet to 365 degrees F (185 degrees C). While the oil is heating, you can begin to warm your gravy.", "Place the fries into the hot oil, and cook until light brown, about 5 minutes. Make the fries in batches if necessary to allow them room to move a little in the oil. Remove to a paper towel lined plate to drain.", "Place the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately."], "facts": "708 calories; protein 23.8g 48% DV; carbohydrates 51g 17% DV; fat 46.3g 71% DV; cholesterol 78.2mg 26% DV; sodium 772.9mg 31% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/229733/simple-roasted-butternut-squash/", "name": "Simple Roasted Butternut Squash", "summary": "\nButternut squash is so good on its own, that barely any seasoning is needed. This recipe is so simple and easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F957758.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  butternut squash - peeled, seeded, and cut into 1-inch cubes", "2 tablespoons olive oil", "2 cloves garlic, minced", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Toss butternut squash with olive oil and garlic in a large bowl. Season with salt and black pepper. Arrange coated squash on a baking sheet.", "Roast in the preheated oven until squash is tender and lightly browned, 25 to 30 minutes."], "facts": "177 calories; protein 2.6g 5% DV; carbohydrates 30.3g 10% DV; fat 7g 11% DV; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/22831/alfredo-sauce/", "name": "Alfredo Sauce", "summary": "\nRich and creamy! I have found that Parmesan cheese doesn't melt well, and often substitute Gruyere cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672690.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "1 cup heavy cream", "1 clove garlic, crushed", "1 ½ cups freshly grated Parmesan cheese", "¼ cup chopped fresh parsley"], "direction": ["Melt butter in a medium saucepan over medium low heat. Add cream and simmer for 5 minutes, then add garlic and cheese and whisk quickly, heating through. Stir in parsley and serve."], "facts": "439 calories; protein 13g 26% DV; carbohydrates 3.4g 1% DV; fat 42.1g 65% DV; cholesterol 138.4mg 46% DV; sodium 565.3mg 23% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/240784/easy-coleslaw-dressing/", "name": "Easy Coleslaw Dressing", "summary": "\nA creamy coleslaw dressing that can be made with ingredients you already have! You can pour it immediately over a 14-ounce package of coleslaw mix or refrigerate until needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1967016.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["½ cup mayonnaise", "2 tablespoons white sugar", "1 ½ tablespoons lemon juice", "1 tablespoon vinegar", "½ teaspoon ground black pepper", "¼ teaspoon salt"], "direction": ["Whisk mayonnaise, sugar, lemon juice, vinegar, pepper, and salt together in a bowl until smooth and creamy."], "facts": "94 calories; protein 0.2g; carbohydrates 9.3g 3% DV; fat 6.5g 10% DV; cholesterol 5.1mg 2% DV; sodium 236.2mg 9% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/51301/sarahs-applesauce/", "name": "Sarah's Applesauce", "summary": "\nThis applesauce is delicious! I make it for my younger brother all the time and he loves it - and he hates canned applesauce! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F25840.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  apples - peeled, cored and chopped", "¾ cup water", "¼ cup white sugar", "½ teaspoon ground cinnamon"], "direction": ["In a saucepan, combine apples, water, sugar, and cinnamon. Cover, and cook over medium heat for 15 to 20 minutes, or until apples are soft. Allow to cool, then mash with a fork or potato masher."], "facts": "121 calories; protein 0.4g 1% DV; carbohydrates 31.8g 10% DV; fat 0.2g; cholesterol 0mg; sodium 2.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/14591/the-best-marinade-around/", "name": "The Best Marinade Around", "summary": "\nThis recipe makes enough marinade for one steak, but can be multiplied for the amount you are grilling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F800834.jpg", "meta": [["prep:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "1"], ["Yield:", "3 /4 cup of marinade"]], "ingredients": ["½ cup soy sauce", "¼ cup olive oil", "1  lemon, juiced", "1 clove garlic, crushed"], "direction": ["Mix together soy sauce, olive oil, lemon juice, and garlic. Pour over meat, and refrigerate for 1 hour before preparing as desired."], "facts": "571 calories; protein 9.5g 19% DV; carbohydrates 22.3g 7% DV; fat 54.4g 84% DV; cholesterol 0mg; sodium 7220.2mg 289% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/143809/best-steak-marinade-in-existence/", "name": "Best Steak Marinade in Existence", "summary": "\nThis is a family recipe that has been developed only over the last 5 years. In this short time it's made me famous in our close circle, but until now I've never shared it with anyone. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4537368.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "1 1/3 cups"]], "ingredients": ["⅓ cup soy sauce", "½ cup olive oil", "⅓ cup fresh lemon juice", "¼ cup Worcestershire sauce", "1 ½ tablespoons garlic powder", "3 tablespoons dried basil", "1 ½ tablespoons dried parsley flakes", "1 teaspoon ground white pepper", "¼ teaspoon hot pepper sauce", "1 teaspoon dried minced garlic"], "direction": ["Place the soy sauce, olive oil, lemon juice, Worcestershire sauce, garlic powder, basil, parsley, and pepper in a blender. Add hot pepper sauce and garlic, if desired. Blend on high speed for 30 seconds until thoroughly mixed.", "Pour marinade over desired type of meat. Cover, and refrigerate for up to 8 hours. Cook meat as desired."], "facts": "145 calories; protein 1.4g 3% DV; carbohydrates 5.6g 2% DV; fat 13.6g 21% DV; cholesterol 0mg; sodium 688mg 28% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/259887/simple-teriyaki-sauce/", "name": "Simple Teriyaki Sauce", "summary": "\nThis simple but amazing teriyaki sauce will take your chicken and rice to the next level! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4553894.jpg", "meta": [["prep:", "5 mins"], ["cook:", "6 mins"], ["total:", "11 mins"], ["Servings:", "12"], ["Yield:", "cups"]], "ingredients": ["1 cup water", "¼ cup soy sauce", "5 teaspoons packed brown sugar", "1 tablespoon honey, or more to taste", "½ teaspoon ground ginger", "¼ teaspoon garlic powder", "2 tablespoons cornstarch", "¼ cup cold water"], "direction": ["Combine 1 cup water, soy sauce, brown sugar, honey, ginger, and garlic powder in a saucepan over medium heat. Cook until nearly heated through, about 1 minute.", "Mix cornstarch and 1/4 cold water together in a cup; stir until dissolved. Add to the saucepan. Cook and stir sauce until thickened, 5 to 7 minutes."], "facts": "21 calories; protein 0.4g 1% DV; carbohydrates 5g 2% DV; fat 0g; cholesterol 0mg; sodium 302.1mg 12% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/16760/best-fried-green-tomatoes/", "name": "Best Fried Green Tomatoes", "summary": "\nYou can also fry up red tomatoes with this recipe but make sure they are not over ripe or they will be mushy.  Serve these tomatoes outside with a glass of iced tea one summer night and enjoy the sunset with someone you love. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888769.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 large green tomatoes", "2  eggs", "½ cup milk", "1 cup all-purpose flour", "½ cup cornmeal", "½ cup bread crumbs", "2 teaspoons coarse kosher salt", "¼ teaspoon ground black pepper", "1 quart vegetable oil for frying"], "direction": ["Slice tomatoes 1/2 inch thick. Discard the ends.", "Whisk eggs and milk together in a medium-size bowl. Scoop flour onto a plate. Mix cornmeal, bread crumbs and salt and pepper on another plate. Dip tomatoes into flour to coat. Then dip the tomatoes into milk and egg mixture. Dredge in breadcrumbs to completely coat.", "In a large skillet, pour vegetable oil (enough so that there is 1/2 inch of oil in the pan) and heat over a medium heat. Place tomatoes into the frying pan in batches of 4 or 5, depending on the size of your skillet. Do not crowd the tomatoes, they should not touch each other. When the tomatoes are browned, flip and fry them on the other side. Drain them on paper towels."], "facts": "510 calories; protein 12.6g 25% DV; carbohydrates 56.3g 18% DV; fat 27g 42% DV; cholesterol 95.4mg 32% DV; sodium 1136mg 45% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/19402/quick-and-easy-alfredo-sauce/", "name": "Quick and Easy Alfredo Sauce", "summary": "\nI experimented with this until I found a quick, cheap, and easy Alfredo sauce combination -- the secret is cream cheese! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5149928.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup butter", "1 (8 ounce) package cream cheese", "2 teaspoons garlic powder", "2 cups milk", "6 ounces grated Parmesan cheese", "⅛ teaspoon ground black pepper"], "direction": ["Melt butter in a medium, non-stick saucepan over medium heat.  Add cream cheese and garlic powder, stirring with wire whisk until smooth.  Add milk, a little at a time, whisking to smooth out lumps.  Stir in Parmesan and pepper.  Remove from heat when sauce reaches desired consistency.  Sauce will thicken rapidly, thin with milk if cooked too long.  Toss with hot pasta to serve."], "facts": "648 calories; protein 25.1g 50% DV; carbohydrates 10g 3% DV; fat 57.1g 88% DV; cholesterol 169.8mg 57% DV; sodium 1029.8mg 41% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/85337/microwave-baked-potato/", "name": "Microwave Baked Potato", "summary": "\nIf you want the yummy taste of a slowly baked potato but aren't patient enough, or don't have the know-how to bake it in an oven, this is for you. Give it 12 minutes and get a mouth-watering, taste bud-tingling treat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F438952.jpg", "meta": [["prep:", "1 min"], ["cook:", "11 mins"], ["total:", "12 mins"], ["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["1 large russet potato", "1 tablespoon butter or margarine", "3 tablespoons shredded Cheddar cheese", "salt and pepper to taste", "3 teaspoons sour cream"], "direction": ["Scrub the potato, and prick several time with the tines of a fork. Place on a plate.", "Cook on full power in the microwave for 5 minutes. Turn over, and continue to cook for 5 more minutes. When the potato is soft, remove from the microwave, and cut in half lengthwise. Season with salt and pepper, and mash up the inside a little using a fork. Top the open sides with butter and 2 tablespoons of cheese. Return to the microwave, and cook for about 1 minute to melt the cheese.", "Top with remaining cheese and sour cream, and serve."], "facts": "517 calories; protein 14.2g 29% DV; carbohydrates 65.4g 21% DV; fat 23.1g 36% DV; cholesterol 63.1mg 21% DV; sodium 421.6mg 17% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/", "name": "Creamy Au Gratin Potatoes", "summary": "\nThis is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F738814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  russet potatoes, sliced into 1/4 inch slices", "1  onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "½ teaspoon salt", "2 cups milk", "1 ½ cups shredded Cheddar cheese"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.", "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.", "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.", "Bake 1 1/2 hours in the preheated oven."], "facts": "499 calories; protein 19.8g 40% DV; carbohydrates 49.3g 16% DV; fat 25.4g 39% DV; cholesterol 77.2mg 26% DV; sodium 683.4mg 27% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/274670/jiffy-corn-casserole/", "name": "Jiffy® Corn Casserole", "summary": "\nMy  mother won an award many, many years ago with this recipe in the Arizona Republic newspaper. I think it is delish and so different from a lot of other corn casseroles. Everybody I know asks for this recipe so I am giving it to everyone! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5932679.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["¼ cup butter", "1 large onion, diced", "½ large green bell pepper, diced", "1 (4 ounce) jar chopped pimento peppers", "2  eggs", "1 (8 ounce) package corn muffin mix (such as Jiffy®)", "1 (4 ounce) can diced green chiles", "1 (15.25 ounce) can whole kernel corn, with liquid", "1 (15.25 ounce) can creamed corn", "1 pint sour cream", "1 cup shredded Cheddar cheese"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.", "Melt butter in a skillet over medium heat. Add onion, bell pepper, and pimento peppers and saute until tender, about 5 minutes.", "Combine eggs, corn muffin mix, green chiles, whole corn, and creamed corn in a large bowl with the onion mixture. Stir together and pour into the prepared baking pan. Drop sour cream by the spoonful on top of the mixture; cover with Cheddar cheese.", "Bake in the preheated oven until casserole is firm, about 45 minutes."], "facts": "527 calories; protein 15.9g 32% DV; carbohydrates 46.8g 15% DV; fat 32.8g 51% DV; cholesterol 125.3mg 42% DV; sodium 993mg 40% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/", "name": "Spaghetti Sauce with Ground Beef", "summary": "\nThis recipe has been handed down from my mother.  It is a family favorite and will not be replaced! (Definite husband pleaser!) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667748.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "4 cloves garlic, minced", "1 small green bell pepper, diced", "1 (28 ounce) can diced tomatoes", "1 (16 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "2 teaspoons dried oregano", "2 teaspoons dried basil", "1 teaspoon salt", "½ teaspoon black pepper"], "direction": ["Combine ground beef, onion, garlic, and green pepper in a large saucepan.  Cook and stir until meat is brown and vegetables are tender. Drain grease.", "Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally."], "facts": "185 calories; protein 12.4g 25% DV; carbohydrates 15g 5% DV; fat 9.3g 14% DV; cholesterol 34.8mg 12% DV; sodium 930.8mg 37% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/159433/baked-butternut-squash/", "name": "Baked Butternut Squash", "summary": "\nThis simple baked butternut squash is easy to make, delicious to eat, and looks beautiful on the plate. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1070738.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 30 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  butternut squash, halved lengthwise and seeded", "water", "1 tablespoon butter, divided", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place squash, cut sides down, in a 9x13 baking dish. Pour water into dish around squash halves.", "Bake in the preheated oven until tender and easily pierced with a fork, about 1 1/2 hours. Carefully remove the skin with a fork; it should be very easy to remove. Top squash halves with butter and season with salt and pepper to taste."], "facts": "281 calories; protein 5.2g 10% DV; carbohydrates 59.7g 19% DV; fat 6.3g 10% DV; cholesterol 15.3mg 5% DV; sodium 64.9mg 3% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/18379/best-green-bean-casserole/", "name": "Best Green Bean Casserole", "summary": "\nThis great variation of the traditional green bean casserole is topped with French fried onions and Cheddar cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1656932.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (14.5 ounce) cans green beans, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (6 ounce) can French fried onions", "1 cup shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place green beans and soup in a large microwave-safe bowl.  Mix well and heat in the microwave on HIGH until warm (3 to 5 minutes). Stir in 1/2 cup of cheese and heat mixture for another 2 to 3 minutes. Transfer green bean mixture to a casserole dish and sprinkle with French fried onions and remaining cheese.", "Bake in a preheated 350 degrees F (175 degrees C) oven until the cheese melts and the onions just begin to brown."], "facts": "322 calories; protein 6.6g 13% DV; carbohydrates 20.2g 7% DV; fat 23.2g 36% DV; cholesterol 19.8mg 7% DV; sodium 1068.3mg 43% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/18352/whipped-cream/", "name": "Whipped Cream", "summary": "\nHow to make basic whipped cream. For best results make sure whisk and bowl are ice cold. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F587542.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 cup heavy cream", "1 teaspoon vanilla extract", "1 tablespoon confectioners' sugar"], "direction": ["In a large bowl, whip cream until stiff peaks are just about to form. Beat in vanilla and sugar until peaks form. Make sure not to over-beat, cream will then become lumpy and butter-like."], "facts": "54 calories; protein 0.3g 1% DV; carbohydrates 0.9g; fat 5.5g 9% DV; cholesterol 20.4mg 7% DV; sodium 5.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/51226/a-very-popular-bbq-sauce/", "name": "A Very Popular BBQ Sauce", "summary": "\nThis recipe has a lot of sweetness and spice, so if you're looking for a classic BBQ sauce that's easy to make, look no further.  It is very popular with users of 'ceramic' type smokers and grills, (i.e. Primo, Kamado, Big Green Egg, etc.) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72682.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "32"], ["Yield:", "4 cups"]], "ingredients": ["1 ½ cups brown sugar", "1 ½ cups ketchup", "½ cup red wine vinegar", "½ cup water", "1 tablespoon Worcestershire sauce", "2 ½ tablespoons dry mustard", "2 teaspoons paprika", "2 teaspoons salt", "1 ½ teaspoons black pepper", "2 dashes hot pepper sauce"], "direction": ["In a blender, combine brown sugar, ketchup, vinegar, water and Worcestershire sauce. Season with mustard, paprika, salt, pepper, and hot pepper sauce. Blend until smooth."], "facts": "43 calories; protein 0.4g 1% DV; carbohydrates 10.2g 3% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 278.4mg 11% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/82659/old-fashioned-onion-rings/", "name": "Old Fashioned Onion Rings", "summary": "\nThis is an actual recipe from a former employee of a popular drive-in restaurant. Crispy coated onion rings like the pro's make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F207422.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 mins"], ["total:", "18 mins"], ["Servings:", "3"], ["Yield:", "3 serving"]], "ingredients": ["1 large onion, cut into 1/4-inch slices", "1 ¼ cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon salt", "1  egg", "1 cup milk, or as needed", "¾ cup dry bread crumbs", "seasoned salt to taste", "1 quart oil for frying, or as needed"], "direction": ["Heat the oil in a deep-fryer to 365 degrees F (185 degrees C).", "Separate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt.", "Dip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings.", "Deep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve."], "facts": "641 calories; protein 14.3g 29% DV; carbohydrates 68.3g 22% DV; fat 34.6g 53% DV; cholesterol 68.5mg 23% DV; sodium 1271.5mg 51% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/33385/best-spanish-rice/", "name": "Best Spanish Rice", "summary": "\nThe combination of picante sauce and chicken broth makes this easy recipe very tasty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1028467.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 tablespoons oil", "2 tablespoons chopped onion", "1 ½ cups uncooked white rice", "2 cups chicken broth", "1 cup chunky salsa"], "direction": ["Heat oil in a large, heavy skillet over medium heat. Stir in onion, and cook until tender, about 5 minutes.", "Mix rice into skillet, stirring often. When rice begins to brown, stir in chicken broth and salsa. Reduce heat, cover and simmer 20 minutes, until liquid has been absorbed."], "facts": "286 calories; protein 5.7g 11% DV; carbohydrates 50.9g 16% DV; fat 6.2g 10% DV; cholesterol 2mg 1% DV; sodium 696.6mg 28% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/235449/skillet-braised-brussels-sprouts/", "name": "Skillet-Braised Brussels Sprouts", "summary": "\nBrussels sprouts with bacon and garlic are skillet-braised until tender and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7923937.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 slices thick-cut bacon, sliced into 1/4-inch strips, or more to taste", "1 pound Brussels sprouts, trimmed and halved, or more to taste", "1 clove garlic, thinly sliced, or more to taste", "½ cup chicken stock, or more as needed", "1 tablespoon butter, or to taste", "1 tablespoon balsamic vinegar, or more to taste", "salt and ground black pepper to taste"], "direction": ["Place bacon in a large skillet over medium-low heat; cook until just crisp, about 10 minutes. Transfer bacon to a paper towel-lined plate, reserving bacon grease in skillet.", "Increase heat to medium-high under skillet; saute Brussels sprouts in the bacon grease until lightly browned, 2 to 3 minutes. Add garlic to Brussels sprouts; saute until garlic is fragrant, 1 to 2 minutes.", "Pour chicken stock over Brussels sprouts mixture and cover skillet with a lid; simmer until Brussels sprouts are bright green, 4 to 5 minutes. Remove lid and continue simmering until liquid is evaporated and sprouts are tender, about 5 more minutes.", "Remove skillet from heat and stir bacon, butter, vinegar, salt, and pepper into Brussels sprouts mixture until butter is melted."], "facts": "128 calories; protein 7.3g 15% DV; carbohydrates 11.3g 4% DV; fat 7.1g 11% DV; cholesterol 17.6mg 6% DV; sodium 382.3mg 15% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/231713/chef-johns-baked-mushroom-risotto/", "name": "Chef John's Baked Mushroom Risotto", "summary": "\nThe beginning and the end of this risotto recipe are pretty standard, but we've moved the middle 15 minutes into the oven in an attempt to eliminate those dreaded 'variables.'  Besides being easier and more repeatable, this method produced a risotto that was identical in looks, taste, and texture to anything I can do on the stove. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1207574.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 tablespoons butter", "3 cups diced mushrooms", "salt to taste", "½  yellow onion, diced", "ground black pepper to taste", "1 pinch cayenne pepper", "1 cup carnaroli rice", "2 cups chicken broth, divided", "½ cup heavy whipping cream", "½ cup chicken broth", "2 tablespoons heavy whipping cream", "½ cup finely grated Parmigiano-Reggiano cheese", "2 tablespoons chopped fresh chives"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Melt butter in large, oven-proof skillet over medium-high heat. Add mushrooms; season with salt, and cook and stir mushrooms until brown. They will begin browning after the moisture evaporates.", "Reduce heat to medium and stir in onion. Sprinkle with black pepper and cayenne pepper. Cook and stir until onions are translucent and soft.", "Pour rice into skillet and stir until each rice grain is coated with butter. Season with salt.", "Pour 1 cup chicken broth into the rice mixture. Raise heat to medium-high and cook, stirring rice until liquid is completely absorbed by the rice.", "Pour another cup chicken stock into the rice and stir until mixture comes to a simmer.", "Bake in preheated oven until grains are almost tender but still slightly firm, about 15 minutes. Transfer skillet to stovetop. Season with more salt, if necessary.", "Combine the remaining 1/2 cup chicken broth and cream; pour into the skillet. Cook on medium heat, stirring constantly until rice is tender, 1 or 2 minutes. Remove skillet from heat.", "Drizzle 2 tablespoons cream over rice. Add the grated Parmigiano-Reggiano and chives; stir. Serve immediately."], "facts": "480 calories; protein 11.1g 22% DV; carbohydrates 51.1g 17% DV; fat 25.9g 40% DV; cholesterol 86.4mg 29% DV; sodium 997.8mg 40% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/241074/easy-garlic-kale/", "name": "Easy Garlic Kale", "summary": "\nKale is supposed to have cancer-fighting properties. I love it, but my husband hates it. Cooking it this way is the only way he'll eat it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2094708.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["additional:", "5 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch kale", "1 tablespoon olive oil", "1 teaspoon minced garlic"], "direction": ["Soak kale leaves in a large bowl of water until dirt and sand begin to fall to the bottom, about 2 minutes. Lift kale from the bowl without drying the leaves and immediately remove and discard stems. Chop the kale leaves into 1-inch pieces.", "Heat olive oil in a large skillet over medium heat; cook and stir garlic until sizzling, about 1 minute. Add kale to the skillet and place a cover over the top.", "Cook, stirring occasionally with tongs, until kale is bright green and slightly tender, 5 to 7 minutes."], "facts": "87 calories; protein 3.7g 8% DV; carbohydrates 11.4g 4% DV; fat 4.2g 6% DV; cholesterol 0mg; sodium 48.3mg 2% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/79518/hasselback-potatoes/", "name": "Hasselback Potatoes", "summary": "\nThis Swedish dish takes its name from Hasselbacken, the Stockholm restaurant where it was first served. The seasoned potatoes turn out crisp on the outside and tender on the inside. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2918307.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (8 ounce) baking potatoes", "2 tablespoons butter, melted", "salt and pepper to taste", "2 tablespoons finely grated fresh Romano cheese", "1 tablespoon seasoned dry bread crumbs"], "direction": ["Preheat the oven to 425 degrees F (220 degrees C).", "Peel the potatoes, and place in bowl of cold water to prevent browning. Place potatoes into a large wooden or metal spoon. Using a sharp knife, make slices across the potato the short way about 1/8 to 1/4 inch apart, making sure to cut down to the lip of the spoon, not all the way through the potato. The slices should stay connected at the bottom, and the spoon helps keep the depth even. Return the potato to the bowl of water, and proceed with the remaining potatoes.", "When all of the potatoes are cut, place them cut side up in a shallow baking dish or small roasting pan. Drizzle with half of the butter, then season with salt and pepper.", "Bake for 35 to 40 minutes in the preheated oven. Remove from the oven, and drizzle with the remaining butter. Sprinkle Romano cheese and bread crumbs onto the tops of the potatoes, and season with a little more salt and pepper. Return to the oven, and bake for an additional 20 minutes, or until nicely browned."], "facts": "247 calories; protein 6.1g 12% DV; carbohydrates 41.1g 13% DV; fat 7.1g 11% DV; cholesterol 19.2mg 6% DV; sodium 171.2mg 7% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/242232/lemon-couscous/", "name": "Lemon Couscous", "summary": "\nThis is light and fresh and accompanies fish (i.e. habanero-lime butter grilled salmon) and chicken well. It is a refreshing change to the rice or potato side dish, and everyone always loves it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2276861.jpg", "meta": [["prep:", "10 mins"], ["cook:", "5 mins"], ["total:", "15 mins"], ["Servings:", "3"], ["Yield:", "3 servings"]], "ingredients": ["1 cup chicken broth", "2 tablespoons fresh lemon juice", "1 tablespoon lemon zest", "1 tablespoon butter", "¼ teaspoon salt", "⅔ cup couscous", "1 (2 ounce) jar sliced pimento peppers, drained", "2 tablespoons toasted pine nuts", "2 tablespoons chopped fresh parsley"], "direction": ["Stir chicken broth, lemon juice, lemon zest, butter, and salt together in a saucepan; bring to a boil. Add couscous to the liquid and stir to coat completely. Place a cover on the saucepan, remove from heat, and let couscous soak in hot liquid until the moisture is mostly absorbed, about 5 minutes.", "Fluff couscous with a fork. Stir pimento peppers, pine nuts, and parsley into the couscous."], "facts": "225 calories; protein 7g 14% DV; carbohydrates 33.2g 11% DV; fat 7.2g 11% DV; cholesterol 11.8mg 4% DV; sodium 549.4mg 22% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/", "name": "Spiced Slow Cooker Applesauce", "summary": "\nThis easy and delicious spiced applesauce slow cooks to perfection. My kids and I came up with this recipe one fall weekend. It's a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277498.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 hrs 30 mins"], ["total:", "6 hrs 40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  apples - peeled, cored, and thinly sliced", "½ cup water", "¾ cup packed brown sugar", "½ teaspoon pumpkin pie spice"], "direction": ["Combine the apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in the brown sugar and pumpkin pie spice; continue cooking another 30 minutes."], "facts": "151 calories; protein 0.4g 1% DV; carbohydrates 39.4g 13% DV; fat 0.2g; cholesterol 0mg; sodium 7.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/239180/greek-style-lemon-roasted-potatoes/", "name": "Greek-Style Lemon Roasted Potatoes", "summary": "\nA great complement with souvlaki. I often cook this on the BBQ with the souvlaki. All you need is a great Greek salad for a full meal! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1439519.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds potatoes, peeled and cut into thick wedges", "⅓ cup olive oil", "2  lemons, juiced", "2 teaspoons salt", "1 teaspoon oregano", "½ teaspoon ground black pepper", "3 cups chicken broth"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Put potato wedges into a large bowl. Drizzle olive oil and lemon juice over the wedges and toss to coat. Season potatoes with salt, oregano, and black pepper; toss again to coat.", "Spread potato wedges in a single layer in a 2 inch-deep pan. Pour chicken broth over the potatoes.", "Roast potatoes in preheated oven until tender and golden brown, about 1 hour."], "facts": "282 calories; protein 4.6g 9% DV; carbohydrates 39.9g 13% DV; fat 12.2g 19% DV; cholesterol 0mg; sodium 789.1mg 32% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/275886/instant-pot-brown-rice/", "name": "Instant Pot® Brown Rice", "summary": "\nI haven't cooked rice on the stove since buying my electric pressure cooker! It's so easy and you can vary it up however you like; add spices or seasonings before cooking or fold in nuts and dried fruit after cooking. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7165111.jpg", "meta": [["prep:", "5 mins"], ["cook:", "35 mins"], ["additional:", "10 mins"], ["total:", "50 mins"], ["Servings:", "12"], ["Yield:", "6 cups cooked"]], "ingredients": ["2 ½ cups water", "2 cups brown basmati rice", "1 tablespoon grapeseed oil", "1 teaspoon kosher salt"], "direction": ["Combine water, brown rice, oil, and salt in a multi-functional pressure cooker (such as Instant Pot®). Close and lock the lid. Select Manual; set timer for 25 minutes on high pressure according to manufacturer's instructions. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Carefully release any remaining pressure. Unlock and remove the lid. Fluff rice with a fork or a rice paddle."], "facts": "106 calories; protein 2g 4% DV; carbohydrates 21.2g 7% DV; fat 2.2g 3% DV; cholesterol 0mg; sodium 161.5mg 7% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/163145/creamed-cabbage/", "name": "Creamed Cabbage", "summary": "\nThis is yummy for St. Paddy's Day! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2284428.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4 slices bacon", "¼ cup butter", "1 tablespoon all-purpose flour", "1 teaspoon salt", "1 large head cabbage, cored and shredded", "½ cup sour cream"], "direction": ["Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to cool.", "Whisk the butter, flour, and salt into the drippings in the same pan. Stir in the cabbage, and cook, stirring occasionally, over medium heat until cabbage is tender, about 15 minutes. Crumble the bacon; stir the bacon pieces and sour cream into the cabbage mixture."], "facts": "251 calories; protein 5.6g 11% DV; carbohydrates 14g 5% DV; fat 20.3g 31% DV; cholesterol 41.5mg 14% DV; sodium 645.2mg 26% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/268230/instant-pot-refried-beans/", "name": "Instant Pot® Refried Beans", "summary": "\nMake beans from dried to refried in less than an hour through the courtesy of your Instant Pot®. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6252480.jpg", "meta": [["prep:", "5 mins"], ["cook:", "50 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["¼ cup vegetable oil", "1 medium white onion, chopped", "2 cloves garlic", "1 teaspoon dried Mexican oregano", "1 pound dried pinto beans", "8 cups water", "2 teaspoons salt"], "direction": ["Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Add oil, onion, garlic, and oregano; cook for 5 minutes. Add beans and water; stir. Close and lock the lid. Choose high pressure and set timer for 35 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes.", "Remove the lid and check a bean; if not yet tender, close and lock the lid and cook another 5 minutes at high pressure.", "Drain beans, reserving 2 cups of liquid. Return beans to pot and add salt and 1 cup reserved liquid. Puree using a stick blender, adding additional cooking liquid as needed. Keep warm using the slow cooker function."], "facts": "212 calories; protein 9.9g 20% DV; carbohydrates 29.7g 10% DV; fat 6g 9% DV; cholesterol 0mg; sodium 476.8mg 19% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/234933/how-to-make-perfect-polenta/", "name": "How to Make Perfect Polenta", "summary": "\nPolenta is nothing more than coarsely ground cornmeal. The classic ratio is 1 part polenta to 4 parts water, but I like to measure the polenta just a little scant of a full cup. I often use chicken broth instead of water. It's a perfect base for any kind of saucy meat or mushroom ragout. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3778721.jpg", "meta": [["prep:", "15 mins"], ["cook:", "35 mins"], ["additional:", "5 mins"], ["total:", "55 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 cups water", "1 teaspoon fine salt", "1 cup polenta", "3 tablespoons butter, divided", "½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"], "direction": ["Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps.", "Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender.", "Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish."], "facts": "291 calories; protein 9.2g 18% DV; carbohydrates 31g 10% DV; fat 14.7g 23% DV; cholesterol 33.4mg 11% DV; sodium 1186.1mg 47% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/278479/grandmas-meat-and-tater-hotdish/", "name": "Grandma's Meat and Tater Hotdish", "summary": "\nVery good hotdish recipe from my late grandmother that can also be eaten as a meal with a salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7732955.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 15 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "1 (10.75 ounce) can  condensed cream of mushroom soup", "¾ cup sour cream", "1 (15 ounce) can green beans, drained and liquid reserved, divided", "1  processed cheese (such as Velveeta®), sliced", "1 pound frozen bite-sized potato nuggets (such as Tater Tots®)"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain grease. Add onion and cook until soft and translucent, about 5 minutes.", "Meanwhile, combine condensed soup, sour cream, and green bean liquid in a small bowl. Set sauce aside.", "Add green beans to the cooked beef and onions; mix to combine and transfer to a casserole dish. Top with sliced cheese and cover with frozen potato nuggets. Pour sauce over top.", "Bake in the preheated oven potatoes are browned and sauce is bubbly, about 1 hour."], "facts": "534 calories; protein 23.9g 48% DV; carbohydrates 31.9g 10% DV; fat 36.5g 56% DV; cholesterol 89.5mg 30% DV; sodium 1281mg 51% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/219109/buffalo-chicken-wing-sauce/", "name": "Buffalo Chicken Wing Sauce", "summary": "\nIf you know someone from Buffalo, they know someone who told them the secret ingredients to the Anchor Bar's famous Buffalo chicken wings. I know people from Buffalo. This is my version, as described to me many years ago, over almost as many beers. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5931512.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["⅔ cup hot pepper sauce (such as Frank's RedHot®)", "½ cup cold unsalted butter", "1 ½ tablespoons white vinegar", "¼ teaspoon Worcestershire sauce", "¼ teaspoon cayenne pepper", "⅛ teaspoon garlic powder", "salt to taste"], "direction": ["Combine the hot sauce, butter, vinegar, Worcestershire sauce, cayenne pepper, garlic powder, and salt in a pot and place over medium heat. Bring to a simmer while stirring with a whisk. As soon as the liquid begins to bubble on the sides of the pot, remove from heat, stir with the whisk, and set aside for use."], "facts": "104 calories; protein 0.2g 1% DV; carbohydrates 0.4g; fat 11.6g 18% DV; cholesterol 30.5mg 10% DV; sodium 576.2mg 23% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/9377/roasted-vegetables/", "name": "Roasted Vegetables", "summary": "\nA casserole dish of seasonal vegetables that is so easy to prepare. It can be made a day ahead - just reheat before serving. Lemon juice can be substituted for balsamic vinegar, and you can use baking potatoes if you don't have any Yukon Golds on hand. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1486.jpg", "meta": [["prep:", "15 mins"], ["cook:", "40 mins"], ["total:", "55 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["1 small butternut squash, cubed", "2  red bell peppers, seeded and diced", "1  sweet potato, peeled and cubed", "3  Yukon Gold potatoes, cubed", "1  red onion, quartered", "1 tablespoon chopped fresh thyme", "2 tablespoons chopped fresh rosemary", "¼ cup olive oil", "2 tablespoons balsamic vinegar", "salt and freshly ground black pepper"], "direction": ["Preheat oven to 475 degrees F (245 degrees C).", "In a large bowl, combine the squash, red bell peppers, sweet potato, and Yukon Gold potatoes. Separate the red onion quarters into pieces, and add them to the mixture.", "In a small bowl, stir together thyme, rosemary, olive oil, vinegar, salt, and pepper. Toss with vegetables until they are coated. Spread evenly on a large roasting pan.", "Roast for 35 to 40 minutes in the preheated oven, stirring every 10 minutes, or until vegetables are cooked through and browned."], "facts": "123 calories; protein 2g 4% DV; carbohydrates 20g 6% DV; fat 4.7g 7% DV; cholesterol 0mg; sodium 26mg 1% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/230103/buttery-garlic-green-beans/", "name": "Buttery Garlic Green Beans", "summary": "\nOnly fresh green beans and garlic will do for this easy, healthy, and flavorful side dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6487180.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound fresh green beans, trimmed and snapped in half", "3 tablespoons butter", "3 cloves garlic, minced", "2 pinches lemon pepper", "salt to taste"], "direction": ["Place green beans into a large skillet and cover with water; bring to a boil. Reduce heat to medium-low and simmer until beans start to soften, about 5 minutes. Drain water. Add butter to green beans; cook and stir until butter is melted, 2 to 3 minutes.", "Cook and stir garlic with green beans until garlic is tender and fragrant, 3 to 4 minutes. Season with lemon pepper and salt."], "facts": "116 calories; protein 2.3g 5% DV; carbohydrates 8.9g 3% DV; fat 8.8g 14% DV; cholesterol 22.9mg 8% DV; sodium 222.5mg 9% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/79300/real-poutine/", "name": "Real Poutine", "summary": "\nAn indulgence of fries, gravy and cheese. A Canadian specialty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F153593.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 quart vegetable oil for frying", "1 (10.25 ounce) can beef gravy", "5 medium potatoes, cut into fries", "2 cups cheese curds"], "direction": ["Heat oil in a deep fryer or deep heavy skillet to 365 degrees F (185 degrees C). While the oil is heating, you can begin to warm your gravy.", "Place the fries into the hot oil, and cook until light brown, about 5 minutes. Make the fries in batches if necessary to allow them room to move a little in the oil. Remove to a paper towel lined plate to drain.", "Place the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately."], "facts": "708 calories; protein 23.8g 48% DV; carbohydrates 51g 17% DV; fat 46.3g 71% DV; cholesterol 78.2mg 26% DV; sodium 772.9mg 31% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/", "name": "Oven-Roasted Asparagus", "summary": "\nSalty and savory, the roasting method kills the natural bitterness of asparagus.  Try it next to grilled fish or lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F1001600-Oven-Roasted-Asparagus-Photo-by-Kims-Cooking-Now-resize.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese  (Optional)", "1 clove garlic, minced  (Optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice  (Optional)"], "direction": ["Preheat an oven to 425 degrees F (220 degrees C).", "Place the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.", "Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving."], "facts": "123 calories; protein 3.3g 7% DV; carbohydrates 5.2g 2% DV; fat 10.8g 17% DV; cholesterol 1.7mg 1% DV; sodium 471.4mg 19% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/229733/simple-roasted-butternut-squash/", "name": "Simple Roasted Butternut Squash", "summary": "\nButternut squash is so good on its own, that barely any seasoning is needed. This recipe is so simple and easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F957758.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1  butternut squash - peeled, seeded, and cut into 1-inch cubes", "2 tablespoons olive oil", "2 cloves garlic, minced", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Toss butternut squash with olive oil and garlic in a large bowl. Season with salt and black pepper. Arrange coated squash on a baking sheet.", "Roast in the preheated oven until squash is tender and lightly browned, 25 to 30 minutes."], "facts": "177 calories; protein 2.6g 5% DV; carbohydrates 30.3g 10% DV; fat 7g 11% DV; cholesterol 0mg; sodium 10.6mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/24771/basic-mashed-potatoes/", "name": "Basic Mashed Potatoes", "summary": "\nIf you love good, old fashioned mashed potatoes this is the perfect recipe. Simple and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5294868.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds baking potatoes, peeled and quartered", "2 tablespoons butter", "1 cup milk", "salt and pepper to taste"], "direction": ["Bring a pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes; drain.", "In a small saucepan heat butter and milk over low heat until butter is melted.  Using a potato masher or electric beater, slowly blend milk mixture into potatoes until smooth and creamy.  Season with salt and pepper to taste."], "facts": "257 calories; protein 5.6g 11% DV; carbohydrates 43.7g 14% DV; fat 7.2g 11% DV; cholesterol 20.1mg 7% DV; sodium 76.1mg 3% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/22831/alfredo-sauce/", "name": "Alfredo Sauce", "summary": "\nRich and creamy! I have found that Parmesan cheese doesn't melt well, and often substitute Gruyere cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672690.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup butter", "1 cup heavy cream", "1 clove garlic, crushed", "1 ½ cups freshly grated Parmesan cheese", "¼ cup chopped fresh parsley"], "direction": ["Melt butter in a medium saucepan over medium low heat. Add cream and simmer for 5 minutes, then add garlic and cheese and whisk quickly, heating through. Stir in parsley and serve."], "facts": "439 calories; protein 13g 26% DV; carbohydrates 3.4g 1% DV; fat 42.1g 65% DV; cholesterol 138.4mg 46% DV; sodium 565.3mg 23% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/240784/easy-coleslaw-dressing/", "name": "Easy Coleslaw Dressing", "summary": "\nA creamy coleslaw dressing that can be made with ingredients you already have! You can pour it immediately over a 14-ounce package of coleslaw mix or refrigerate until needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1967016.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["½ cup mayonnaise", "2 tablespoons white sugar", "1 ½ tablespoons lemon juice", "1 tablespoon vinegar", "½ teaspoon ground black pepper", "¼ teaspoon salt"], "direction": ["Whisk mayonnaise, sugar, lemon juice, vinegar, pepper, and salt together in a bowl until smooth and creamy."], "facts": "94 calories; protein 0.2g; carbohydrates 9.3g 3% DV; fat 6.5g 10% DV; cholesterol 5.1mg 2% DV; sodium 236.2mg 9% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/51301/sarahs-applesauce/", "name": "Sarah's Applesauce", "summary": "\nThis applesauce is delicious! I make it for my younger brother all the time and he loves it - and he hates canned applesauce! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F25840.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  apples - peeled, cored and chopped", "¾ cup water", "¼ cup white sugar", "½ teaspoon ground cinnamon"], "direction": ["In a saucepan, combine apples, water, sugar, and cinnamon. Cover, and cook over medium heat for 15 to 20 minutes, or until apples are soft. Allow to cool, then mash with a fork or potato masher."], "facts": "121 calories; protein 0.4g 1% DV; carbohydrates 31.8g 10% DV; fat 0.2g; cholesterol 0mg; sodium 2.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/14591/the-best-marinade-around/", "name": "The Best Marinade Around", "summary": "\nThis recipe makes enough marinade for one steak, but can be multiplied for the amount you are grilling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F800834.jpg", "meta": [["prep:", "5 mins"], ["additional:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "1"], ["Yield:", "3 /4 cup of marinade"]], "ingredients": ["½ cup soy sauce", "¼ cup olive oil", "1  lemon, juiced", "1 clove garlic, crushed"], "direction": ["Mix together soy sauce, olive oil, lemon juice, and garlic. Pour over meat, and refrigerate for 1 hour before preparing as desired."], "facts": "571 calories; protein 9.5g 19% DV; carbohydrates 22.3g 7% DV; fat 54.4g 84% DV; cholesterol 0mg; sodium 7220.2mg 289% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/143809/best-steak-marinade-in-existence/", "name": "Best Steak Marinade in Existence", "summary": "\nThis is a family recipe that has been developed only over the last 5 years. In this short time it's made me famous in our close circle, but until now I've never shared it with anyone. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4537368.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "8"], ["Yield:", "1 1/3 cups"]], "ingredients": ["⅓ cup soy sauce", "½ cup olive oil", "⅓ cup fresh lemon juice", "¼ cup Worcestershire sauce", "1 ½ tablespoons garlic powder", "3 tablespoons dried basil", "1 ½ tablespoons dried parsley flakes", "1 teaspoon ground white pepper", "¼ teaspoon hot pepper sauce", "1 teaspoon dried minced garlic"], "direction": ["Place the soy sauce, olive oil, lemon juice, Worcestershire sauce, garlic powder, basil, parsley, and pepper in a blender. Add hot pepper sauce and garlic, if desired. Blend on high speed for 30 seconds until thoroughly mixed.", "Pour marinade over desired type of meat. Cover, and refrigerate for up to 8 hours. Cook meat as desired."], "facts": "145 calories; protein 1.4g 3% DV; carbohydrates 5.6g 2% DV; fat 13.6g 21% DV; cholesterol 0mg; sodium 688mg 28% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/259887/simple-teriyaki-sauce/", "name": "Simple Teriyaki Sauce", "summary": "\nThis simple but amazing teriyaki sauce will take your chicken and rice to the next level! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4553894.jpg", "meta": [["prep:", "5 mins"], ["cook:", "6 mins"], ["total:", "11 mins"], ["Servings:", "12"], ["Yield:", "cups"]], "ingredients": ["1 cup water", "¼ cup soy sauce", "5 teaspoons packed brown sugar", "1 tablespoon honey, or more to taste", "½ teaspoon ground ginger", "¼ teaspoon garlic powder", "2 tablespoons cornstarch", "¼ cup cold water"], "direction": ["Combine 1 cup water, soy sauce, brown sugar, honey, ginger, and garlic powder in a saucepan over medium heat. Cook until nearly heated through, about 1 minute.", "Mix cornstarch and 1/4 cold water together in a cup; stir until dissolved. Add to the saucepan. Cook and stir sauce until thickened, 5 to 7 minutes."], "facts": "21 calories; protein 0.4g 1% DV; carbohydrates 5g 2% DV; fat 0g; cholesterol 0mg; sodium 302.1mg 12% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/16760/best-fried-green-tomatoes/", "name": "Best Fried Green Tomatoes", "summary": "\nYou can also fry up red tomatoes with this recipe but make sure they are not over ripe or they will be mushy.  Serve these tomatoes outside with a glass of iced tea one summer night and enjoy the sunset with someone you love. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888769.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 large green tomatoes", "2  eggs", "½ cup milk", "1 cup all-purpose flour", "½ cup cornmeal", "½ cup bread crumbs", "2 teaspoons coarse kosher salt", "¼ teaspoon ground black pepper", "1 quart vegetable oil for frying"], "direction": ["Slice tomatoes 1/2 inch thick. Discard the ends.", "Whisk eggs and milk together in a medium-size bowl. Scoop flour onto a plate. Mix cornmeal, bread crumbs and salt and pepper on another plate. Dip tomatoes into flour to coat. Then dip the tomatoes into milk and egg mixture. Dredge in breadcrumbs to completely coat.", "In a large skillet, pour vegetable oil (enough so that there is 1/2 inch of oil in the pan) and heat over a medium heat. Place tomatoes into the frying pan in batches of 4 or 5, depending on the size of your skillet. Do not crowd the tomatoes, they should not touch each other. When the tomatoes are browned, flip and fry them on the other side. Drain them on paper towels."], "facts": "510 calories; protein 12.6g 25% DV; carbohydrates 56.3g 18% DV; fat 27g 42% DV; cholesterol 95.4mg 32% DV; sodium 1136mg 45% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/19402/quick-and-easy-alfredo-sauce/", "name": "Quick and Easy Alfredo Sauce", "summary": "\nI experimented with this until I found a quick, cheap, and easy Alfredo sauce combination -- the secret is cream cheese! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5149928.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup butter", "1 (8 ounce) package cream cheese", "2 teaspoons garlic powder", "2 cups milk", "6 ounces grated Parmesan cheese", "⅛ teaspoon ground black pepper"], "direction": ["Melt butter in a medium, non-stick saucepan over medium heat.  Add cream cheese and garlic powder, stirring with wire whisk until smooth.  Add milk, a little at a time, whisking to smooth out lumps.  Stir in Parmesan and pepper.  Remove from heat when sauce reaches desired consistency.  Sauce will thicken rapidly, thin with milk if cooked too long.  Toss with hot pasta to serve."], "facts": "648 calories; protein 25.1g 50% DV; carbohydrates 10g 3% DV; fat 57.1g 88% DV; cholesterol 169.8mg 57% DV; sodium 1029.8mg 41% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/85337/microwave-baked-potato/", "name": "Microwave Baked Potato", "summary": "\nIf you want the yummy taste of a slowly baked potato but aren't patient enough, or don't have the know-how to bake it in an oven, this is for you. Give it 12 minutes and get a mouth-watering, taste bud-tingling treat. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F438952.jpg", "meta": [["prep:", "1 min"], ["cook:", "11 mins"], ["total:", "12 mins"], ["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["1 large russet potato", "1 tablespoon butter or margarine", "3 tablespoons shredded Cheddar cheese", "salt and pepper to taste", "3 teaspoons sour cream"], "direction": ["Scrub the potato, and prick several time with the tines of a fork. Place on a plate.", "Cook on full power in the microwave for 5 minutes. Turn over, and continue to cook for 5 more minutes. When the potato is soft, remove from the microwave, and cut in half lengthwise. Season with salt and pepper, and mash up the inside a little using a fork. Top the open sides with butter and 2 tablespoons of cheese. Return to the microwave, and cook for about 1 minute to melt the cheese.", "Top with remaining cheese and sour cream, and serve."], "facts": "517 calories; protein 14.2g 29% DV; carbohydrates 65.4g 21% DV; fat 23.1g 36% DV; cholesterol 63.1mg 21% DV; sodium 421.6mg 17% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/", "name": "Creamy Au Gratin Potatoes", "summary": "\nThis is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F738814.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr 30 mins"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  russet potatoes, sliced into 1/4 inch slices", "1  onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "½ teaspoon salt", "2 cups milk", "1 ½ cups shredded Cheddar cheese"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.", "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.", "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.", "Bake 1 1/2 hours in the preheated oven."], "facts": "499 calories; protein 19.8g 40% DV; carbohydrates 49.3g 16% DV; fat 25.4g 39% DV; cholesterol 77.2mg 26% DV; sodium 683.4mg 27% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/274670/jiffy-corn-casserole/", "name": "Jiffy® Corn Casserole", "summary": "\nMy  mother won an award many, many years ago with this recipe in the Arizona Republic newspaper. I think it is delish and so different from a lot of other corn casseroles. Everybody I know asks for this recipe so I am giving it to everyone! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5932679.jpg", "meta": [["prep:", "20 mins"], ["cook:", "50 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["¼ cup butter", "1 large onion, diced", "½ large green bell pepper, diced", "1 (4 ounce) jar chopped pimento peppers", "2  eggs", "1 (8 ounce) package corn muffin mix (such as Jiffy®)", "1 (4 ounce) can diced green chiles", "1 (15.25 ounce) can whole kernel corn, with liquid", "1 (15.25 ounce) can creamed corn", "1 pint sour cream", "1 cup shredded Cheddar cheese"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.", "Melt butter in a skillet over medium heat. Add onion, bell pepper, and pimento peppers and saute until tender, about 5 minutes.", "Combine eggs, corn muffin mix, green chiles, whole corn, and creamed corn in a large bowl with the onion mixture. Stir together and pour into the prepared baking pan. Drop sour cream by the spoonful on top of the mixture; cover with Cheddar cheese.", "Bake in the preheated oven until casserole is firm, about 45 minutes."], "facts": "527 calories; protein 15.9g 32% DV; carbohydrates 46.8g 15% DV; fat 32.8g 51% DV; cholesterol 125.3mg 42% DV; sodium 993mg 40% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/", "name": "Spaghetti Sauce with Ground Beef", "summary": "\nThis recipe has been handed down from my mother.  It is a family favorite and will not be replaced! (Definite husband pleaser!) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667748.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound ground beef", "1  onion, chopped", "4 cloves garlic, minced", "1 small green bell pepper, diced", "1 (28 ounce) can diced tomatoes", "1 (16 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "2 teaspoons dried oregano", "2 teaspoons dried basil", "1 teaspoon salt", "½ teaspoon black pepper"], "direction": ["Combine ground beef, onion, garlic, and green pepper in a large saucepan.  Cook and stir until meat is brown and vegetables are tender. Drain grease.", "Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally."], "facts": "185 calories; protein 12.4g 25% DV; carbohydrates 15g 5% DV; fat 9.3g 14% DV; cholesterol 34.8mg 12% DV; sodium 930.8mg 37% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/159433/baked-butternut-squash/", "name": "Baked Butternut Squash", "summary": "\nThis simple baked butternut squash is easy to make, delicious to eat, and looks beautiful on the plate. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1070738.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr 30 mins"], ["total:", "1 hr 40 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  butternut squash, halved lengthwise and seeded", "water", "1 tablespoon butter, divided", "salt and ground black pepper to taste"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place squash, cut sides down, in a 9x13 baking dish. Pour water into dish around squash halves.", "Bake in the preheated oven until tender and easily pierced with a fork, about 1 1/2 hours. Carefully remove the skin with a fork; it should be very easy to remove. Top squash halves with butter and season with salt and pepper to taste."], "facts": "281 calories; protein 5.2g 10% DV; carbohydrates 59.7g 19% DV; fat 6.3g 10% DV; cholesterol 15.3mg 5% DV; sodium 64.9mg 3% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/18379/best-green-bean-casserole/", "name": "Best Green Bean Casserole", "summary": "\nThis great variation of the traditional green bean casserole is topped with French fried onions and Cheddar cheese. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1656932.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (14.5 ounce) cans green beans, drained", "1 (10.75 ounce) can  condensed cream of mushroom soup", "1 (6 ounce) can French fried onions", "1 cup shredded Cheddar cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Place green beans and soup in a large microwave-safe bowl.  Mix well and heat in the microwave on HIGH until warm (3 to 5 minutes). Stir in 1/2 cup of cheese and heat mixture for another 2 to 3 minutes. Transfer green bean mixture to a casserole dish and sprinkle with French fried onions and remaining cheese.", "Bake in a preheated 350 degrees F (175 degrees C) oven until the cheese melts and the onions just begin to brown."], "facts": "322 calories; protein 6.6g 13% DV; carbohydrates 20.2g 7% DV; fat 23.2g 36% DV; cholesterol 19.8mg 7% DV; sodium 1068.3mg 43% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/18352/whipped-cream/", "name": "Whipped Cream", "summary": "\nHow to make basic whipped cream. For best results make sure whisk and bowl are ice cold. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F587542.jpg", "meta": [["prep:", "5 mins"], ["total:", "5 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 cup heavy cream", "1 teaspoon vanilla extract", "1 tablespoon confectioners' sugar"], "direction": ["In a large bowl, whip cream until stiff peaks are just about to form. Beat in vanilla and sugar until peaks form. Make sure not to over-beat, cream will then become lumpy and butter-like."], "facts": "54 calories; protein 0.3g 1% DV; carbohydrates 0.9g; fat 5.5g 9% DV; cholesterol 20.4mg 7% DV; sodium 5.7mg."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/51226/a-very-popular-bbq-sauce/", "name": "A Very Popular BBQ Sauce", "summary": "\nThis recipe has a lot of sweetness and spice, so if you're looking for a classic BBQ sauce that's easy to make, look no further.  It is very popular with users of 'ceramic' type smokers and grills, (i.e. Primo, Kamado, Big Green Egg, etc.) \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72682.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "32"], ["Yield:", "4 cups"]], "ingredients": ["1 ½ cups brown sugar", "1 ½ cups ketchup", "½ cup red wine vinegar", "½ cup water", "1 tablespoon Worcestershire sauce", "2 ½ tablespoons dry mustard", "2 teaspoons paprika", "2 teaspoons salt", "1 ½ teaspoons black pepper", "2 dashes hot pepper sauce"], "direction": ["In a blender, combine brown sugar, ketchup, vinegar, water and Worcestershire sauce. Season with mustard, paprika, salt, pepper, and hot pepper sauce. Blend until smooth."], "facts": "43 calories; protein 0.4g 1% DV; carbohydrates 10.2g 3% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 278.4mg 11% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/82659/old-fashioned-onion-rings/", "name": "Old Fashioned Onion Rings", "summary": "\nThis is an actual recipe from a former employee of a popular drive-in restaurant. Crispy coated onion rings like the pro's make! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F207422.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 mins"], ["total:", "18 mins"], ["Servings:", "3"], ["Yield:", "3 serving"]], "ingredients": ["1 large onion, cut into 1/4-inch slices", "1 ¼ cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon salt", "1  egg", "1 cup milk, or as needed", "¾ cup dry bread crumbs", "seasoned salt to taste", "1 quart oil for frying, or as needed"], "direction": ["Heat the oil in a deep-fryer to 365 degrees F (185 degrees C).", "Separate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt.", "Dip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings.", "Deep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve."], "facts": "641 calories; protein 14.3g 29% DV; carbohydrates 68.3g 22% DV; fat 34.6g 53% DV; cholesterol 68.5mg 23% DV; sodium 1271.5mg 51% DV."}, {"type": "By Meal ", "package": "side_dishes", "link": "https://www.allrecipes.com/recipe/33385/best-spanish-rice/", "name": "Best Spanish Rice", "summary": "\nThe combination of picante sauce and chicken broth makes this easy recipe very tasty! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1028467.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["2 tablespoons oil", "2 tablespoons chopped onion", "1 ½ cups uncooked white rice", "2 cups chicken broth", "1 cup chunky salsa"], "direction": ["Heat oil in a large, heavy skillet over medium heat. Stir in onion, and cook until tender, about 5 minutes.", "Mix rice into skillet, stirring often. When rice begins to brown, stir in chicken broth and salsa. Reduce heat, cover and simmer 20 minutes, until liquid has been absorbed."], "facts": "286 calories; protein 5.7g 11% DV; carbohydrates 50.9g 16% DV; fat 6.2g 10% DV; cholesterol 2mg 1% DV; sodium 696.6mg 28% DV."}]