[{"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/256753/irish-soda-bread-muffins/", "name": "Irish Soda Bread Muffins", "summary": "\nOne bowl, mix, bake for 20 minutes, and you have tasty muffins! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4462122.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["3 cups all-purpose flour", "1 cup raisins", "½ cup white sugar", "2 tablespoons white sugar", "1 tablespoon caraway seeds", "1 tablespoon baking powder", "1 teaspoon salt", "¼ teaspoon baking soda", "1 ¾ cups buttermilk", "1  egg", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.", "Mix flour, raisins, 1/2 cup plus 2 tablespoons sugar, caraway seeds, baking powder, salt, and baking soda in a large bowl.", "Whisk buttermilk and egg together in a small bowl. Stir into flour mixture. Fold butter into the batter.", "Spoon batter into the prepared muffin tin.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes."], "facts": "252 calories; protein 5.5g 11% DV; carbohydrates 47.4g 15% DV; fat 5g 8% DV; cholesterol 27.1mg 9% DV; sodium 376.7mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/264005/kimchi-corned-beef/", "name": "Kimchi Corned Beef", "summary": "\nInstead of the same old corned beef and cabbage recipe every year, try this new and exciting Korean twist on the St. Patrick's Day staple. The spicy fermented cabbage adds a lot of extra savoriness, not only to the meat, but even more so to the vegetables. The potatoes especially soak up a surprising amount of flavor, and may be my favorite part of the whole dish. Garnish with sliced green onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5327376.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 45 mins"], ["total:", "3 hrs 5 mins"], ["Servings:", "10"], ["Yield:", "3 1/2 pounds corned beef"]], "ingredients": ["1 (3 1/2) pound ready-to-cook corned beef", "2 (16 ounce) jars kimchi, not drained", "½ cup cold water, or as needed", "2 pounds Yukon gold potatoes, quartered", "3 large carrots, cut into large chunks", "2 ribs celery, cut into large chunks"], "direction": ["Pour 1 jar of kimchi into a pot. Top with corned beef and cover with the second jar of kimchi. Pour in water. Cover and bring to a simmer over high heat. Reduce heat to low. Cook, covered, until fork-tender, 2 to 3 hours. Flip over the beef occasionally and drape kimchi back on top.", "Remove corned beef to a bowl. Bring kimchi mixture back to a simmer over high heat. Add potatoes, carrots, and celery. Cover, reduce heat to medium-low, and cook until almost tender, 20 to 25 minutes. Reduce heat to low and add beef back in. Cover and cook on low until meat is heated through, about 15 minutes. Taste the broth and add water as needed.", "Slice corned beef thinly and serve in a bowl with the vegetables; spoon some broth on top."], "facts": "500 calories; protein 32.5g 65% DV; carbohydrates 23.2g 8% DV; fat 30.5g 47% DV; cholesterol 155.7mg 52% DV; sodium 2427.5mg 97% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270205/instant-pot-irish-stew/", "name": "Instant Pot® Irish Stew", "summary": "\nThis hearty Irish lamb stew is perfect for a chilly day, and easy to make in an Instant Pot®! Serve as-is or with rice on the side. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6288558.jpg", "meta": [["prep:", "25 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 tablespoon butter", "1 tablespoon olive oil", "1 ¼ pounds lamb shoulder, cubed", "1  onion, diced", "2  shallots, diced", "2 cloves garlic, minced", "½ teaspoon white cooking wine", "2  carrots, or more to taste, sliced into rounds", "¾ pound small red potatoes, halved", "½ teaspoon dried rosemary", "½ teaspoon dried thyme", "1 ½ cups beef broth", "2 tablespoons cold water", "1 tablespoon potato starch", "salt and ground black pepper to taste"], "direction": ["Warm butter and oil in a multi-functional pressure cooker (such as Instant Pot®) set to Saute function. Add lamb and cook until browned on all sides, about 5 minutes. Transfer to a plate. Add onion and shallots to the pot; cook and stir until translucent, 4 to 5 minutes. Add garlic and cook for 1 minute longer.", "Pour wine into the pot and scrape up any browned bits off the bottom of the pot. Cook until wine is reduced by half, 3 to 5 minutes. Place carrots and potatoes on top of onions. Season with rosemary and thyme; stir to combine well. Arrange lamb over vegetables; pour beef broth on top.", "Close and lock the lid. Open vent for steaming. Select Meat/Stew function; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Meanwhile, mix water and potato starch until creamy.", "Unlock and remove lid. Switch to Saute function. Stir potato starch mixture into the stew; cook until thickened, 2 to 3 minutes. Season with salt and pepper."], "facts": "389 calories; protein 21.8g 44% DV; carbohydrates 26.2g 9% DV; fat 22g 34% DV; cholesterol 79.6mg 27% DV; sodium 440.2mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270882/st-patricks-day-jell-o-shots/", "name": "St. Patrick's Day Jell-O® Shots", "summary": "\nA fun and tasty way of keeping your Jell-O® shots Irish. Just add Jameson® Irish whiskey and Baileys® Strawberries & Cream liqueur to your layered shot glasses. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6410302.jpg", "meta": [["prep:", "10 mins"], ["additional:", "8 hrs"], ["total:", "8 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "8 shots"]], "ingredients": ["½ (3 ounce) package lime-flavored gelatin mix (such as Jell-O®)", "½ cup boiling water", "½ cup Irish whiskey (such as Jameson®)", "1 (1 ounce) package unflavored gelatin (such as Knox®)", "½ cup boiling water", "½ cup strawberry cream liqueur (such as Baileys®)"], "direction": ["Place shot glasses in a mini muffin tin at an angle.", "Pour lime gelatin mix into a bowl. Add 1/2 cup boiling water and stir until dissolved. Add Irish whiskey and stir until well incorporated. Pour mixture carefully into each shot glass, filling to near the top of the slanted glasses. Refrigerate until set, about 4 hours.", "Pour unflavored gelatin into a bowl. Add 1/2 cup boiling water and stir until dissolved. Let rest 3 to 5 minutes. Add strawberry cream liqueur and stir until well incorporated.", "Remove glasses from muffin tin and place upright. Top with strawberry mixture. Return glasses to the refrigerator and chill until set, about 4 hours more."], "facts": "126 calories; protein 0.8g 2% DV; carbohydrates 13.9g 5% DV; fat 0g; cholesterol 0mg; sodium 33.6mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220584/fried-irish-cabbage-with-bacon/", "name": "Fried Irish Cabbage with Bacon", "summary": "\nCabbage fried in bacon grease with bacon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3399552.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (12 ounce) package bacon", "¼ cup bacon drippings", "1 small head cabbage, cored and finely chopped", "ground black pepper to taste"], "direction": ["Cook bacon in a deep skillet over medium heat until crisp, 5 to 7 minutes. Remove bacon from skillet and drain on a paper towel-lined plate. Reserve 1/4 cup drippings in skillet.", "Cook and stir cabbage in hot bacon drippings over medium heat until cabbage wilts, 5 to 7 minutes.", "Crumble bacon over cabbage. Stir and simmer until bacon is warmed, 2 to 3 minutes. Season with black pepper."], "facts": "220 calories; protein 8.5g 17% DV; carbohydrates 7.3g 2% DV; fat 17.8g 27% DV; cholesterol 30mg 10% DV; sodium 467.6mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213340/beer-braised-irish-stew-and-colcannon/", "name": "Beer Braised Irish Stew and Colcannon", "summary": "\nThis is a recipe I shared with my girlfriends from my recipe club last year! It is a yummy alternative to corned beef for St. Pat's Day and a wonderful anytime dish! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807159.jpg", "meta": [["prep:", "1 hr"], ["cook:", "2 hrs"], ["total:", "3 hrs"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1 (3 pound) beef chuck roast, trimmed of fat and cut into 1/2-inch cubes", "2 tablespoons all-purpose flour", "1 cup coarsely chopped onion", "1 cup coarsely chopped carrot", "1 (12 fluid ounce) can or bottle dark beer", "2  bay leaves", "1 teaspoon dried thyme", "1 teaspoon salt", "½ teaspoon ground black pepper", "2 cloves garlic, minced", "2 tablespoons Worcestershire sauce"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Heat the vegetable oil in a large Dutch oven over medium-high heat until very hot, and brown the meat in 2 batches, stirring to brown the cubes on all sides. Return all the meat to the Dutch oven, sprinkle with flour, and stir lightly to coat the meat with flour. Stir in onion, carrots, dark beer, bay leaves, thyme, 1 teaspoon salt, 1/2 teaspoon pepper, garlic, and Worcestershire sauce. Bring the mixture to a boil, and cover.", "Place the Dutch oven into the preheated oven, and cook for 45 minutes; uncover, stir the stew, and cook until the beef is very tender and the liquid is reduced by half, about 45 more minutes.", "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble the bacon and set aside.", "About 30 minutes before the stew is ready, make the colcannon: Place the potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.", "Place the cabbage into a microwave-safe bowl, and add 1 or 2 tablespoons of water. Cover and microwave on High for about 2 1/2 minutes; uncover (watch out for steam) and stir the cabbage. Cover and microwave for about 2 1/2 more minutes, until the cabbage is slightly tender but not mushy. Drain excess liquid, and set the cabbage aside, covered.", "Place the potatoes into a large bowl, and add milk, butter, 1/2 teaspoon of salt, and 1/4 teaspoon of pepper. Beat the potatoes with an electric mixer until smooth and creamy. Stir in the cabbage, crumbled bacon, and parsley until well combined.", "To serve, place a scoop of colcannon onto a plate, make a hollow, and fill with braised beef stew."], "facts": "453 calories; protein 25.3g 51% DV; carbohydrates 30.2g 10% DV; fat 24.4g 38% DV; cholesterol 89.4mg 30% DV; sodium 650.9mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270364/irish-cocktail-cupcakes/", "name": "Irish Cocktail Cupcakes", "summary": "\nIf you've ever had a shot of Irish whiskey and Irish cream dropped in a glass of Guinness®, this it in dessert form. The best cupcake ever. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6382465.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["additional:", "20 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "18"], ["Yield:", "18 cupcakes"]], "ingredients": ["1 cup Irish stout beer (such as Guinness®)", "9 tablespoons unsalted butter, cut into 1-inch pieces", "2 cups dark brown sugar", "¾ cup unsweetened cocoa powder", "¾ cup sour cream", "2  eggs", "1 tablespoon vanilla extract", "2 cups all-purpose flour", "2 ½ teaspoons baking soda"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.", "Combine stout beer and butter in a large saucepan over low heat. Heat until butter melts, about 5 minutes. Remove from heat and whisk in brown sugar and cocoa.", "Whisk sour cream, eggs, and vanilla extract in a bowl; pour into the saucepan and mix until a smooth batter forms.", "Stir flour and baking soda together. Fold into the batter. Divide batter evenly among the prepared muffin cups.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Leave in the tin for 10 minutes, then transfer to a wire rack to cool completely.", "Make frosting while the cupcakes cool. Place butter in a large mixing bowl and beat with an electric mixer on medium-high speed for 2 to 3 minutes. Mix in Irish cream and whiskey on low speed. Gradually spoon in confectioners' sugar, mixing on low speed until frosting is smooth and creamy.", "Spread frosting over cupcakes."], "facts": "370 calories; protein 3.4g 7% DV; carbohydrates 58.3g 19% DV; fat 14.1g 22% DV; cholesterol 53.7mg 18% DV; sodium 197.6mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/138020/st-patricks-colcannon/", "name": "St. Patrick's Colcannon", "summary": "\nThis is an 'Irish' way to deal with the leftover corned beef after the American corned beef and cabbage feast. My husband considers this a wonderful part of the corned beef cycle. I use red potatoes with skins on, substitute ham for the corned beef, and leeks for the green onions, depends on what's in the fridge. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F196199.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds red potatoes, quartered", "1 head cabbage, cored and shredded", "2 tablespoons butter", "½ cup butter", "1 teaspoon minced garlic", "4  green onions, sliced, white parts and tops separated", "white pepper to taste", "1 ¼ cups hot milk", "1 pound leftover corned beef, cut into pieces and warmed"], "direction": ["Place potatoes in a large saucepan and add water to cover by 1-inch. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes.", "Meanwhile, bring a large pot of salted water to a boil. Stir in cabbage along with 2 tablespoons of butter; cover, and simmer until the cabbage has softened. Drain.", "Melt 1/2-cup butter over medium heat. Stir in garlic and the white parts of the green onions. Cook until the garlic has softened and mellowed.", "Drain the potatoes and mash with white pepper to taste. Fold in melted butter, milk, cabbage, and corned beef. Sprinkle with green onion tops to serve."], "facts": "524 calories; protein 20g 40% DV; carbohydrates 38.2g 12% DV; fat 33.5g 52% DV; cholesterol 94.6mg 32% DV; sodium 190.5mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/", "name": "Slow-Cooker Corned Beef and Cabbage", "summary": "\nNo more dry corned beef!  Cook this in your slow cooker all day and you're guaranteed success!  Serve this with soda bread for a warm and satisfying meal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2152835.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 hrs"], ["total:", "9 hrs 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 large carrots, peeled and cut into matchstick pieces", "10  baby red potatoes, quartered", "1  onion, peeled and cut into bite-sized pieces", "4 cups water", "1 (4 pound) corned beef brisket with spice packet", "6 ounces beer", "½ head cabbage, coarsely chopped"], "direction": ["Place the carrots, potatoes, and onion into the bottom of a slow cooker, pour in the water, and place the brisket on top of the vegetables. Pour the beer over the brisket. Sprinkle on the spices from the packet, cover, and set the cooker on High.", "Cook the brisket for about 8 hours. An hour before serving, stir in the cabbage and cook for 1 more hour."], "facts": "473 calories; protein 23.6g 47% DV; carbohydrates 49.5g 16% DV; fat 19.6g 30% DV; cholesterol 99.5mg 33% DV; sodium 1280.6mg 51% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/", "name": "Corned Beef and Cabbage I", "summary": "\nWhat's more Irish than a traditional recipe for corned beef and cabbage?  Serve with mustard or horseradish if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F372809.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 35 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["3 pounds corned beef brisket with spice packet", "10 small red potatoes", "5  carrots, peeled and cut into 3-inch pieces", "1 large head cabbage, cut into small wedges"], "direction": ["Place corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef.  Cover pot and bring to a boil, then reduce to a simmer.  Simmer approximately 50 minutes per pound or until tender.", "Add whole potatoes and carrots, and cook until the vegetables are almost tender.  Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.", "Place vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain."], "facts": "839 calories; protein 49.6g 99% DV; carbohydrates 68.9g 23% DV; fat 41.3g 64% DV; cholesterol 147mg 49% DV; sodium 3377.5mg 141% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16947/amazingly-easy-irish-soda-bread/", "name": "Amazingly Easy Irish Soda Bread", "summary": "\nA good old fashioned soda bread with just the basic ingredients. Buttermilk gives this crusty loaf a good flavor. The best Irish soda bread around! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F995189.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "20"], ["Yield:", "1 1 1/2 pound loaf"]], "ingredients": ["4 cups all-purpose flour", "4 tablespoons white sugar", "1 teaspoon baking soda", "1 tablespoon baking powder", "½ teaspoon salt", "½ cup margarine, softened", "1 cup buttermilk", "1  egg", "¼ cup butter, melted", "¼ cup buttermilk"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Lightly grease a large baking sheet.", "In a large bowl, mix together flour, sugar, baking soda,  baking powder, salt and margarine. Stir in 1 cup of buttermilk and egg. Turn dough out onto a lightly floured surface and knead slightly. Form dough into a round and place on prepared baking sheet. In a small bowl, combine melted butter with 1/4 cup buttermilk; brush loaf with this mixture. Use a sharp knife to cut an 'X' into the top of the loaf.", "Bake in preheated oven until a toothpick inserted into the center of the loaf comes out clean,  45 to 50 minutes. Check for doneness after 30 minutes. You may continue to brush the loaf with the butter mixture while it bakes."], "facts": "172 calories; protein 3.5g 7% DV; carbohydrates 22.5g 7% DV; fat 7.5g 12% DV; cholesterol 16mg 5% DV; sodium 269.1mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/234534/beef-and-guinness-stew/", "name": "Beef and Guinness® Stew", "summary": "\nThe maltiness of dark beer really does amazing things for this gravy. It's a very simple dish, but at the same time it has a deep, complex, rich flavor. I served this in a nice ring of green onion-mashed potatoes. I hope you give this a try, whether for St. Patrick's Day or anytime of the year. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1111973.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 30 mins"], ["total:", "3 hrs"], ["Servings:", "6"], ["Yield:", "6 large servings"]], "ingredients": ["4 slices bacon, cut into small pieces", "2 ½ pounds boneless beef chuck, cut into 2-inch pieces", "1 teaspoon salt, or more to taste", "freshly ground black pepper to taste", "2  onions, coarsely chopped", "½ teaspoon salt", "4 cloves garlic, minced", "1 (14.9 ounce) can dark beer (such as Guinness®)", "¼ cup tomato paste", "4 sprigs fresh thyme", "3  carrots, cut into 1-inch pieces", "2 stalks celery, cut into 1-inch pieces", "1 teaspoon white sugar", "½ teaspoon freshly ground black pepper, or to taste", "2 ½ cups chicken stock, or as needed to cover", "4 cups mashed potatoes  (Optional)"], "direction": ["Cook and stir bacon in a heavy skillet over medium-high heat until bacon is browned and crisp, 3 to 4 minutes. Turn off heat and transfer bacon into a large stew pot, reserving bacon fat in the skillet.", "Season beef chuck cubes generously with 1 teaspoon salt and black pepper to taste. Turn heat to high under skillet and sear beef pieces in the hot fat on both sides until browned, about 5 minutes. Place beef in stew pot with bacon, leaving fat in skillet. Turn heat down to medium; cook and stir onions in the retained fat in the skillet until lightly browned, 5 to 8 minutes; season with a large pinch of salt.", "Cook garlic with onions until soft, about 1 minute; pour beer into skillet and stir with a wooden spoon, scraping up and dissolving any browned bits of food into the liquid. Pour cooking liquid from skillet into the stew pot. Stir in tomato paste, thyme sprigs, carrots, celery, sugar, 1/2 teaspoon black pepper, and enough chicken broth to cover.", "Bring stew to a gentle simmer, stirring to combine; reduce heat to low and cover pot. Simmer stew until beef is fork-tender, about 2 hours. Stir stew occasionally and skim fat or foam if desired.", "Remove cover and raise heat to medium-high. Bring stew to a low boil and cook until stew has slightly thickened, 15 to 20 minutes. Remove and discard thyme sprigs and adjust salt and pepper to taste.", "Arrange mashed potatoes in a ring in a serving bowl; ladle stew into the center of the potatoes."], "facts": "528 calories; protein 29.4g 59% DV; carbohydrates 42.1g 14% DV; fat 24.6g 38% DV; cholesterol 95.7mg 32% DV; sodium 1605.1mg 64% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/24483/green-grog/", "name": "Green Grog", "summary": "\nWe like to call it the green drink. It's sweet, it's sour, it's tasty and it packs a real punch so go slow. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F726628.jpg", "meta": [["prep:", "7 mins"], ["total:", "7 mins"], ["Servings:", "25"], ["Yield:", "25 (8 ounce) servings"]], "ingredients": ["2 (12 fluid ounce) cans frozen limeade concentrate", "2 (12 fluid ounce) cans frozen lemonade concentrate", "2 (2 liter) bottles lemon-lime flavored carbonated beverage", "1 (750 milliliter) bottle rum", "2 quarts lime sherbet"], "direction": ["In a large pot, combine limeade, lemonade and lemon-lime soda. Stir in rum (add more to taste if desired.) Mix in the lime sherbet."], "facts": "368 calories; protein 0.8g 2% DV; carbohydrates 74.5g 25% DV; fat 1.3g 2% DV; cholesterol 3.7mg 1% DV; sodium 48.7mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/163145/creamed-cabbage/", "name": "Creamed Cabbage", "summary": "\nThis is yummy for St. Paddy's Day! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2284428.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4 slices bacon", "¼ cup butter", "1 tablespoon all-purpose flour", "1 teaspoon salt", "1 large head cabbage, cored and shredded", "½ cup sour cream"], "direction": ["Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to cool.", "Whisk the butter, flour, and salt into the drippings in the same pan. Stir in the cabbage, and cook, stirring occasionally, over medium heat until cabbage is tender, about 15 minutes. Crumble the bacon; stir the bacon pieces and sour cream into the cabbage mixture."], "facts": "251 calories; protein 5.6g 11% DV; carbohydrates 14g 5% DV; fat 20.3g 31% DV; cholesterol 41.5mg 14% DV; sodium 645.2mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100506/irish-potato-farls/", "name": "Irish Potato Farls", "summary": "\nThe word farl originates from the Gaelic word fardel meaning four parts. These potato griddle breads can be made with leftover mashed potatoes too.  Serve hot with a little butter and salt, or fry them alongside soda bread as part of an Ulster Fry-up. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5228161.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 farls"]], "ingredients": ["4 medium potatoes, peeled and halved", "1 pinch salt", "¼ cup all-purpose flour, plus extra for dusting", "1 tablespoon melted butter"], "direction": ["In a  pot, cover potatoes with water and bring to a boil over high heat. Simmer on medium-high heat until the center of the potatoes are tender when pricked with a fork, about 20 minutes. Turn off heat. Drain, return potatoes to pot and allow to completely dry out over remaining heat. Mash with a potato masher until smooth.", "Place warm mashed potato in medium bowl. Stir in flour, salt and melted butter. Mix lightly until dough forms.", "On a well floured surface, knead the dough lightly. The dough will be sticky. Use a floured rolling pin to flatten into a 9 inch circle about 1/4 inch thick. Cut into quarters using a floured knife.", "Sprinkle a little flour into the base of the skillet and cook the farls for 3 minutes on each side or until evenly browned. Season with a little salt and serve straight away."], "facts": "218 calories; protein 5.1g 10% DV; carbohydrates 43.2g 14% DV; fat 3.1g 5% DV; cholesterol 7.6mg 3% DV; sodium 33.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213830/brennans-irish-soda-bread/", "name": "Brennan's Irish Soda Bread", "summary": "\nWarm and soft Irish tradition passed down our family line, and directly into our bellies. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808386.jpg", "meta": [["prep:", "10 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "1 round loaf"]], "ingredients": ["1 cup milk", "2 tablespoons distilled white vinegar", "2 cups all-purpose flour", "1 tablespoon white sugar", "½ teaspoon baking soda", "½ teaspoon salt"], "direction": ["Stir the milk and vinegar together, and allow to stand until curdled, about 10 minutes.", "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet. In a bowl, mix together the flour, sugar, baking soda, and salt.", "Gradually stir the soured milk into the flour mixture until the dough just comes together, and turn the dough out onto a well-floured surface. Knead a few times, and shape into a round. Place the dough onto the prepared baking sheet. With a sharp knife, cut an X shape into the top of the dough to release steam and help the bread keep its round shape.", "Bake in the preheated oven until golden brown, about 45 minutes."], "facts": "135 calories; protein 4.2g 9% DV; carbohydrates 26.8g 9% DV; fat 0.9g 1% DV; cholesterol 2.4mg 1% DV; sodium 237.1mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/30918/irish-boiled-dinner-corned-beef/", "name": "Irish Boiled Dinner (Corned Beef)", "summary": "\nMouth watering tender corned beef with corned beef flavored potatoes, cabbage, and carrots. This is my great grandmothers recipe from Ireland. This was served with both Irish soda bread and corn bread at our house. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2432850.jpg", "meta": [["prep:", "1 hr"], ["cook:", "5 hrs"], ["total:", "6 hrs"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (5 1/2 pound) corned beef brisket", "2 large onions", "15 small white (Irish) potatoes", "10  carrots, cut into 1 inch pieces", "2 heads cabbage, cored and cut into wedges"], "direction": ["Rinse the beef brisket under cold water, and place in a large pot. Add enough water to cover the roast by 6 inches.  Peel the onions, and place them in the pot with the roast. Bring to a boil, and cook for about 30 minutes at a rolling boil. Reduce heat to medium-low so that the water is at a gentle boil, cover, and cook for 3 1/2 hours.", "Remove the lid from the brisket. Remove onions, and cut into wedges. Return them to the pot. Add carrots to the pot, then place the cabbage over the roast. Place the potatoes on top of the cabbage. Place the lid back on the pot, and cook for another 30 minutes, until potatoes are tender. The potatoes should be immersed in the water by now, but if not, keep the lid on so they can steam.", "Remove the vegetables from the pot, and place in a separate serving bowl. Keep the corned beef in the pot until ready to slice and serve because it dries out quickly."], "facts": "918 calories; protein 47g 94% DV; carbohydrates 106.6g 34% DV; fat 35.7g 55% DV; cholesterol 178.6mg 60% DV; sodium 2247.6mg 90% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/74819/baby-guinness/", "name": "Baby Guinness", "summary": "\nA delicious shooter that looks like a mini-pint of Guinness. Also learned this one in London. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F803793.jpg", "meta": [["prep:", "1 min"], ["total:", "1 min"], ["Servings:", "1"], ["Yield:", "1 shot"]], "ingredients": ["2 fluid ounces coffee flavored liqueur", "½ fluid ounce Irish cream liqueur"], "direction": ["Fill a shot glass almost to the top with coffee liqueur. Top off with Irish cream. It should float perfectly on top making the ''head'' of your shot."], "facts": "269 calories; protein 0.1g; carbohydrates 29.3g 10% DV; fat 0.3g; cholesterol 0mg; sodium 6.6mg."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/236988/chef-johns-irish-pork-stew/", "name": "Chef John's Irish Pork Stew", "summary": "\nI'm sure you've heard by now that corned beef and cabbage is not authentic St. Patrick's Day food. I decided to do a little mash-up and this Irish pork stew with baby cabbage was the result. By the way, baby cabbage can be a little hard to find, but you can use Brussels sprouts, and no one will know the difference, mostly because there isn't one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2158157.jpg", "meta": [["prep:", "25 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (2 1/2 pound) boneless pork shoulder, cut into 2-inch cubes", "salt and ground black pepper to taste", "1 tablespoon vegetable oil", "1 tablespoon butter", "1 large onion, chopped", "2 cloves garlic, minced", "1 tablespoon all-purpose flour", "1  bay leaf", "¾ teaspoon caraway seed", "1 (12 fluid ounce) bottle dark beer (such as Guinness®)", "2 cups chicken broth", "3  carrots, cut into 1-inch pieces", "2 stalks celery, cut into 1-inch pieces", "¼ cup chopped fresh flat-leaf parsley", "3 tablespoons balsamic vinegar", "12  Brussels sprouts, halved", "3 cups mashed potatoes, or as needed", "1 teaspoon chopped fresh flat-leaf parsley, or to taste"], "direction": ["Season pork cubes with salt and black pepper.", "Heat vegetable oil in a pot over high heat. Working in batches, cook and stir pork in hot oil until browned on all sides, 5 to 10 minutes. Transfer pork to a bowl and reduce heat to medium.", "Melt butter in the pot. Cook and stir onion with a pinch of salt in hot butter until onion is softened and translucent, 7 to 10 minutes. Add garlic; saute until fragrant, about 30 seconds.", "Stir flour into onion mixture; cook and stir until flour is completely incorporated, about 2 minutes. Add bay leaf and caraway seed; cook for 2 minutes more. Pour beer into onion mixture. Cook and stir until thickened, 1 to 3 minutes.", "Stir pork, chicken broth, carrots, and celery into beer mixture; bring to simmer. Stir 1/4 cup parsley and balsamic vinegar into stew, reduce heat to medium-low, and simmer until pork is fork-tender, about 2 hours.", "Bring a large pot of lightly salted water to a boil. Add the Brussels sprouts and cook uncovered until almost tender, about 5 minutes. Drain.", "Stir Brussels sprouts into stew and simmer until heated through, about 5 minutes. Season with salt and pepper to taste. Divide mashed potatoes between 6 bowls. Ladle stew over potatoes and top each with a pinch of parsley."], "facts": "401 calories; protein 20.3g 41% DV; carbohydrates 32.9g 11% DV; fat 19.4g 30% DV; cholesterol 68.3mg 23% DV; sodium 768.5mg 31% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/231030/braised-corned-beef-brisket/", "name": "Braised Corned Beef Brisket", "summary": "\nYou have never had corned beef like this and if you try it, I truly believe you will never go back to the traditionally 'boiled' beef. This recipe was given to my mother-in-law during WWII by her Jewish boarding house owner and it has become a treasured family recipe. Unlike the commonly boiled corned beef, this is a slow braise that is tender, flavorful, and has a caramelized surface when it's done. I serve it with colcannon, steamed cabbage wedges, braised carrots, and parsnips. It is our favorite St. Patrick's/Jewish dinner, but we love it so much that I cook it year around. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F995620.jpg", "meta": [["prep:", "15 mins"], ["cook:", "6 hrs 15 mins"], ["total:", "6 hrs 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (5 pound) flat-cut corned beef brisket", "1 tablespoon browning sauce (such as Kitchen Bouquet®), or as desired", "1 tablespoon vegetable oil", "1  onion, sliced", "6 cloves garlic, sliced", "2 tablespoons water"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Discard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.", "Place brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.", "Roast in the preheated oven until meat is tender, about 6 hours."], "facts": "455 calories; protein 30.6g 61% DV; carbohydrates 5.4g 2% DV; fat 33.7g 52% DV; cholesterol 162mg 54% DV; sodium 1877.4mg 75% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216071/true-bangers-and-mash-with-onion-gravy/", "name": "True Bangers and Mash with Onion Gravy", "summary": "\nBangers and mash gets its name because sausages used to burst (or bang) while cooking, due to rusk (dried bread) being added to the meat. Mash, meanwhile, refers to the mashed potatoes.  This recipe was a staple at our home in Dublin at Halloween.  It is a very cheap, very traditional supper, and one that truly requires good sausage. Try to use a good quality sausage or perhaps even a bratwurst. Please note that this is a very thin gravy, as is traditional. It will still be very liquidy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F815033.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 links pork sausage", "2 pounds potatoes, peeled and cubed", "¼ cup butter", "2 tablespoons milk", "1 teaspoon dry mustard powder", "salt and ground black pepper to taste", "1 tablespoon butter", "2 large onions, chopped", "6 cups beef broth", "2 cups red wine"], "direction": ["Preheat oven to 200 degrees F (95 degrees C).", "Cook the sausage links in a skillet over medium-low heat until browned on all sides, about 5 minutes per side; transfer to an oven-safe dish and move to the preheated oven to keep warm.", "Place potatoes into a saucepan over medium heat, cover with water, and boil gently until potatoes are tender, 10 to 15 minutes. Drain and allow to steam dry for a minute or two. Mix in 1/4 cup of butter, milk, dry mustard, salt, and black pepper; mash until fluffy and smooth. Set aside.", "Melt 1 tablespoon butter in a skillet over medium-high heat; cook the onions until translucent and just starting to brown, about 8 minutes. Pour in the beef broth and red wine; boil the mixture down to about half its volume, about 10 minutes. Season with salt and black pepper. To serve, place a sausage onto a serving plate with about 1/2 cup of mashed potatoes. Pour the onion gravy over the sausage and potatoes."], "facts": "516 calories; protein 14.1g 28% DV; carbohydrates 50.4g 16% DV; fat 19.8g 30% DV; cholesterol 57.6mg 19% DV; sodium 1414mg 57% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220519/irish-shepherds-pie/", "name": "Irish Shepherd's Pie", "summary": "\nThis makes a lovely alternative to the much more common corned beef and cabbage that you may have been planning for St. Patrick's Day dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4413707.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "8"], ["Yield:", "1 9x13-inch casserole"]], "ingredients": ["1 tablespoon olive oil", "1 tablespoon butter", "1  onion, diced", "2 pounds lean ground lamb", "⅓ cup all-purpose flour", "salt and ground black pepper to taste", "2 teaspoons minced fresh rosemary", "1 teaspoon paprika", "⅛ teaspoon ground cinnamon", "1 tablespoon ketchup", "3 cloves garlic, minced", "2 ½ cups water, or as needed", "1 (12 ounce) package frozen peas and carrots, thawed", "2 ½ pounds Yukon Gold potatoes, peeled and halved", "1 tablespoon butter", "1 pinch ground cayenne pepper", "¼ cup cream cheese", "¼ pound Irish cheese (such as Dubliner®), shredded", "salt and ground black pepper to taste", "1  egg yolk", "2 tablespoons milk"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Place olive oil and butter in Dutch oven over medium heat. Stir in onion and ground lamb; brown the meat, breaking it up into small crumbles as it cooks, about 10 minutes.", "Stir in flour until incorporated, then mix in salt, black pepper, rosemary, paprika, cinnamon, ketchup, and garlic; cook and stir until garlic is fragrant, 2 to 3 minutes.", "Stir in water and scrape up any brown bits from the bottom of the Dutch oven. Reduce heat to medium-low and bring mixture to a simmer; cook and stir until thick, about 5-6 minutes.", "Remove lamb mixture from heat and stir in peas and carrots until combined.", "Spread lamb mixture into the bottom of a 9x13-inch baking dish and set aside.", "Place potatoes into a large pan of salted water. Bring to a boil, reduce heat to medium, and cook until tender, about 15 minutes. Drain well and return potatoes to pan.", "Mash butter, cayenne pepper, cream cheese, and Irish cheese into the potatoes. Mash until combined and potatoes are smooth. Season to taste with salt and black pepper.", "Whisk together egg yolk and milk in a small bowl; stir into the mashed potato mixture.", "Top the lamb mixture in the baking dish with the mashed potatoes and spread evenly to cover.", "Bake in the preheated oven until the top is golden brown and sauce is bubbling up around the edges, 25 to 30 minutes."], "facts": "517 calories; protein 29.2g 58% DV; carbohydrates 37.2g 12% DV; fat 28.3g 44% DV; cholesterol 132.3mg 44% DV; sodium 301mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216981/deluxe-corned-beef-hash/", "name": "Deluxe Corned Beef Hash", "summary": "\nI purposely cook a whole corned beef just to make hash.  There's nothing like the taste of fresh versus canned hash.  This is also good for leftover St. Paddy's Day corned beef.  I throw the carrot in for color, claiming it's the Leprechaun's gold. Serve with fried eggs and brown soda bread (farls). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808820.jpg", "meta": [["prep:", "30 mins"], ["cook:", "40 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "1 large onion, chopped", "5 large Yukon Gold potatoes, peeled and cut into 1/4-inch cubes", "1 large carrot, coarsely shredded", "2 pounds cooked corned beef, cubed", "2 tablespoons chopped fresh parsley", "¼ teaspoon dried thyme leaves", "1 pinch salt to taste", "½ teaspoon ground black pepper, or to taste"], "direction": ["Melt butter with the olive oil in a large skillet over medium heat, and cook the onion just until it begins to brown, about 8 minutes; stir in the potatoes and carrot, and cook until tender, about 15 minutes, stirring occasionally. Stir in the cubed corned beef, parsley, thyme, salt, and pepper. Let the mixture cook until hash is crisp and browned, stirring often, 10 to 15 more minutes."], "facts": "320 calories; protein 24.7g 49% DV; carbohydrates 24.6g 8% DV; fat 14.1g 22% DV; cholesterol 81.5mg 27% DV; sodium 1559.4mg 62% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/176054/pudding-shots/", "name": "Pudding Shots", "summary": "\nIf you're looking for a little something special for an adult event and are tired of the traditional gelatin shots, this one's for you!  It's quick and easy and tastes GREAT! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807175.jpg", "meta": [["prep:", "15 mins"], ["additional:", "30 mins"], ["total:", "45 mins"], ["Servings:", "15"], ["Yield:", "15 shots"]], "ingredients": ["1 cup milk", "½ cup Irish cream liqueur (eg. Bailey's®)", "½ cup vodka (eg. Smirnoff®)", "1 (4 serving size) package instant chocolate pudding mix"], "direction": ["Whisk together the milk, Irish cream liqueur, vodka, and instant pudding mix in a bowl until combined. Continue whisking for 2 minutes.", "Spoon the pudding mixture into shot glasses or disposable 'party shot' cups. Chill until set, about 30 minutes. The shots will have the consistency of mousse."], "facts": "84 calories; protein 0.7g 1% DV; carbohydrates 11g 4% DV; fat 0.5g 1% DV; cholesterol 1.3mg; sodium 112.1mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/23534/original-irish-cream/", "name": "Original Irish Cream", "summary": "\nIrish whiskey mixed with cream and sugar with hints of coffee, chocolate, vanilla, and almond. Will keep for 2 months if refrigerated. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F290354.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "16"], ["Yield:", "4 cups"]], "ingredients": ["1 cup heavy cream", "1 (14 ounce) can sweetened condensed milk", "1 ⅔ cups Irish whiskey", "1 teaspoon instant coffee granules", "2 tablespoons chocolate syrup", "1 teaspoon vanilla extract", "1 teaspoon almond extract"], "direction": ["In a blender, combine heavy cream, sweetened condensed milk, Irish whiskey, instant coffee, chocolate syrup, vanilla extract, and almond extract. Blend on high for 20 to 30 seconds. Store in a tightly sealed container in the refrigerator. Shake well before serving."], "facts": "197 calories; protein 2.3g 5% DV; carbohydrates 15.4g 5% DV; fat 7.7g 12% DV; cholesterol 28.7mg 10% DV; sodium 38.5mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16035/irish-lamb-stew/", "name": "Irish Lamb Stew", "summary": "\nHearty and traditional Irish lamb stew. It's best to refrigerate the stew overnight, and reheat it the next day for eating. This soup 'ages' well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2432842.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 45 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 ½ pounds thickly sliced bacon, diced", "6 pounds boneless lamb shoulder, cut into 2 inch pieces", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ cup all-purpose flour", "3 cloves garlic, minced", "1 large onion, chopped", "½ cup water", "4 cups beef stock", "2 teaspoons white sugar", "4 cups diced carrots", "2 large onions, cut into bite-size pieces", "3  potatoes", "1 teaspoon dried thyme", "2  bay leaves", "1 cup white wine"], "direction": ["Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble, and set aside.", "Put lamb, salt, pepper, and flour in large mixing bowl. Toss to coat meat evenly. Brown meat in frying pan with bacon fat.", "Place meat into stock pot (leave 1/4 cup of fat in frying pan). Add the garlic and yellow onion and saute till onion begins to become golden. Deglaze frying pan with 1/2 cup water and add the garlic-onion mixture to the stock pot with bacon pieces, beef stock, and sugar. Cover and simmer for 1 1/2 hours.", "Add carrots, onions, potatoes, thyme, bay leaves, and wine to pot. Reduce heat, and simmer covered for 20 minutes until vegetables are tender."], "facts": "672 calories; protein 46.4g 93% DV; carbohydrates 26.3g 9% DV; fat 39.3g 61% DV; cholesterol 162.7mg 54% DV; sodium 1189.4mg 48% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/241419/potato-scones/", "name": "Potato Scones", "summary": "\nComing from an Irish and Scottish background, these scones are the perfect side with any breakfast meal as well as a family favorite! Enjoy. Add onion, pepper, or any other spices for flavor. Serve with butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2082789.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["total:", "30 mins"], ["Servings:", "6"], ["Yield:", "6 scones"]], "ingredients": ["1 pound cooked potatoes", "4 ounces self-rising flour", "2 ounces butter", "½ pinch salt"], "direction": ["Heat a lightly greased griddle or cast iron skillet over medium-high heat.", "Mash potatoes with flour, butter, and salt until a stiff dough forms.", "Turn dough out onto a lightly floured work surface. Knead dough lightly and roll dough out to about 1/2-inch thick. Cut into six triangular wedges.", "Working in batches, cook scones, turning once on hot griddle until golden brown, 4 to 5 minutes per side."], "facts": "198 calories; protein 3.2g 6% DV; carbohydrates 29g 9% DV; fat 7.8g 12% DV; cholesterol 20.1mg 7% DV; sodium 307.5mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/236603/chef-johns-irish-stew/", "name": "Chef John's Irish Stew", "summary": "\nPay attention to the cut of lamb used in this recipe. I used lamb shoulder chops, which are a fantastic value, when you consider flavor, useable meat, and price. They will probably be the cheapest lamb at the store, have more flavor and richness than leg meat, and are cheaper than shanks and loins. It takes a while for the meat to braise and fall off the bone, but it's a wait rewarded with tender, succulent chucks of lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3792561.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 45 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds lamb shoulder chops", "salt and ground black pepper to taste", "1 tablespoon vegetable oil", "1  onion, chopped", "1 tablespoon butter", "2 tablespoons all-purpose flour", "3 cups chicken stock", "½ teaspoon dried rosemary", "2  carrots, chopped", "2 stalks celery, chopped", "water as needed", "1 ½ pounds baby Dutch yellow potatoes", "¼ cup chopped green onions"], "direction": ["Season lamb shoulder chops with salt and black pepper.", "Heat oil in a large heavy skillet over high heat. Working in batches, cook lamb shoulder chops until browned on both sides, 3 to 5 minutes per side. Transfer chops to a stock pot.", "Cook and stir onion with a pinch of salt in the same skillet over medium heat until slightly softened and edges are browning, about 5 minutes. Stir butter into onion until melted; add flour and stir until onions are coated, about 1 minute.", "Pour stock into onion mixture; bring to a boil, add rosemary, and stir until mixture thickens, 5 to 10 minutes.", "Stir carrots and celery into pot with lamb shoulder chops and pour chicken stock mixture over the top. Add water as needed to cover meat completely. Bring mixture to a simmer, reduce heat to low, cover the pot with a lid, and cook until meat is almost falling off the bone, about 1 1/2 hours.", "Transfer meat to a plate. Stir potatoes into stew and return meat to stew, placing on top of vegetables. Simmer, covered, until potatoes are tender and meat is falling off the bone, about 30 minutes.", "Transfer meat to a plate using a slotted spoon. Bring stew to a boil and cook, skimming off fat, until stew is reduced and thick, 10 to 12 minutes.", "Remove meat from bones; discard bones and any pieces of fat. Stir meat back into stew. Stir green onions into stew and season with salt and pepper to taste."], "facts": "508 calories; protein 32.1g 64% DV; carbohydrates 28.6g 9% DV; fat 29.1g 45% DV; cholesterol 120.5mg 40% DV; sodium 465.8mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270606/instant-pot-shepherds-pie/", "name": "Instant Pot® Shepherd's Pie", "summary": "\nThis family friendly shepherd's pie uses ground beef (instead of the traditional lamb), and your Instant Pot® or multi-cooker pressure cooker to prepare the filling and potatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6355170.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1 pound ground beef", "1 cup onion, diced", "3 cloves garlic, minced", "½ teaspoon salt", "¼ teaspoon ground black pepper", "1 tablespoon tomato paste", "1 tablespoon Worcestershire sauce", "½ teaspoon thyme", "1 cup beef broth", "2 cups frozen peas and carrots", "3 medium potatoes, peeled", "½ cup half-and-half", "2 tablespoons butter", "¼ teaspoon garlic salt"], "direction": ["Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat oil and add ground beef, onion, garlic, salt, and pepper. Cook until ground beef has browned and onions are soft and translucent, about 5 minutes. Stir in tomato paste, Worcestershire sauce, and thyme. Pour in beef broth and add frozen peas and carrots. Stir until everything is well blended and turn off Saute function.", "Place your Instant Pot's® metal collapsible trivet in the pot so that it rests a little bit above the meat mixture. Place the peeled potatoes on top of the trivet. Close and lock the lid. Select high pressure according to manufacturer's instructions. Set timer for 15 minutes if potatoes are on the smaller side or 20 minutes if they are medium or large. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Open the lid and transfer potatoes to a bowl. Turn off Instant Pot® and carefully remove the metal trivet (it will be hot).", "Add half-and-half, butter, and garlic salt to bowl with the potatoes. Mash until well blended.", "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler.", "Assemble the pie by pouring the meat mixture from the Instant Pot® into an 8-inch square baking pan. Spoon the mashed potatoes over the meat mixture and spread out evenly.", "Broil the shepherd's pie in the preheated oven until the top starts to golden and brown, about 3 minutes."], "facts": "347 calories; protein 18.2g 37% DV; carbohydrates 29.4g 10% DV; fat 18g 28% DV; cholesterol 64.9mg 22% DV; sodium 576.4mg 23% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11116/cream-cheese-sugar-cookies/", "name": "Cream Cheese Sugar Cookies", "summary": "\nA soft, chewy, and flavorful sugar cookie. It is very important to chill the dough, as it is too sticky to roll unless well chilled. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1122074.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "9 hrs"], ["total:", "9 hrs 25 mins"], ["Servings:", "72"], ["Yield:", "6 dozen"]], "ingredients": ["1 cup white sugar", "1 cup butter, softened", "1 (3 ounce) package cream cheese, softened", "½ teaspoon salt", "½ teaspoon almond extract", "½ teaspoon vanilla extract", "1  egg yolk", "2 ¼ cups all-purpose flour"], "direction": ["In a large bowl, combine the sugar, butter, cream cheese, salt, almond and vanilla extracts, and egg yolk. Beat until smooth. Stir in flour until well blended. Chill the dough for 8 hours, or overnight.", "Preheat oven to 375 degrees F (190 degrees C).", "On a lightly floured surface, roll out the dough 1/3 at a time to 1/8 inch thickness, refrigerating remaining dough until ready to use. Cut into desired shapes with lightly floured cookie cutters. Place 1 inch apart on ungreased cookie sheets. Leave cookies plain for frosting, or brush with slightly beaten egg white and sprinkle with candy sprinkles or colored sugar.", "Bake for 7 to 10 minutes in the preheated oven, or until light and golden brown. Cool cookies completely before frosting."], "facts": "53 calories; protein 0.6g 1% DV; carbohydrates 5.8g 2% DV; fat 3.1g 5% DV; cholesterol 10.9mg 4% DV; sodium 38mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220546/onion-jam/", "name": "Onion Jam", "summary": "\nA family favorite. Expect a few wrinkled noses maybe at the title, but result is worth the effort. Maybe not for beginning cooks since there's a couple potentially tricky steps. Serve a cup of jam over a bar of cream cheese with crackers, or as a spread for meat sandwiches. Keep in refrigerator in covered container for up to two weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807144.jpg", "meta": [["prep:", "25 mins"], ["cook:", "55 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "32"], ["Yield:", "32 servings"]], "ingredients": ["¼ cup vegetable oil", "½ cup white sugar", "4 cups onion, coarsely chopped", "¼ teaspoon salt", "ground black pepper to taste", "½ cup red wine vinegar"], "direction": ["Heat vegetable oil in a heavy skillet over medium heat.", "Stir sugar into vegetable oil with a wooden spoon, stirring constantly until mixture is a light caramel-color, about 10 minutes. Mixture will be very hot.", "Stir onion, salt, and black pepper into sugar mixture. Onions will immediately start to caramelize. Stir frequently over medium heat until sugar has dissolved and onions are browned, about 15 minutes.", "Pour red wine vinegar into onion mixture and simmer until mixture has a jam consistency, about 30 minutes. Let cool to serve."], "facts": "37 calories; protein 0.2g 1% DV; carbohydrates 5.4g 2% DV; fat 1.7g 3% DV; cholesterol 0mg; sodium 19mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10118/rainbow-cookies/", "name": "Rainbow Cookies", "summary": "\nMoist, mellow, and full of almond flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4803073.jpg", "meta": [["prep:", "45 mins"], ["cook:", "10 mins"], ["additional:", "9 hrs 35 mins"], ["total:", "10 hrs 30 mins"], ["Servings:", "96"], ["Yield:", "8 dozen"]], "ingredients": ["8 ounces almond paste", "1 cup butter, softened", "1 cup white sugar", "4  eggs, separated", "2 cups all-purpose flour", "6 drops red food coloring", "6 drops green food coloring", "¼ cup seedless red raspberry jam", "¼ cup apricot jam", "1 cup semisweet chocolate chips, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line three 9x13 inch baking pans with parchment paper.", "In a large bowl, break apart almond paste with a fork, and cream together with butter, sugar, and egg yolks. When mixture is fluffy and smooth, stir in flour to form a dough. In a small bowl, beat egg whites until soft peaks form. Fold egg whites into the dough. Divide dough into 3 equal portions. Mix one portion with red food coloring, and one with green food coloring. Spread each portion into one of the prepared baking pans.", "Bake 10 to 12 minutes in the preheated oven, until lightly browned. Carefully remove from pan and parchment paper, and cool completely on wire racks.", "Place green layer onto a piece of plastic wrap large enough to wrap all three layers. Spread green layer with raspberry jam, and top with uncolored layer. Spread with apricot jam, and top with pink layer. Transfer layers to a baking sheet, and enclose with plastic wrap. Place a heavy pan or cutting board on top of wrapped layers to compress. Chill in the refrigerator 8 hours, or overnight.", "Remove plastic wrap. Top with melted chocolate chips, and refrigerate 1 hour, or until chocolate is firm. Slice into small squares to serve."], "facts": "61 calories; protein 0.8g 2% DV; carbohydrates 7.4g 2% DV; fat 3.3g 5% DV; cholesterol 12.8mg 4% DV; sodium 17.3mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11843/irish-chicken-and-dumplings/", "name": "Irish Chicken and Dumplings", "summary": "\nThis is our family's very favorite comfort food. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7154569.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (10.75 ounce) cans  condensed cream of chicken soup", "3 cups water", "1 cup chopped celery", "2  onions, quartered", "1 teaspoon salt", "½ teaspoon poultry seasoning", "½ teaspoon ground black pepper", "4  skinless, boneless chicken breast halves", "5  carrots, sliced", "1 (10 ounce) package frozen green peas", "4  potatoes, quartered", "3 cups baking mix", "1 ⅓ cups milk"], "direction": ["In large, heavy pot, combine soup, water, chicken, celery, onion, salt, poultry seasoning, and pepper. Cover and cook over low heat about 1 1/2 hours.", "Add potatoes and carrots; cover and cook another 30 minutes.", "Remove chicken from pot, shred it, and return to pot. Add peas and cook only 5 minutes longer.", "Add dumplings. To make dumplings: Mix baking mix and milk until a soft dough forms. Drop by tablespoonfuls onto BOILING stew. Simmer covered for 10 minutes, then uncover and simmer an additional 10 minutes."], "facts": "595 calories; protein 33.9g 68% DV; carbohydrates 94.4g 31% DV; fat 9.2g 14% DV; cholesterol 58.1mg 19% DV; sodium 2401.8mg 96% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100811/fabulous-fried-cabbage/", "name": "Fabulous Fried Cabbage", "summary": "\nA favorite old Irish family recipe for fried cabbage and it's so easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F567274.jpg", "meta": [["prep:", "5 mins"], ["cook:", "45 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 teaspoons butter", "1 (15 ounce) can chicken broth", "1 head cabbage, cored and coarsely chopped", "1 pinch salt and pepper to taste"], "direction": ["Bring the butter and chicken broth to a boil in a large skillet. Reduce heat to low and add the cabbage. Cover and cook over low heat to steam the cabbage for about 45 minutes, stirring frequently, or until cabbage is tender and sweet. Season with salt and pepper and serve."], "facts": "66 calories; protein 2.9g 6% DV; carbohydrates 11.8g 4% DV; fat 1.7g 3% DV; cholesterol 5.4mg 2% DV; sodium 384.4mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100295/irish-champ/", "name": "Irish Champ", "summary": "\nLooks similar to colcannon, but champ is native to the North of Ireland. It's made by blending scallions or green onions with creamy mashed potatoes. Great on its own, served steaming hot with extra butter which will melt through it. But it's also the perfect side dish for good quality sausages. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F799254.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds potatoes, peeled and halved", "1 cup milk", "1 bunch green onions, thinly sliced", "½ teaspoon salt, or to taste", "¼ cup butter", "1 pinch freshly ground black pepper to taste"], "direction": ["Place potatoes into large pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 20 minutes.", "Drain well. Return to very low heat and allow the potatoes to dry out for a few minutes. (It helps if you place a clean dish towel over the potatoes to absorb any remaining moisture.)", "Meanwhile, heat the milk and green onions gently in a saucepan, until warm.", "Mash the potatoes, salt and butter together until smooth.  Stir in the milk and green onion until evenly mixed. Season with freshly ground black pepper. Serve piping hot in bowls. Set out some extra butter for individuals to add to their servings."], "facts": "326 calories; protein 7.8g 16% DV; carbohydrates 46.8g 15% DV; fat 13g 20% DV; cholesterol 35.4mg 12% DV; sodium 420.1mg 17% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220562/lime-sherbet-punch/", "name": "Lime Sherbet Punch", "summary": "\nA holiday favorite that everyone looks for year after year. You'll learn to buy the lime sherbet in advance since the stores sell out around the holidays. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808249.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "18"], ["Yield:", "18 servings"]], "ingredients": ["2 quarts lime sherbet", "2 (2 liter) bottles ginger ale", "1 (46 fluid ounce) can pineapple juice", "1 (4 ounce) jar maraschino cherries, drained", "1  lemon, sliced", "1  lime, sliced"], "direction": ["Scoop lime sherbet into a punch bowl; pour in ginger ale and pineapple juice. Stir well.", "Stir in maraschino cherries and float lemon and lime slices in the punch."], "facts": "246 calories; protein 1.3g 3% DV; carbohydrates 57.8g 19% DV; fat 1.9g 3% DV; cholesterol 5.2mg 2% DV; sodium 68.2mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100502/irish-soda-farls/", "name": "Irish Soda Farls", "summary": "\nSoda bread dough is flattened into a round circle, and divided into farls meaning 4 parts. It is then cooked on a dry griddle or pan. Traditionally this was the quickest way to make soda bread for unexpected guests who drop by for a bit of craic (good fun). It's best eaten fresh with butter and jam but is also delicious fried as part of an Ulster breakfast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9776.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 farls"]], "ingredients": ["2 cups all-purpose flour", "½ teaspoon salt", "1 teaspoon baking soda", "1 cup buttermilk"], "direction": ["Preheat heavy based flat griddle or skillet on medium to low heat.", "Place flour and salt in a bowl and sift in baking soda.  Make a well in the center, and pour in the buttermilk.", "Work quickly to mix into dough and knead very lightly on a well floured surface. Form into a flattened circle, about 1/2 inch thick and cut into quarters with a floured knife.", "Sprinkle a little flour over the base of the hot pan and cook the farls for 6 to 8 minutes on each side or until golden brown."], "facts": "252 calories; protein 8.5g 17% DV; carbohydrates 50.6g 16% DV; fat 1.2g 2% DV; cholesterol 2.5mg 1% DV; sodium 670.9mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213342/mashed-peas/", "name": "Mashed Peas", "summary": "\nA quick, easier, healthier, and sweeter alternative to mashed potatoes. I first ate these at an Irish restaurant in Singapore and fell in love! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3574633.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons olive oil", "1 (16 ounce) package frozen peas", "1 bunch fresh mint leaves", "1 bunch green onions, chopped", "2 tablespoons butter", "2 tablespoons brown sugar", "salt and pepper to taste"], "direction": ["Heat the olive oil in a skillet, and cook and stir the frozen peas, mint leaves, and green onions until the peas are hot and tender but still bright green, 7 to 10 minutes. Pour the peas into a bowl, and mash until the peas are thoroughly crushed but still slightly chunky. Stir in the butter, brown sugar, and salt and pepper, and mix until the sugar has dissolved. Serve warm or cold."], "facts": "164 calories; protein 4.9g 10% DV; carbohydrates 18g 6% DV; fat 8.8g 14% DV; cholesterol 10.2mg 3% DV; sodium 118.4mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/7095/irresistible-irish-soda-bread/", "name": "Irresistible Irish Soda Bread", "summary": "\nA very easy, very good tasting bread. Best if made the day before, or several hours before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1111853.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 - 9x5 inch loaf"]], "ingredients": ["3 cups all-purpose flour", "1 tablespoon baking powder", "⅓ cup white sugar", "1 teaspoon salt", "1 teaspoon baking soda", "1  egg, lightly beaten", "2 cups buttermilk", "¼ cup butter, melted"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5 inch loaf pan.", "Combine flour, baking powder, sugar, salt and baking soda. Blend egg and buttermilk together, and add all at once to the flour mixture. Mix just until moistened. Stir in butter. Pour into prepared pan.", "Bake for 65 to 70 minutes, or until a toothpick inserted in the bread comes out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor."], "facts": "192 calories; protein 5.1g 10% DV; carbohydrates 31.7g 10% DV; fat 4.9g 8% DV; cholesterol 27.3mg 9% DV; sodium 497.1mg 20% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216928/beef-mushroom-and-guinness-pie/", "name": "Beef, Mushroom and Guinness® Pie", "summary": "\nA delicious traditional beef and mushroom pie. The Irish stout gives the dish a very rich flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6291329.jpg", "meta": [["prep:", "25 mins"], ["cook:", "2 hrs 35 mins"], ["total:", "3 hrs"], ["Servings:", "6"], ["Yield:", "1 pot pie"]], "ingredients": ["3 tablespoons olive oil, divided", "1 pound cubed beef stew meat", "2 slices bacon, chopped", "1  white onion, chopped", "1  carrot, sliced", "⅓ pound crimini mushrooms, sliced", "1 clove garlic, crushed", "1 teaspoon white sugar", "1 ½ tablespoons all-purpose flour", "1 cup Irish stout beer (such as Guinness®)", "1 ¼ cups beef stock", "½ teaspoon ground thyme", "2  bay leaves", "½ teaspoon cornstarch, or as needed", "1 teaspoon water", "1 sheet frozen puff pastry, thawed", "1  egg, beaten"], "direction": ["Heat 2 tablespoons of olive oil in a large pot over medium heat, and brown the beef stew meat on all sides, about 10 minutes; set aside. Heat the remaining 1 tablespoon of olive oil, and cook the bacon just until it begins to brown; stir in the onion, carrot, mushrooms, garlic, and sugar. Cook the vegetables until soft and browned, 10 to 15 more minutes.", "Stir in the flour until smoothly incorporated, and gradually mix in the Irish stout beer and beef stock. Mix in the thyme, bay leaves, and the reserved cooked beef. Cover, and bring the mixture to a boil; reduce heat to a  simmer until the meat is tender, about 1 hour and 15 minutes; stir occasionally. Remove the cover, turn the heat up to medium, and let the stew boil until slightly thickened, about 15 more minutes. Mix cornstarch with water, and stir into the stew; let simmer for 30 more minutes to blend flavors. Remove from heat; discard bay leaves.", "Preheat oven to 350 degrees F (175 degrees C).", "Spread the filling into a 9-inch pie dish; trim the puff pastry into a 10-inch circle, and place on top of the filling. Pinch and crimp the edges of the pastry with a fork, sealing it to the dish; cut 2 steam vents into the pastry with a sharp knife. Brush the top of the pie with beaten egg.", "Bake in the preheated oven until the crust is browned, 30 to 40 minutes."], "facts": "500 calories; protein 21.8g 44% DV; carbohydrates 28.6g 9% DV; fat 31.7g 49% DV; cholesterol 77.2mg 26% DV; sodium 258.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220555/stout-slow-cooker-corned-beef-and-veggies/", "name": "Stout Slow Cooker Corned Beef and Veggies", "summary": "\nA slow cooker recipe for some traditional-style Irish corned beef and cabbage that smells as good as it tastes. Sweet potatoes are added for those whose diet prefers them. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2157595.jpg", "meta": [["prep:", "30 mins"], ["cook:", "6 hrs"], ["total:", "6 hrs 30 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 ½ (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®), divided", "1 (4 pound) corned beef brisket", "1 ½ cups brown sugar", "3  sweet potatoes, cut into chunks", "1 head cabbage, cored and coarsely chopped", "2 large sweet onions, chopped", "6 large carrots, chopped", "3  red potatoes, cut into chunks"], "direction": ["Pour 1 bottle Irish stout beer into a slow cooker.", "Rinse corned beef brisket and pat dry. Rub with brown sugar, including the bottom, and gently place brisket into the slow cooker with the stout beer.", "Arrange sweet potatoes, cabbage, onion, carrots, and red potatoes on and around the brisket in the slow cooker.", "Pour remaining 1/2 bottle Irish stout beer on and around brisket and vegetables to moisten the brown sugar. Cover the cooker and cook on Low until corned beef is tender, 6 to 8 hours. Allow brisket to stand 5 minutes before slicing."], "facts": "289 calories; protein 12.3g 25% DV; carbohydrates 39.1g 13% DV; fat 9.9g 15% DV; cholesterol 49.7mg 17% DV; sodium 638.6mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220617/beer-cheese-fondue/", "name": "Beer Cheese Fondue", "summary": "\nUnbelievable cheese fondue that will disappear in a minute! Serve with cubes of French bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7990829.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["8 ounces shredded sharp Cheddar cheese", "8 ounces shredded Swiss cheese", "2 tablespoons all-purpose flour", "½ teaspoon salt", "¼ teaspoon ground black pepper", "1 clove garlic, halved", "1 (12 fluid ounce) can or bottle beer", "1 dash hot pepper sauce (such as Tabasco®)"], "direction": ["Combine Cheddar cheese, Swiss cheese, flour, salt, and black pepper in a bowl.", "Rub cut side of garlic clove around bottom and sides of fondue pot.", "Pour beer into fondue pot and slowly bring to a simmer over medium-low heat, about 5 minutes.", "Gradually stir cheese mixture into beer, adding small amounts at a time, until cheese is melted and blended, 10 to 15 minutes.", "Stir hot pepper sauce into cheese mixture."], "facts": "332 calories; protein 20.2g 40% DV; carbohydrates 6.8g 2% DV; fat 23.1g 36% DV; cholesterol 74.5mg 25% DV; sodium 504.7mg 20% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/256753/irish-soda-bread-muffins/", "name": "Irish Soda Bread Muffins", "summary": "\nOne bowl, mix, bake for 20 minutes, and you have tasty muffins! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4462122.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "12"], ["Yield:", "12 muffins"]], "ingredients": ["3 cups all-purpose flour", "1 cup raisins", "½ cup white sugar", "2 tablespoons white sugar", "1 tablespoon caraway seeds", "1 tablespoon baking powder", "1 teaspoon salt", "¼ teaspoon baking soda", "1 ¾ cups buttermilk", "1  egg", "¼ cup butter, melted"], "direction": ["Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.", "Mix flour, raisins, 1/2 cup plus 2 tablespoons sugar, caraway seeds, baking powder, salt, and baking soda in a large bowl.", "Whisk buttermilk and egg together in a small bowl. Stir into flour mixture. Fold butter into the batter.", "Spoon batter into the prepared muffin tin.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes."], "facts": "252 calories; protein 5.5g 11% DV; carbohydrates 47.4g 15% DV; fat 5g 8% DV; cholesterol 27.1mg 9% DV; sodium 376.7mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/264005/kimchi-corned-beef/", "name": "Kimchi Corned Beef", "summary": "\nInstead of the same old corned beef and cabbage recipe every year, try this new and exciting Korean twist on the St. Patrick's Day staple. The spicy fermented cabbage adds a lot of extra savoriness, not only to the meat, but even more so to the vegetables. The potatoes especially soak up a surprising amount of flavor, and may be my favorite part of the whole dish. Garnish with sliced green onions. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5327376.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 45 mins"], ["total:", "3 hrs 5 mins"], ["Servings:", "10"], ["Yield:", "3 1/2 pounds corned beef"]], "ingredients": ["1 (3 1/2) pound ready-to-cook corned beef", "2 (16 ounce) jars kimchi, not drained", "½ cup cold water, or as needed", "2 pounds Yukon gold potatoes, quartered", "3 large carrots, cut into large chunks", "2 ribs celery, cut into large chunks"], "direction": ["Pour 1 jar of kimchi into a pot. Top with corned beef and cover with the second jar of kimchi. Pour in water. Cover and bring to a simmer over high heat. Reduce heat to low. Cook, covered, until fork-tender, 2 to 3 hours. Flip over the beef occasionally and drape kimchi back on top.", "Remove corned beef to a bowl. Bring kimchi mixture back to a simmer over high heat. Add potatoes, carrots, and celery. Cover, reduce heat to medium-low, and cook until almost tender, 20 to 25 minutes. Reduce heat to low and add beef back in. Cover and cook on low until meat is heated through, about 15 minutes. Taste the broth and add water as needed.", "Slice corned beef thinly and serve in a bowl with the vegetables; spoon some broth on top."], "facts": "500 calories; protein 32.5g 65% DV; carbohydrates 23.2g 8% DV; fat 30.5g 47% DV; cholesterol 155.7mg 52% DV; sodium 2427.5mg 97% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270205/instant-pot-irish-stew/", "name": "Instant Pot® Irish Stew", "summary": "\nThis hearty Irish lamb stew is perfect for a chilly day, and easy to make in an Instant Pot®! Serve as-is or with rice on the side. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6288558.jpg", "meta": [["prep:", "25 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 tablespoon butter", "1 tablespoon olive oil", "1 ¼ pounds lamb shoulder, cubed", "1  onion, diced", "2  shallots, diced", "2 cloves garlic, minced", "½ teaspoon white cooking wine", "2  carrots, or more to taste, sliced into rounds", "¾ pound small red potatoes, halved", "½ teaspoon dried rosemary", "½ teaspoon dried thyme", "1 ½ cups beef broth", "2 tablespoons cold water", "1 tablespoon potato starch", "salt and ground black pepper to taste"], "direction": ["Warm butter and oil in a multi-functional pressure cooker (such as Instant Pot®) set to Saute function. Add lamb and cook until browned on all sides, about 5 minutes. Transfer to a plate. Add onion and shallots to the pot; cook and stir until translucent, 4 to 5 minutes. Add garlic and cook for 1 minute longer.", "Pour wine into the pot and scrape up any browned bits off the bottom of the pot. Cook until wine is reduced by half, 3 to 5 minutes. Place carrots and potatoes on top of onions. Season with rosemary and thyme; stir to combine well. Arrange lamb over vegetables; pour beef broth on top.", "Close and lock the lid. Open vent for steaming. Select Meat/Stew function; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Meanwhile, mix water and potato starch until creamy.", "Unlock and remove lid. Switch to Saute function. Stir potato starch mixture into the stew; cook until thickened, 2 to 3 minutes. Season with salt and pepper."], "facts": "389 calories; protein 21.8g 44% DV; carbohydrates 26.2g 9% DV; fat 22g 34% DV; cholesterol 79.6mg 27% DV; sodium 440.2mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270882/st-patricks-day-jell-o-shots/", "name": "St. Patrick's Day Jell-O® Shots", "summary": "\nA fun and tasty way of keeping your Jell-O® shots Irish. Just add Jameson® Irish whiskey and Baileys® Strawberries & Cream liqueur to your layered shot glasses. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6410302.jpg", "meta": [["prep:", "10 mins"], ["additional:", "8 hrs"], ["total:", "8 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "8 shots"]], "ingredients": ["½ (3 ounce) package lime-flavored gelatin mix (such as Jell-O®)", "½ cup boiling water", "½ cup Irish whiskey (such as Jameson®)", "1 (1 ounce) package unflavored gelatin (such as Knox®)", "½ cup boiling water", "½ cup strawberry cream liqueur (such as Baileys®)"], "direction": ["Place shot glasses in a mini muffin tin at an angle.", "Pour lime gelatin mix into a bowl. Add 1/2 cup boiling water and stir until dissolved. Add Irish whiskey and stir until well incorporated. Pour mixture carefully into each shot glass, filling to near the top of the slanted glasses. Refrigerate until set, about 4 hours.", "Pour unflavored gelatin into a bowl. Add 1/2 cup boiling water and stir until dissolved. Let rest 3 to 5 minutes. Add strawberry cream liqueur and stir until well incorporated.", "Remove glasses from muffin tin and place upright. Top with strawberry mixture. Return glasses to the refrigerator and chill until set, about 4 hours more."], "facts": "126 calories; protein 0.8g 2% DV; carbohydrates 13.9g 5% DV; fat 0g; cholesterol 0mg; sodium 33.6mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220584/fried-irish-cabbage-with-bacon/", "name": "Fried Irish Cabbage with Bacon", "summary": "\nCabbage fried in bacon grease with bacon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3399552.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (12 ounce) package bacon", "¼ cup bacon drippings", "1 small head cabbage, cored and finely chopped", "ground black pepper to taste"], "direction": ["Cook bacon in a deep skillet over medium heat until crisp, 5 to 7 minutes. Remove bacon from skillet and drain on a paper towel-lined plate. Reserve 1/4 cup drippings in skillet.", "Cook and stir cabbage in hot bacon drippings over medium heat until cabbage wilts, 5 to 7 minutes.", "Crumble bacon over cabbage. Stir and simmer until bacon is warmed, 2 to 3 minutes. Season with black pepper."], "facts": "220 calories; protein 8.5g 17% DV; carbohydrates 7.3g 2% DV; fat 17.8g 27% DV; cholesterol 30mg 10% DV; sodium 467.6mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213340/beer-braised-irish-stew-and-colcannon/", "name": "Beer Braised Irish Stew and Colcannon", "summary": "\nThis is a recipe I shared with my girlfriends from my recipe club last year! It is a yummy alternative to corned beef for St. Pat's Day and a wonderful anytime dish! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807159.jpg", "meta": [["prep:", "1 hr"], ["cook:", "2 hrs"], ["total:", "3 hrs"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1 (3 pound) beef chuck roast, trimmed of fat and cut into 1/2-inch cubes", "2 tablespoons all-purpose flour", "1 cup coarsely chopped onion", "1 cup coarsely chopped carrot", "1 (12 fluid ounce) can or bottle dark beer", "2  bay leaves", "1 teaspoon dried thyme", "1 teaspoon salt", "½ teaspoon ground black pepper", "2 cloves garlic, minced", "2 tablespoons Worcestershire sauce"], "direction": ["Preheat oven to 325 degrees F (165 degrees C).", "Heat the vegetable oil in a large Dutch oven over medium-high heat until very hot, and brown the meat in 2 batches, stirring to brown the cubes on all sides. Return all the meat to the Dutch oven, sprinkle with flour, and stir lightly to coat the meat with flour. Stir in onion, carrots, dark beer, bay leaves, thyme, 1 teaspoon salt, 1/2 teaspoon pepper, garlic, and Worcestershire sauce. Bring the mixture to a boil, and cover.", "Place the Dutch oven into the preheated oven, and cook for 45 minutes; uncover, stir the stew, and cook until the beef is very tender and the liquid is reduced by half, about 45 more minutes.", "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble the bacon and set aside.", "About 30 minutes before the stew is ready, make the colcannon: Place the potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.", "Place the cabbage into a microwave-safe bowl, and add 1 or 2 tablespoons of water. Cover and microwave on High for about 2 1/2 minutes; uncover (watch out for steam) and stir the cabbage. Cover and microwave for about 2 1/2 more minutes, until the cabbage is slightly tender but not mushy. Drain excess liquid, and set the cabbage aside, covered.", "Place the potatoes into a large bowl, and add milk, butter, 1/2 teaspoon of salt, and 1/4 teaspoon of pepper. Beat the potatoes with an electric mixer until smooth and creamy. Stir in the cabbage, crumbled bacon, and parsley until well combined.", "To serve, place a scoop of colcannon onto a plate, make a hollow, and fill with braised beef stew."], "facts": "453 calories; protein 25.3g 51% DV; carbohydrates 30.2g 10% DV; fat 24.4g 38% DV; cholesterol 89.4mg 30% DV; sodium 650.9mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270364/irish-cocktail-cupcakes/", "name": "Irish Cocktail Cupcakes", "summary": "\nIf you've ever had a shot of Irish whiskey and Irish cream dropped in a glass of Guinness®, this it in dessert form. The best cupcake ever. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6382465.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["additional:", "20 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "18"], ["Yield:", "18 cupcakes"]], "ingredients": ["1 cup Irish stout beer (such as Guinness®)", "9 tablespoons unsalted butter, cut into 1-inch pieces", "2 cups dark brown sugar", "¾ cup unsweetened cocoa powder", "¾ cup sour cream", "2  eggs", "1 tablespoon vanilla extract", "2 cups all-purpose flour", "2 ½ teaspoons baking soda"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.", "Combine stout beer and butter in a large saucepan over low heat. Heat until butter melts, about 5 minutes. Remove from heat and whisk in brown sugar and cocoa.", "Whisk sour cream, eggs, and vanilla extract in a bowl; pour into the saucepan and mix until a smooth batter forms.", "Stir flour and baking soda together. Fold into the batter. Divide batter evenly among the prepared muffin cups.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Leave in the tin for 10 minutes, then transfer to a wire rack to cool completely.", "Make frosting while the cupcakes cool. Place butter in a large mixing bowl and beat with an electric mixer on medium-high speed for 2 to 3 minutes. Mix in Irish cream and whiskey on low speed. Gradually spoon in confectioners' sugar, mixing on low speed until frosting is smooth and creamy.", "Spread frosting over cupcakes."], "facts": "370 calories; protein 3.4g 7% DV; carbohydrates 58.3g 19% DV; fat 14.1g 22% DV; cholesterol 53.7mg 18% DV; sodium 197.6mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/138020/st-patricks-colcannon/", "name": "St. Patrick's Colcannon", "summary": "\nThis is an 'Irish' way to deal with the leftover corned beef after the American corned beef and cabbage feast. My husband considers this a wonderful part of the corned beef cycle. I use red potatoes with skins on, substitute ham for the corned beef, and leeks for the green onions, depends on what's in the fridge. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F196199.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["3 pounds red potatoes, quartered", "1 head cabbage, cored and shredded", "2 tablespoons butter", "½ cup butter", "1 teaspoon minced garlic", "4  green onions, sliced, white parts and tops separated", "white pepper to taste", "1 ¼ cups hot milk", "1 pound leftover corned beef, cut into pieces and warmed"], "direction": ["Place potatoes in a large saucepan and add water to cover by 1-inch. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes.", "Meanwhile, bring a large pot of salted water to a boil. Stir in cabbage along with 2 tablespoons of butter; cover, and simmer until the cabbage has softened. Drain.", "Melt 1/2-cup butter over medium heat. Stir in garlic and the white parts of the green onions. Cook until the garlic has softened and mellowed.", "Drain the potatoes and mash with white pepper to taste. Fold in melted butter, milk, cabbage, and corned beef. Sprinkle with green onion tops to serve."], "facts": "524 calories; protein 20g 40% DV; carbohydrates 38.2g 12% DV; fat 33.5g 52% DV; cholesterol 94.6mg 32% DV; sodium 190.5mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/", "name": "Slow-Cooker Corned Beef and Cabbage", "summary": "\nNo more dry corned beef!  Cook this in your slow cooker all day and you're guaranteed success!  Serve this with soda bread for a warm and satisfying meal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2152835.jpg", "meta": [["prep:", "15 mins"], ["cook:", "9 hrs"], ["total:", "9 hrs 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["4 large carrots, peeled and cut into matchstick pieces", "10  baby red potatoes, quartered", "1  onion, peeled and cut into bite-sized pieces", "4 cups water", "1 (4 pound) corned beef brisket with spice packet", "6 ounces beer", "½ head cabbage, coarsely chopped"], "direction": ["Place the carrots, potatoes, and onion into the bottom of a slow cooker, pour in the water, and place the brisket on top of the vegetables. Pour the beer over the brisket. Sprinkle on the spices from the packet, cover, and set the cooker on High.", "Cook the brisket for about 8 hours. An hour before serving, stir in the cabbage and cook for 1 more hour."], "facts": "473 calories; protein 23.6g 47% DV; carbohydrates 49.5g 16% DV; fat 19.6g 30% DV; cholesterol 99.5mg 33% DV; sodium 1280.6mg 51% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/", "name": "Corned Beef and Cabbage I", "summary": "\nWhat's more Irish than a traditional recipe for corned beef and cabbage?  Serve with mustard or horseradish if desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F372809.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 35 mins"], ["Servings:", "5"], ["Yield:", "5 servings"]], "ingredients": ["3 pounds corned beef brisket with spice packet", "10 small red potatoes", "5  carrots, peeled and cut into 3-inch pieces", "1 large head cabbage, cut into small wedges"], "direction": ["Place corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef.  Cover pot and bring to a boil, then reduce to a simmer.  Simmer approximately 50 minutes per pound or until tender.", "Add whole potatoes and carrots, and cook until the vegetables are almost tender.  Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.", "Place vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain."], "facts": "839 calories; protein 49.6g 99% DV; carbohydrates 68.9g 23% DV; fat 41.3g 64% DV; cholesterol 147mg 49% DV; sodium 3377.5mg 141% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16947/amazingly-easy-irish-soda-bread/", "name": "Amazingly Easy Irish Soda Bread", "summary": "\nA good old fashioned soda bread with just the basic ingredients. Buttermilk gives this crusty loaf a good flavor. The best Irish soda bread around! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F995189.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "20"], ["Yield:", "1 1 1/2 pound loaf"]], "ingredients": ["4 cups all-purpose flour", "4 tablespoons white sugar", "1 teaspoon baking soda", "1 tablespoon baking powder", "½ teaspoon salt", "½ cup margarine, softened", "1 cup buttermilk", "1  egg", "¼ cup butter, melted", "¼ cup buttermilk"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Lightly grease a large baking sheet.", "In a large bowl, mix together flour, sugar, baking soda,  baking powder, salt and margarine. Stir in 1 cup of buttermilk and egg. Turn dough out onto a lightly floured surface and knead slightly. Form dough into a round and place on prepared baking sheet. In a small bowl, combine melted butter with 1/4 cup buttermilk; brush loaf with this mixture. Use a sharp knife to cut an 'X' into the top of the loaf.", "Bake in preheated oven until a toothpick inserted into the center of the loaf comes out clean,  45 to 50 minutes. Check for doneness after 30 minutes. You may continue to brush the loaf with the butter mixture while it bakes."], "facts": "172 calories; protein 3.5g 7% DV; carbohydrates 22.5g 7% DV; fat 7.5g 12% DV; cholesterol 16mg 5% DV; sodium 269.1mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/234534/beef-and-guinness-stew/", "name": "Beef and Guinness® Stew", "summary": "\nThe maltiness of dark beer really does amazing things for this gravy. It's a very simple dish, but at the same time it has a deep, complex, rich flavor. I served this in a nice ring of green onion-mashed potatoes. I hope you give this a try, whether for St. Patrick's Day or anytime of the year. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1111973.jpg", "meta": [["prep:", "30 mins"], ["cook:", "2 hrs 30 mins"], ["total:", "3 hrs"], ["Servings:", "6"], ["Yield:", "6 large servings"]], "ingredients": ["4 slices bacon, cut into small pieces", "2 ½ pounds boneless beef chuck, cut into 2-inch pieces", "1 teaspoon salt, or more to taste", "freshly ground black pepper to taste", "2  onions, coarsely chopped", "½ teaspoon salt", "4 cloves garlic, minced", "1 (14.9 ounce) can dark beer (such as Guinness®)", "¼ cup tomato paste", "4 sprigs fresh thyme", "3  carrots, cut into 1-inch pieces", "2 stalks celery, cut into 1-inch pieces", "1 teaspoon white sugar", "½ teaspoon freshly ground black pepper, or to taste", "2 ½ cups chicken stock, or as needed to cover", "4 cups mashed potatoes  (Optional)"], "direction": ["Cook and stir bacon in a heavy skillet over medium-high heat until bacon is browned and crisp, 3 to 4 minutes. Turn off heat and transfer bacon into a large stew pot, reserving bacon fat in the skillet.", "Season beef chuck cubes generously with 1 teaspoon salt and black pepper to taste. Turn heat to high under skillet and sear beef pieces in the hot fat on both sides until browned, about 5 minutes. Place beef in stew pot with bacon, leaving fat in skillet. Turn heat down to medium; cook and stir onions in the retained fat in the skillet until lightly browned, 5 to 8 minutes; season with a large pinch of salt.", "Cook garlic with onions until soft, about 1 minute; pour beer into skillet and stir with a wooden spoon, scraping up and dissolving any browned bits of food into the liquid. Pour cooking liquid from skillet into the stew pot. Stir in tomato paste, thyme sprigs, carrots, celery, sugar, 1/2 teaspoon black pepper, and enough chicken broth to cover.", "Bring stew to a gentle simmer, stirring to combine; reduce heat to low and cover pot. Simmer stew until beef is fork-tender, about 2 hours. Stir stew occasionally and skim fat or foam if desired.", "Remove cover and raise heat to medium-high. Bring stew to a low boil and cook until stew has slightly thickened, 15 to 20 minutes. Remove and discard thyme sprigs and adjust salt and pepper to taste.", "Arrange mashed potatoes in a ring in a serving bowl; ladle stew into the center of the potatoes."], "facts": "528 calories; protein 29.4g 59% DV; carbohydrates 42.1g 14% DV; fat 24.6g 38% DV; cholesterol 95.7mg 32% DV; sodium 1605.1mg 64% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/24483/green-grog/", "name": "Green Grog", "summary": "\nWe like to call it the green drink. It's sweet, it's sour, it's tasty and it packs a real punch so go slow. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F726628.jpg", "meta": [["prep:", "7 mins"], ["total:", "7 mins"], ["Servings:", "25"], ["Yield:", "25 (8 ounce) servings"]], "ingredients": ["2 (12 fluid ounce) cans frozen limeade concentrate", "2 (12 fluid ounce) cans frozen lemonade concentrate", "2 (2 liter) bottles lemon-lime flavored carbonated beverage", "1 (750 milliliter) bottle rum", "2 quarts lime sherbet"], "direction": ["In a large pot, combine limeade, lemonade and lemon-lime soda. Stir in rum (add more to taste if desired.) Mix in the lime sherbet."], "facts": "368 calories; protein 0.8g 2% DV; carbohydrates 74.5g 25% DV; fat 1.3g 2% DV; cholesterol 3.7mg 1% DV; sodium 48.7mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/163145/creamed-cabbage/", "name": "Creamed Cabbage", "summary": "\nThis is yummy for St. Paddy's Day! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2284428.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["4 slices bacon", "¼ cup butter", "1 tablespoon all-purpose flour", "1 teaspoon salt", "1 large head cabbage, cored and shredded", "½ cup sour cream"], "direction": ["Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to cool.", "Whisk the butter, flour, and salt into the drippings in the same pan. Stir in the cabbage, and cook, stirring occasionally, over medium heat until cabbage is tender, about 15 minutes. Crumble the bacon; stir the bacon pieces and sour cream into the cabbage mixture."], "facts": "251 calories; protein 5.6g 11% DV; carbohydrates 14g 5% DV; fat 20.3g 31% DV; cholesterol 41.5mg 14% DV; sodium 645.2mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100506/irish-potato-farls/", "name": "Irish Potato Farls", "summary": "\nThe word farl originates from the Gaelic word fardel meaning four parts. These potato griddle breads can be made with leftover mashed potatoes too.  Serve hot with a little butter and salt, or fry them alongside soda bread as part of an Ulster Fry-up. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5228161.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "4"], ["Yield:", "4 farls"]], "ingredients": ["4 medium potatoes, peeled and halved", "1 pinch salt", "¼ cup all-purpose flour, plus extra for dusting", "1 tablespoon melted butter"], "direction": ["In a  pot, cover potatoes with water and bring to a boil over high heat. Simmer on medium-high heat until the center of the potatoes are tender when pricked with a fork, about 20 minutes. Turn off heat. Drain, return potatoes to pot and allow to completely dry out over remaining heat. Mash with a potato masher until smooth.", "Place warm mashed potato in medium bowl. Stir in flour, salt and melted butter. Mix lightly until dough forms.", "On a well floured surface, knead the dough lightly. The dough will be sticky. Use a floured rolling pin to flatten into a 9 inch circle about 1/4 inch thick. Cut into quarters using a floured knife.", "Sprinkle a little flour into the base of the skillet and cook the farls for 3 minutes on each side or until evenly browned. Season with a little salt and serve straight away."], "facts": "218 calories; protein 5.1g 10% DV; carbohydrates 43.2g 14% DV; fat 3.1g 5% DV; cholesterol 7.6mg 3% DV; sodium 33.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213830/brennans-irish-soda-bread/", "name": "Brennan's Irish Soda Bread", "summary": "\nWarm and soft Irish tradition passed down our family line, and directly into our bellies. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808386.jpg", "meta": [["prep:", "10 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "1 round loaf"]], "ingredients": ["1 cup milk", "2 tablespoons distilled white vinegar", "2 cups all-purpose flour", "1 tablespoon white sugar", "½ teaspoon baking soda", "½ teaspoon salt"], "direction": ["Stir the milk and vinegar together, and allow to stand until curdled, about 10 minutes.", "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet. In a bowl, mix together the flour, sugar, baking soda, and salt.", "Gradually stir the soured milk into the flour mixture until the dough just comes together, and turn the dough out onto a well-floured surface. Knead a few times, and shape into a round. Place the dough onto the prepared baking sheet. With a sharp knife, cut an X shape into the top of the dough to release steam and help the bread keep its round shape.", "Bake in the preheated oven until golden brown, about 45 minutes."], "facts": "135 calories; protein 4.2g 9% DV; carbohydrates 26.8g 9% DV; fat 0.9g 1% DV; cholesterol 2.4mg 1% DV; sodium 237.1mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/30918/irish-boiled-dinner-corned-beef/", "name": "Irish Boiled Dinner (Corned Beef)", "summary": "\nMouth watering tender corned beef with corned beef flavored potatoes, cabbage, and carrots. This is my great grandmothers recipe from Ireland. This was served with both Irish soda bread and corn bread at our house. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2432850.jpg", "meta": [["prep:", "1 hr"], ["cook:", "5 hrs"], ["total:", "6 hrs"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (5 1/2 pound) corned beef brisket", "2 large onions", "15 small white (Irish) potatoes", "10  carrots, cut into 1 inch pieces", "2 heads cabbage, cored and cut into wedges"], "direction": ["Rinse the beef brisket under cold water, and place in a large pot. Add enough water to cover the roast by 6 inches.  Peel the onions, and place them in the pot with the roast. Bring to a boil, and cook for about 30 minutes at a rolling boil. Reduce heat to medium-low so that the water is at a gentle boil, cover, and cook for 3 1/2 hours.", "Remove the lid from the brisket. Remove onions, and cut into wedges. Return them to the pot. Add carrots to the pot, then place the cabbage over the roast. Place the potatoes on top of the cabbage. Place the lid back on the pot, and cook for another 30 minutes, until potatoes are tender. The potatoes should be immersed in the water by now, but if not, keep the lid on so they can steam.", "Remove the vegetables from the pot, and place in a separate serving bowl. Keep the corned beef in the pot until ready to slice and serve because it dries out quickly."], "facts": "918 calories; protein 47g 94% DV; carbohydrates 106.6g 34% DV; fat 35.7g 55% DV; cholesterol 178.6mg 60% DV; sodium 2247.6mg 90% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/74819/baby-guinness/", "name": "Baby Guinness", "summary": "\nA delicious shooter that looks like a mini-pint of Guinness. Also learned this one in London. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F803793.jpg", "meta": [["prep:", "1 min"], ["total:", "1 min"], ["Servings:", "1"], ["Yield:", "1 shot"]], "ingredients": ["2 fluid ounces coffee flavored liqueur", "½ fluid ounce Irish cream liqueur"], "direction": ["Fill a shot glass almost to the top with coffee liqueur. Top off with Irish cream. It should float perfectly on top making the ''head'' of your shot."], "facts": "269 calories; protein 0.1g; carbohydrates 29.3g 10% DV; fat 0.3g; cholesterol 0mg; sodium 6.6mg."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/236988/chef-johns-irish-pork-stew/", "name": "Chef John's Irish Pork Stew", "summary": "\nI'm sure you've heard by now that corned beef and cabbage is not authentic St. Patrick's Day food. I decided to do a little mash-up and this Irish pork stew with baby cabbage was the result. By the way, baby cabbage can be a little hard to find, but you can use Brussels sprouts, and no one will know the difference, mostly because there isn't one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2158157.jpg", "meta": [["prep:", "25 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (2 1/2 pound) boneless pork shoulder, cut into 2-inch cubes", "salt and ground black pepper to taste", "1 tablespoon vegetable oil", "1 tablespoon butter", "1 large onion, chopped", "2 cloves garlic, minced", "1 tablespoon all-purpose flour", "1  bay leaf", "¾ teaspoon caraway seed", "1 (12 fluid ounce) bottle dark beer (such as Guinness®)", "2 cups chicken broth", "3  carrots, cut into 1-inch pieces", "2 stalks celery, cut into 1-inch pieces", "¼ cup chopped fresh flat-leaf parsley", "3 tablespoons balsamic vinegar", "12  Brussels sprouts, halved", "3 cups mashed potatoes, or as needed", "1 teaspoon chopped fresh flat-leaf parsley, or to taste"], "direction": ["Season pork cubes with salt and black pepper.", "Heat vegetable oil in a pot over high heat. Working in batches, cook and stir pork in hot oil until browned on all sides, 5 to 10 minutes. Transfer pork to a bowl and reduce heat to medium.", "Melt butter in the pot. Cook and stir onion with a pinch of salt in hot butter until onion is softened and translucent, 7 to 10 minutes. Add garlic; saute until fragrant, about 30 seconds.", "Stir flour into onion mixture; cook and stir until flour is completely incorporated, about 2 minutes. Add bay leaf and caraway seed; cook for 2 minutes more. Pour beer into onion mixture. Cook and stir until thickened, 1 to 3 minutes.", "Stir pork, chicken broth, carrots, and celery into beer mixture; bring to simmer. Stir 1/4 cup parsley and balsamic vinegar into stew, reduce heat to medium-low, and simmer until pork is fork-tender, about 2 hours.", "Bring a large pot of lightly salted water to a boil. Add the Brussels sprouts and cook uncovered until almost tender, about 5 minutes. Drain.", "Stir Brussels sprouts into stew and simmer until heated through, about 5 minutes. Season with salt and pepper to taste. Divide mashed potatoes between 6 bowls. Ladle stew over potatoes and top each with a pinch of parsley."], "facts": "401 calories; protein 20.3g 41% DV; carbohydrates 32.9g 11% DV; fat 19.4g 30% DV; cholesterol 68.3mg 23% DV; sodium 768.5mg 31% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/231030/braised-corned-beef-brisket/", "name": "Braised Corned Beef Brisket", "summary": "\nYou have never had corned beef like this and if you try it, I truly believe you will never go back to the traditionally 'boiled' beef. This recipe was given to my mother-in-law during WWII by her Jewish boarding house owner and it has become a treasured family recipe. Unlike the commonly boiled corned beef, this is a slow braise that is tender, flavorful, and has a caramelized surface when it's done. I serve it with colcannon, steamed cabbage wedges, braised carrots, and parsnips. It is our favorite St. Patrick's/Jewish dinner, but we love it so much that I cook it year around. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F995620.jpg", "meta": [["prep:", "15 mins"], ["cook:", "6 hrs 15 mins"], ["total:", "6 hrs 30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (5 pound) flat-cut corned beef brisket", "1 tablespoon browning sauce (such as Kitchen Bouquet®), or as desired", "1 tablespoon vegetable oil", "1  onion, sliced", "6 cloves garlic, sliced", "2 tablespoons water"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Discard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.", "Place brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.", "Roast in the preheated oven until meat is tender, about 6 hours."], "facts": "455 calories; protein 30.6g 61% DV; carbohydrates 5.4g 2% DV; fat 33.7g 52% DV; cholesterol 162mg 54% DV; sodium 1877.4mg 75% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216071/true-bangers-and-mash-with-onion-gravy/", "name": "True Bangers and Mash with Onion Gravy", "summary": "\nBangers and mash gets its name because sausages used to burst (or bang) while cooking, due to rusk (dried bread) being added to the meat. Mash, meanwhile, refers to the mashed potatoes.  This recipe was a staple at our home in Dublin at Halloween.  It is a very cheap, very traditional supper, and one that truly requires good sausage. Try to use a good quality sausage or perhaps even a bratwurst. Please note that this is a very thin gravy, as is traditional. It will still be very liquidy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F815033.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 links pork sausage", "2 pounds potatoes, peeled and cubed", "¼ cup butter", "2 tablespoons milk", "1 teaspoon dry mustard powder", "salt and ground black pepper to taste", "1 tablespoon butter", "2 large onions, chopped", "6 cups beef broth", "2 cups red wine"], "direction": ["Preheat oven to 200 degrees F (95 degrees C).", "Cook the sausage links in a skillet over medium-low heat until browned on all sides, about 5 minutes per side; transfer to an oven-safe dish and move to the preheated oven to keep warm.", "Place potatoes into a saucepan over medium heat, cover with water, and boil gently until potatoes are tender, 10 to 15 minutes. Drain and allow to steam dry for a minute or two. Mix in 1/4 cup of butter, milk, dry mustard, salt, and black pepper; mash until fluffy and smooth. Set aside.", "Melt 1 tablespoon butter in a skillet over medium-high heat; cook the onions until translucent and just starting to brown, about 8 minutes. Pour in the beef broth and red wine; boil the mixture down to about half its volume, about 10 minutes. Season with salt and black pepper. To serve, place a sausage onto a serving plate with about 1/2 cup of mashed potatoes. Pour the onion gravy over the sausage and potatoes."], "facts": "516 calories; protein 14.1g 28% DV; carbohydrates 50.4g 16% DV; fat 19.8g 30% DV; cholesterol 57.6mg 19% DV; sodium 1414mg 57% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220519/irish-shepherds-pie/", "name": "Irish Shepherd's Pie", "summary": "\nThis makes a lovely alternative to the much more common corned beef and cabbage that you may have been planning for St. Patrick's Day dinner. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4413707.jpg", "meta": [["prep:", "25 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "8"], ["Yield:", "1 9x13-inch casserole"]], "ingredients": ["1 tablespoon olive oil", "1 tablespoon butter", "1  onion, diced", "2 pounds lean ground lamb", "⅓ cup all-purpose flour", "salt and ground black pepper to taste", "2 teaspoons minced fresh rosemary", "1 teaspoon paprika", "⅛ teaspoon ground cinnamon", "1 tablespoon ketchup", "3 cloves garlic, minced", "2 ½ cups water, or as needed", "1 (12 ounce) package frozen peas and carrots, thawed", "2 ½ pounds Yukon Gold potatoes, peeled and halved", "1 tablespoon butter", "1 pinch ground cayenne pepper", "¼ cup cream cheese", "¼ pound Irish cheese (such as Dubliner®), shredded", "salt and ground black pepper to taste", "1  egg yolk", "2 tablespoons milk"], "direction": ["Preheat the oven to 375 degrees F (190 degrees C).", "Place olive oil and butter in Dutch oven over medium heat. Stir in onion and ground lamb; brown the meat, breaking it up into small crumbles as it cooks, about 10 minutes.", "Stir in flour until incorporated, then mix in salt, black pepper, rosemary, paprika, cinnamon, ketchup, and garlic; cook and stir until garlic is fragrant, 2 to 3 minutes.", "Stir in water and scrape up any brown bits from the bottom of the Dutch oven. Reduce heat to medium-low and bring mixture to a simmer; cook and stir until thick, about 5-6 minutes.", "Remove lamb mixture from heat and stir in peas and carrots until combined.", "Spread lamb mixture into the bottom of a 9x13-inch baking dish and set aside.", "Place potatoes into a large pan of salted water. Bring to a boil, reduce heat to medium, and cook until tender, about 15 minutes. Drain well and return potatoes to pan.", "Mash butter, cayenne pepper, cream cheese, and Irish cheese into the potatoes. Mash until combined and potatoes are smooth. Season to taste with salt and black pepper.", "Whisk together egg yolk and milk in a small bowl; stir into the mashed potato mixture.", "Top the lamb mixture in the baking dish with the mashed potatoes and spread evenly to cover.", "Bake in the preheated oven until the top is golden brown and sauce is bubbling up around the edges, 25 to 30 minutes."], "facts": "517 calories; protein 29.2g 58% DV; carbohydrates 37.2g 12% DV; fat 28.3g 44% DV; cholesterol 132.3mg 44% DV; sodium 301mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216981/deluxe-corned-beef-hash/", "name": "Deluxe Corned Beef Hash", "summary": "\nI purposely cook a whole corned beef just to make hash.  There's nothing like the taste of fresh versus canned hash.  This is also good for leftover St. Paddy's Day corned beef.  I throw the carrot in for color, claiming it's the Leprechaun's gold. Serve with fried eggs and brown soda bread (farls). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808820.jpg", "meta": [["prep:", "30 mins"], ["cook:", "40 mins"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "1 large onion, chopped", "5 large Yukon Gold potatoes, peeled and cut into 1/4-inch cubes", "1 large carrot, coarsely shredded", "2 pounds cooked corned beef, cubed", "2 tablespoons chopped fresh parsley", "¼ teaspoon dried thyme leaves", "1 pinch salt to taste", "½ teaspoon ground black pepper, or to taste"], "direction": ["Melt butter with the olive oil in a large skillet over medium heat, and cook the onion just until it begins to brown, about 8 minutes; stir in the potatoes and carrot, and cook until tender, about 15 minutes, stirring occasionally. Stir in the cubed corned beef, parsley, thyme, salt, and pepper. Let the mixture cook until hash is crisp and browned, stirring often, 10 to 15 more minutes."], "facts": "320 calories; protein 24.7g 49% DV; carbohydrates 24.6g 8% DV; fat 14.1g 22% DV; cholesterol 81.5mg 27% DV; sodium 1559.4mg 62% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/176054/pudding-shots/", "name": "Pudding Shots", "summary": "\nIf you're looking for a little something special for an adult event and are tired of the traditional gelatin shots, this one's for you!  It's quick and easy and tastes GREAT! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807175.jpg", "meta": [["prep:", "15 mins"], ["additional:", "30 mins"], ["total:", "45 mins"], ["Servings:", "15"], ["Yield:", "15 shots"]], "ingredients": ["1 cup milk", "½ cup Irish cream liqueur (eg. Bailey's®)", "½ cup vodka (eg. Smirnoff®)", "1 (4 serving size) package instant chocolate pudding mix"], "direction": ["Whisk together the milk, Irish cream liqueur, vodka, and instant pudding mix in a bowl until combined. Continue whisking for 2 minutes.", "Spoon the pudding mixture into shot glasses or disposable 'party shot' cups. Chill until set, about 30 minutes. The shots will have the consistency of mousse."], "facts": "84 calories; protein 0.7g 1% DV; carbohydrates 11g 4% DV; fat 0.5g 1% DV; cholesterol 1.3mg; sodium 112.1mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/23534/original-irish-cream/", "name": "Original Irish Cream", "summary": "\nIrish whiskey mixed with cream and sugar with hints of coffee, chocolate, vanilla, and almond. Will keep for 2 months if refrigerated. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F290354.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "16"], ["Yield:", "4 cups"]], "ingredients": ["1 cup heavy cream", "1 (14 ounce) can sweetened condensed milk", "1 ⅔ cups Irish whiskey", "1 teaspoon instant coffee granules", "2 tablespoons chocolate syrup", "1 teaspoon vanilla extract", "1 teaspoon almond extract"], "direction": ["In a blender, combine heavy cream, sweetened condensed milk, Irish whiskey, instant coffee, chocolate syrup, vanilla extract, and almond extract. Blend on high for 20 to 30 seconds. Store in a tightly sealed container in the refrigerator. Shake well before serving."], "facts": "197 calories; protein 2.3g 5% DV; carbohydrates 15.4g 5% DV; fat 7.7g 12% DV; cholesterol 28.7mg 10% DV; sodium 38.5mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16035/irish-lamb-stew/", "name": "Irish Lamb Stew", "summary": "\nHearty and traditional Irish lamb stew. It's best to refrigerate the stew overnight, and reheat it the next day for eating. This soup 'ages' well! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2432842.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 45 mins"], ["Servings:", "10"], ["Yield:", "10 servings"]], "ingredients": ["1 ½ pounds thickly sliced bacon, diced", "6 pounds boneless lamb shoulder, cut into 2 inch pieces", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ cup all-purpose flour", "3 cloves garlic, minced", "1 large onion, chopped", "½ cup water", "4 cups beef stock", "2 teaspoons white sugar", "4 cups diced carrots", "2 large onions, cut into bite-size pieces", "3  potatoes", "1 teaspoon dried thyme", "2  bay leaves", "1 cup white wine"], "direction": ["Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble, and set aside.", "Put lamb, salt, pepper, and flour in large mixing bowl. Toss to coat meat evenly. Brown meat in frying pan with bacon fat.", "Place meat into stock pot (leave 1/4 cup of fat in frying pan). Add the garlic and yellow onion and saute till onion begins to become golden. Deglaze frying pan with 1/2 cup water and add the garlic-onion mixture to the stock pot with bacon pieces, beef stock, and sugar. Cover and simmer for 1 1/2 hours.", "Add carrots, onions, potatoes, thyme, bay leaves, and wine to pot. Reduce heat, and simmer covered for 20 minutes until vegetables are tender."], "facts": "672 calories; protein 46.4g 93% DV; carbohydrates 26.3g 9% DV; fat 39.3g 61% DV; cholesterol 162.7mg 54% DV; sodium 1189.4mg 48% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/241419/potato-scones/", "name": "Potato Scones", "summary": "\nComing from an Irish and Scottish background, these scones are the perfect side with any breakfast meal as well as a family favorite! Enjoy. Add onion, pepper, or any other spices for flavor. Serve with butter. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2082789.jpg", "meta": [["prep:", "20 mins"], ["cook:", "10 mins"], ["total:", "30 mins"], ["Servings:", "6"], ["Yield:", "6 scones"]], "ingredients": ["1 pound cooked potatoes", "4 ounces self-rising flour", "2 ounces butter", "½ pinch salt"], "direction": ["Heat a lightly greased griddle or cast iron skillet over medium-high heat.", "Mash potatoes with flour, butter, and salt until a stiff dough forms.", "Turn dough out onto a lightly floured work surface. Knead dough lightly and roll dough out to about 1/2-inch thick. Cut into six triangular wedges.", "Working in batches, cook scones, turning once on hot griddle until golden brown, 4 to 5 minutes per side."], "facts": "198 calories; protein 3.2g 6% DV; carbohydrates 29g 9% DV; fat 7.8g 12% DV; cholesterol 20.1mg 7% DV; sodium 307.5mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/236603/chef-johns-irish-stew/", "name": "Chef John's Irish Stew", "summary": "\nPay attention to the cut of lamb used in this recipe. I used lamb shoulder chops, which are a fantastic value, when you consider flavor, useable meat, and price. They will probably be the cheapest lamb at the store, have more flavor and richness than leg meat, and are cheaper than shanks and loins. It takes a while for the meat to braise and fall off the bone, but it's a wait rewarded with tender, succulent chucks of lamb. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3792561.jpg", "meta": [["prep:", "20 mins"], ["cook:", "2 hrs 25 mins"], ["total:", "2 hrs 45 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 pounds lamb shoulder chops", "salt and ground black pepper to taste", "1 tablespoon vegetable oil", "1  onion, chopped", "1 tablespoon butter", "2 tablespoons all-purpose flour", "3 cups chicken stock", "½ teaspoon dried rosemary", "2  carrots, chopped", "2 stalks celery, chopped", "water as needed", "1 ½ pounds baby Dutch yellow potatoes", "¼ cup chopped green onions"], "direction": ["Season lamb shoulder chops with salt and black pepper.", "Heat oil in a large heavy skillet over high heat. Working in batches, cook lamb shoulder chops until browned on both sides, 3 to 5 minutes per side. Transfer chops to a stock pot.", "Cook and stir onion with a pinch of salt in the same skillet over medium heat until slightly softened and edges are browning, about 5 minutes. Stir butter into onion until melted; add flour and stir until onions are coated, about 1 minute.", "Pour stock into onion mixture; bring to a boil, add rosemary, and stir until mixture thickens, 5 to 10 minutes.", "Stir carrots and celery into pot with lamb shoulder chops and pour chicken stock mixture over the top. Add water as needed to cover meat completely. Bring mixture to a simmer, reduce heat to low, cover the pot with a lid, and cook until meat is almost falling off the bone, about 1 1/2 hours.", "Transfer meat to a plate. Stir potatoes into stew and return meat to stew, placing on top of vegetables. Simmer, covered, until potatoes are tender and meat is falling off the bone, about 30 minutes.", "Transfer meat to a plate using a slotted spoon. Bring stew to a boil and cook, skimming off fat, until stew is reduced and thick, 10 to 12 minutes.", "Remove meat from bones; discard bones and any pieces of fat. Stir meat back into stew. Stir green onions into stew and season with salt and pepper to taste."], "facts": "508 calories; protein 32.1g 64% DV; carbohydrates 28.6g 9% DV; fat 29.1g 45% DV; cholesterol 120.5mg 40% DV; sodium 465.8mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/270606/instant-pot-shepherds-pie/", "name": "Instant Pot® Shepherd's Pie", "summary": "\nThis family friendly shepherd's pie uses ground beef (instead of the traditional lamb), and your Instant Pot® or multi-cooker pressure cooker to prepare the filling and potatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6355170.jpg", "meta": [["prep:", "10 mins"], ["cook:", "35 mins"], ["additional:", "15 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon vegetable oil", "1 pound ground beef", "1 cup onion, diced", "3 cloves garlic, minced", "½ teaspoon salt", "¼ teaspoon ground black pepper", "1 tablespoon tomato paste", "1 tablespoon Worcestershire sauce", "½ teaspoon thyme", "1 cup beef broth", "2 cups frozen peas and carrots", "3 medium potatoes, peeled", "½ cup half-and-half", "2 tablespoons butter", "¼ teaspoon garlic salt"], "direction": ["Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat oil and add ground beef, onion, garlic, salt, and pepper. Cook until ground beef has browned and onions are soft and translucent, about 5 minutes. Stir in tomato paste, Worcestershire sauce, and thyme. Pour in beef broth and add frozen peas and carrots. Stir until everything is well blended and turn off Saute function.", "Place your Instant Pot's® metal collapsible trivet in the pot so that it rests a little bit above the meat mixture. Place the peeled potatoes on top of the trivet. Close and lock the lid. Select high pressure according to manufacturer's instructions. Set timer for 15 minutes if potatoes are on the smaller side or 20 minutes if they are medium or large. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Open the lid and transfer potatoes to a bowl. Turn off Instant Pot® and carefully remove the metal trivet (it will be hot).", "Add half-and-half, butter, and garlic salt to bowl with the potatoes. Mash until well blended.", "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler.", "Assemble the pie by pouring the meat mixture from the Instant Pot® into an 8-inch square baking pan. Spoon the mashed potatoes over the meat mixture and spread out evenly.", "Broil the shepherd's pie in the preheated oven until the top starts to golden and brown, about 3 minutes."], "facts": "347 calories; protein 18.2g 37% DV; carbohydrates 29.4g 10% DV; fat 18g 28% DV; cholesterol 64.9mg 22% DV; sodium 576.4mg 23% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11116/cream-cheese-sugar-cookies/", "name": "Cream Cheese Sugar Cookies", "summary": "\nA soft, chewy, and flavorful sugar cookie. It is very important to chill the dough, as it is too sticky to roll unless well chilled. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1122074.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "9 hrs"], ["total:", "9 hrs 25 mins"], ["Servings:", "72"], ["Yield:", "6 dozen"]], "ingredients": ["1 cup white sugar", "1 cup butter, softened", "1 (3 ounce) package cream cheese, softened", "½ teaspoon salt", "½ teaspoon almond extract", "½ teaspoon vanilla extract", "1  egg yolk", "2 ¼ cups all-purpose flour"], "direction": ["In a large bowl, combine the sugar, butter, cream cheese, salt, almond and vanilla extracts, and egg yolk. Beat until smooth. Stir in flour until well blended. Chill the dough for 8 hours, or overnight.", "Preheat oven to 375 degrees F (190 degrees C).", "On a lightly floured surface, roll out the dough 1/3 at a time to 1/8 inch thickness, refrigerating remaining dough until ready to use. Cut into desired shapes with lightly floured cookie cutters. Place 1 inch apart on ungreased cookie sheets. Leave cookies plain for frosting, or brush with slightly beaten egg white and sprinkle with candy sprinkles or colored sugar.", "Bake for 7 to 10 minutes in the preheated oven, or until light and golden brown. Cool cookies completely before frosting."], "facts": "53 calories; protein 0.6g 1% DV; carbohydrates 5.8g 2% DV; fat 3.1g 5% DV; cholesterol 10.9mg 4% DV; sodium 38mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220546/onion-jam/", "name": "Onion Jam", "summary": "\nA family favorite. Expect a few wrinkled noses maybe at the title, but result is worth the effort. Maybe not for beginning cooks since there's a couple potentially tricky steps. Serve a cup of jam over a bar of cream cheese with crackers, or as a spread for meat sandwiches. Keep in refrigerator in covered container for up to two weeks. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807144.jpg", "meta": [["prep:", "25 mins"], ["cook:", "55 mins"], ["total:", "1 hr 20 mins"], ["Servings:", "32"], ["Yield:", "32 servings"]], "ingredients": ["¼ cup vegetable oil", "½ cup white sugar", "4 cups onion, coarsely chopped", "¼ teaspoon salt", "ground black pepper to taste", "½ cup red wine vinegar"], "direction": ["Heat vegetable oil in a heavy skillet over medium heat.", "Stir sugar into vegetable oil with a wooden spoon, stirring constantly until mixture is a light caramel-color, about 10 minutes. Mixture will be very hot.", "Stir onion, salt, and black pepper into sugar mixture. Onions will immediately start to caramelize. Stir frequently over medium heat until sugar has dissolved and onions are browned, about 15 minutes.", "Pour red wine vinegar into onion mixture and simmer until mixture has a jam consistency, about 30 minutes. Let cool to serve."], "facts": "37 calories; protein 0.2g 1% DV; carbohydrates 5.4g 2% DV; fat 1.7g 3% DV; cholesterol 0mg; sodium 19mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10118/rainbow-cookies/", "name": "Rainbow Cookies", "summary": "\nMoist, mellow, and full of almond flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4803073.jpg", "meta": [["prep:", "45 mins"], ["cook:", "10 mins"], ["additional:", "9 hrs 35 mins"], ["total:", "10 hrs 30 mins"], ["Servings:", "96"], ["Yield:", "8 dozen"]], "ingredients": ["8 ounces almond paste", "1 cup butter, softened", "1 cup white sugar", "4  eggs, separated", "2 cups all-purpose flour", "6 drops red food coloring", "6 drops green food coloring", "¼ cup seedless red raspberry jam", "¼ cup apricot jam", "1 cup semisweet chocolate chips, melted"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Line three 9x13 inch baking pans with parchment paper.", "In a large bowl, break apart almond paste with a fork, and cream together with butter, sugar, and egg yolks. When mixture is fluffy and smooth, stir in flour to form a dough. In a small bowl, beat egg whites until soft peaks form. Fold egg whites into the dough. Divide dough into 3 equal portions. Mix one portion with red food coloring, and one with green food coloring. Spread each portion into one of the prepared baking pans.", "Bake 10 to 12 minutes in the preheated oven, until lightly browned. Carefully remove from pan and parchment paper, and cool completely on wire racks.", "Place green layer onto a piece of plastic wrap large enough to wrap all three layers. Spread green layer with raspberry jam, and top with uncolored layer. Spread with apricot jam, and top with pink layer. Transfer layers to a baking sheet, and enclose with plastic wrap. Place a heavy pan or cutting board on top of wrapped layers to compress. Chill in the refrigerator 8 hours, or overnight.", "Remove plastic wrap. Top with melted chocolate chips, and refrigerate 1 hour, or until chocolate is firm. Slice into small squares to serve."], "facts": "61 calories; protein 0.8g 2% DV; carbohydrates 7.4g 2% DV; fat 3.3g 5% DV; cholesterol 12.8mg 4% DV; sodium 17.3mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11843/irish-chicken-and-dumplings/", "name": "Irish Chicken and Dumplings", "summary": "\nThis is our family's very favorite comfort food. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7154569.jpg", "meta": [["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 (10.75 ounce) cans  condensed cream of chicken soup", "3 cups water", "1 cup chopped celery", "2  onions, quartered", "1 teaspoon salt", "½ teaspoon poultry seasoning", "½ teaspoon ground black pepper", "4  skinless, boneless chicken breast halves", "5  carrots, sliced", "1 (10 ounce) package frozen green peas", "4  potatoes, quartered", "3 cups baking mix", "1 ⅓ cups milk"], "direction": ["In large, heavy pot, combine soup, water, chicken, celery, onion, salt, poultry seasoning, and pepper. Cover and cook over low heat about 1 1/2 hours.", "Add potatoes and carrots; cover and cook another 30 minutes.", "Remove chicken from pot, shred it, and return to pot. Add peas and cook only 5 minutes longer.", "Add dumplings. To make dumplings: Mix baking mix and milk until a soft dough forms. Drop by tablespoonfuls onto BOILING stew. Simmer covered for 10 minutes, then uncover and simmer an additional 10 minutes."], "facts": "595 calories; protein 33.9g 68% DV; carbohydrates 94.4g 31% DV; fat 9.2g 14% DV; cholesterol 58.1mg 19% DV; sodium 2401.8mg 96% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100811/fabulous-fried-cabbage/", "name": "Fabulous Fried Cabbage", "summary": "\nA favorite old Irish family recipe for fried cabbage and it's so easy. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F567274.jpg", "meta": [["prep:", "5 mins"], ["cook:", "45 mins"], ["total:", "50 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 teaspoons butter", "1 (15 ounce) can chicken broth", "1 head cabbage, cored and coarsely chopped", "1 pinch salt and pepper to taste"], "direction": ["Bring the butter and chicken broth to a boil in a large skillet. Reduce heat to low and add the cabbage. Cover and cook over low heat to steam the cabbage for about 45 minutes, stirring frequently, or until cabbage is tender and sweet. Season with salt and pepper and serve."], "facts": "66 calories; protein 2.9g 6% DV; carbohydrates 11.8g 4% DV; fat 1.7g 3% DV; cholesterol 5.4mg 2% DV; sodium 384.4mg 15% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100295/irish-champ/", "name": "Irish Champ", "summary": "\nLooks similar to colcannon, but champ is native to the North of Ireland. It's made by blending scallions or green onions with creamy mashed potatoes. Great on its own, served steaming hot with extra butter which will melt through it. But it's also the perfect side dish for good quality sausages. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F799254.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["total:", "40 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 pounds potatoes, peeled and halved", "1 cup milk", "1 bunch green onions, thinly sliced", "½ teaspoon salt, or to taste", "¼ cup butter", "1 pinch freshly ground black pepper to taste"], "direction": ["Place potatoes into large pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 20 minutes.", "Drain well. Return to very low heat and allow the potatoes to dry out for a few minutes. (It helps if you place a clean dish towel over the potatoes to absorb any remaining moisture.)", "Meanwhile, heat the milk and green onions gently in a saucepan, until warm.", "Mash the potatoes, salt and butter together until smooth.  Stir in the milk and green onion until evenly mixed. Season with freshly ground black pepper. Serve piping hot in bowls. Set out some extra butter for individuals to add to their servings."], "facts": "326 calories; protein 7.8g 16% DV; carbohydrates 46.8g 15% DV; fat 13g 20% DV; cholesterol 35.4mg 12% DV; sodium 420.1mg 17% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220562/lime-sherbet-punch/", "name": "Lime Sherbet Punch", "summary": "\nA holiday favorite that everyone looks for year after year. You'll learn to buy the lime sherbet in advance since the stores sell out around the holidays. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F808249.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "18"], ["Yield:", "18 servings"]], "ingredients": ["2 quarts lime sherbet", "2 (2 liter) bottles ginger ale", "1 (46 fluid ounce) can pineapple juice", "1 (4 ounce) jar maraschino cherries, drained", "1  lemon, sliced", "1  lime, sliced"], "direction": ["Scoop lime sherbet into a punch bowl; pour in ginger ale and pineapple juice. Stir well.", "Stir in maraschino cherries and float lemon and lime slices in the punch."], "facts": "246 calories; protein 1.3g 3% DV; carbohydrates 57.8g 19% DV; fat 1.9g 3% DV; cholesterol 5.2mg 2% DV; sodium 68.2mg 3% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/100502/irish-soda-farls/", "name": "Irish Soda Farls", "summary": "\nSoda bread dough is flattened into a round circle, and divided into farls meaning 4 parts. It is then cooked on a dry griddle or pan. Traditionally this was the quickest way to make soda bread for unexpected guests who drop by for a bit of craic (good fun). It's best eaten fresh with butter and jam but is also delicious fried as part of an Ulster breakfast. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9776.jpg", "meta": [["prep:", "5 mins"], ["cook:", "15 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 farls"]], "ingredients": ["2 cups all-purpose flour", "½ teaspoon salt", "1 teaspoon baking soda", "1 cup buttermilk"], "direction": ["Preheat heavy based flat griddle or skillet on medium to low heat.", "Place flour and salt in a bowl and sift in baking soda.  Make a well in the center, and pour in the buttermilk.", "Work quickly to mix into dough and knead very lightly on a well floured surface. Form into a flattened circle, about 1/2 inch thick and cut into quarters with a floured knife.", "Sprinkle a little flour over the base of the hot pan and cook the farls for 6 to 8 minutes on each side or until golden brown."], "facts": "252 calories; protein 8.5g 17% DV; carbohydrates 50.6g 16% DV; fat 1.2g 2% DV; cholesterol 2.5mg 1% DV; sodium 670.9mg 27% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213342/mashed-peas/", "name": "Mashed Peas", "summary": "\nA quick, easier, healthier, and sweeter alternative to mashed potatoes. I first ate these at an Irish restaurant in Singapore and fell in love! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3574633.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons olive oil", "1 (16 ounce) package frozen peas", "1 bunch fresh mint leaves", "1 bunch green onions, chopped", "2 tablespoons butter", "2 tablespoons brown sugar", "salt and pepper to taste"], "direction": ["Heat the olive oil in a skillet, and cook and stir the frozen peas, mint leaves, and green onions until the peas are hot and tender but still bright green, 7 to 10 minutes. Pour the peas into a bowl, and mash until the peas are thoroughly crushed but still slightly chunky. Stir in the butter, brown sugar, and salt and pepper, and mix until the sugar has dissolved. Serve warm or cold."], "facts": "164 calories; protein 4.9g 10% DV; carbohydrates 18g 6% DV; fat 8.8g 14% DV; cholesterol 10.2mg 3% DV; sodium 118.4mg 5% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/7095/irresistible-irish-soda-bread/", "name": "Irresistible Irish Soda Bread", "summary": "\nA very easy, very good tasting bread. Best if made the day before, or several hours before serving. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1111853.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "12"], ["Yield:", "1 - 9x5 inch loaf"]], "ingredients": ["3 cups all-purpose flour", "1 tablespoon baking powder", "⅓ cup white sugar", "1 teaspoon salt", "1 teaspoon baking soda", "1  egg, lightly beaten", "2 cups buttermilk", "¼ cup butter, melted"], "direction": ["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5 inch loaf pan.", "Combine flour, baking powder, sugar, salt and baking soda. Blend egg and buttermilk together, and add all at once to the flour mixture. Mix just until moistened. Stir in butter. Pour into prepared pan.", "Bake for 65 to 70 minutes, or until a toothpick inserted in the bread comes out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor."], "facts": "192 calories; protein 5.1g 10% DV; carbohydrates 31.7g 10% DV; fat 4.9g 8% DV; cholesterol 27.3mg 9% DV; sodium 497.1mg 20% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216928/beef-mushroom-and-guinness-pie/", "name": "Beef, Mushroom and Guinness® Pie", "summary": "\nA delicious traditional beef and mushroom pie. The Irish stout gives the dish a very rich flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6291329.jpg", "meta": [["prep:", "25 mins"], ["cook:", "2 hrs 35 mins"], ["total:", "3 hrs"], ["Servings:", "6"], ["Yield:", "1 pot pie"]], "ingredients": ["3 tablespoons olive oil, divided", "1 pound cubed beef stew meat", "2 slices bacon, chopped", "1  white onion, chopped", "1  carrot, sliced", "⅓ pound crimini mushrooms, sliced", "1 clove garlic, crushed", "1 teaspoon white sugar", "1 ½ tablespoons all-purpose flour", "1 cup Irish stout beer (such as Guinness®)", "1 ¼ cups beef stock", "½ teaspoon ground thyme", "2  bay leaves", "½ teaspoon cornstarch, or as needed", "1 teaspoon water", "1 sheet frozen puff pastry, thawed", "1  egg, beaten"], "direction": ["Heat 2 tablespoons of olive oil in a large pot over medium heat, and brown the beef stew meat on all sides, about 10 minutes; set aside. Heat the remaining 1 tablespoon of olive oil, and cook the bacon just until it begins to brown; stir in the onion, carrot, mushrooms, garlic, and sugar. Cook the vegetables until soft and browned, 10 to 15 more minutes.", "Stir in the flour until smoothly incorporated, and gradually mix in the Irish stout beer and beef stock. Mix in the thyme, bay leaves, and the reserved cooked beef. Cover, and bring the mixture to a boil; reduce heat to a  simmer until the meat is tender, about 1 hour and 15 minutes; stir occasionally. Remove the cover, turn the heat up to medium, and let the stew boil until slightly thickened, about 15 more minutes. Mix cornstarch with water, and stir into the stew; let simmer for 30 more minutes to blend flavors. Remove from heat; discard bay leaves.", "Preheat oven to 350 degrees F (175 degrees C).", "Spread the filling into a 9-inch pie dish; trim the puff pastry into a 10-inch circle, and place on top of the filling. Pinch and crimp the edges of the pastry with a fork, sealing it to the dish; cut 2 steam vents into the pastry with a sharp knife. Brush the top of the pie with beaten egg.", "Bake in the preheated oven until the crust is browned, 30 to 40 minutes."], "facts": "500 calories; protein 21.8g 44% DV; carbohydrates 28.6g 9% DV; fat 31.7g 49% DV; cholesterol 77.2mg 26% DV; sodium 258.8mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220555/stout-slow-cooker-corned-beef-and-veggies/", "name": "Stout Slow Cooker Corned Beef and Veggies", "summary": "\nA slow cooker recipe for some traditional-style Irish corned beef and cabbage that smells as good as it tastes. Sweet potatoes are added for those whose diet prefers them. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2157595.jpg", "meta": [["prep:", "30 mins"], ["cook:", "6 hrs"], ["total:", "6 hrs 30 mins"], ["Servings:", "16"], ["Yield:", "16 servings"]], "ingredients": ["1 ½ (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®), divided", "1 (4 pound) corned beef brisket", "1 ½ cups brown sugar", "3  sweet potatoes, cut into chunks", "1 head cabbage, cored and coarsely chopped", "2 large sweet onions, chopped", "6 large carrots, chopped", "3  red potatoes, cut into chunks"], "direction": ["Pour 1 bottle Irish stout beer into a slow cooker.", "Rinse corned beef brisket and pat dry. Rub with brown sugar, including the bottom, and gently place brisket into the slow cooker with the stout beer.", "Arrange sweet potatoes, cabbage, onion, carrots, and red potatoes on and around the brisket in the slow cooker.", "Pour remaining 1/2 bottle Irish stout beer on and around brisket and vegetables to moisten the brown sugar. Cover the cooker and cook on Low until corned beef is tender, 6 to 8 hours. Allow brisket to stand 5 minutes before slicing."], "facts": "289 calories; protein 12.3g 25% DV; carbohydrates 39.1g 13% DV; fat 9.9g 15% DV; cholesterol 49.7mg 17% DV; sodium 638.6mg 26% DV."}, {"type": "By Holidays and Events  ", "package": "st_patrick_s_day_recipes", "link": "https://www.allrecipes.com/recipe/220617/beer-cheese-fondue/", "name": "Beer Cheese Fondue", "summary": "\nUnbelievable cheese fondue that will disappear in a minute! Serve with cubes of French bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7990829.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["8 ounces shredded sharp Cheddar cheese", "8 ounces shredded Swiss cheese", "2 tablespoons all-purpose flour", "½ teaspoon salt", "¼ teaspoon ground black pepper", "1 clove garlic, halved", "1 (12 fluid ounce) can or bottle beer", "1 dash hot pepper sauce (such as Tabasco®)"], "direction": ["Combine Cheddar cheese, Swiss cheese, flour, salt, and black pepper in a bowl.", "Rub cut side of garlic clove around bottom and sides of fondue pot.", "Pour beer into fondue pot and slowly bring to a simmer over medium-low heat, about 5 minutes.", "Gradually stir cheese mixture into beer, adding small amounts at a time, until cheese is melted and blended, 10 to 15 minutes.", "Stir hot pepper sauce into cheese mixture."], "facts": "332 calories; protein 20.2g 40% DV; carbohydrates 6.8g 2% DV; fat 23.1g 36% DV; cholesterol 74.5mg 25% DV; sodium 504.7mg 20% DV."}]