[{"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/187409/valentine-night-strawberries/", "name": "Valentine Night Strawberries", "summary": "\nStrawberries stuffed with lightly-sweetened cream cheese and walnuts are perfect for that romantic evening. They go great with champagne! Pecans also work well in this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F180904.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "18"], ["Yield:", "18 strawberries"]], "ingredients": ["20  fresh strawberries", "1 (3 ounce) package cream cheese, softened", "2 tablespoons chopped walnuts", "1 ½ tablespoons confectioners' sugar"], "direction": ["Dice two strawberries and set aside. Cut the stems off of each of the remaining strawberries, forming a base for strawberries to stand on. Starting at the pointed ends and cutting most of the way, but not completely through the stem end, slice each strawberry into four wedges.", "Beat the cream cheese until fluffy; stir in the diced strawberries, walnuts, and powdered sugar. Spoon or pipe about a teaspoon of mix into each strawberry."], "facts": "31 calories; protein 0.6g 1% DV; carbohydrates 2.4g 1% DV; fat 2.2g 4% DV; cholesterol 5.2mg 2% DV; sodium 14.2mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/25808/chocolate-truffle-cookies/", "name": "Chocolate Truffle Cookies", "summary": "\nA very dark, rich chocolate cookie for the true chocoholic. This recipe uses relatively little flour, resulting in dense, fudge-like cookies. These cookies keep well in the freezer (but you may have a hard time waiting for them to thaw before you eat them). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F442366.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 35 mins"], ["total:", "2 hrs"], ["Servings:", "36"], ["Yield:", "3 dozen"]], "ingredients": ["4 (1 ounce) squares unsweetened chocolate, chopped", "1 cup semisweet chocolate chips", "6 tablespoons butter", "3  eggs", "1 cup white sugar", "1 ½ teaspoons vanilla extract", "½ cup all-purpose flour", "2 tablespoons unsweetened cocoa powder", "¼ teaspoon baking powder", "¼ teaspoon salt", "1 cup semisweet chocolate chips"], "direction": ["In the microwave or in a metal bowl over a pan of simmering water, melt unsweetened chocolate, 1 cup of the chocolate chips, and the butter stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, whip eggs and sugar until thick and pale, about 2 minutes. Stir in the vanilla and the chocolate mixture until well mixed. Combine the flour, cocoa, baking powder and salt; gradually stir into the chocolate mixture. Fold in remaining 1 cup chocolate chips. Cover dough and chill for at least an hour or overnight.", "Preheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls. Place on ungreased cookie sheets so they are 2 inches apart.", "Bake for 9 to 11 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely."], "facts": "112 calories; protein 1.6g 3% DV; carbohydrates 13.9g 5% DV; fat 6.8g 11% DV; cholesterol 20.6mg 7% DV; sodium 40mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11808/creamy-pesto-shrimp/", "name": "Creamy Pesto Shrimp", "summary": "\nOne of our family's favorites, it's also great when made with crab meat instead of the shrimp. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F352934.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound linguine pasta", "½ cup butter", "2 cups heavy cream", "½ teaspoon ground black pepper", "1 cup grated Parmesan cheese", "⅓ cup pesto", "1 pound large shrimp, peeled and deveined"], "direction": ["Bring a large pot of lightly salted water to a boil. Add linguine pasta, and cook for 8 to 10 minutes, or until al dente; drain.", "In a large skillet, melt the butter over medium heat. Stir in cream, and season with pepper. Cook 6 to 8 minutes, stirring constantly.", "Stir Parmesan cheese into cream sauce, stirring until thoroughly mixed. Blend in the pesto, and cook for 3 to 5 minutes, until thickened.", "Stir in the shrimp, and cook until they turn pink, about 5 minutes. Serve over the hot linguine."], "facts": "646 calories; protein 23.1g 46% DV; carbohydrates 43g 14% DV; fat 42.5g 66% DV; cholesterol 210.4mg 70% DV; sodium 437.2mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/21712/chocolate-covered-strawberries/", "name": "Chocolate Covered Strawberries", "summary": "\nThis is the simplest version of chocolate covered strawberries I know. Paraffin was originally used instead of shortening. Turn the strawberries upside down and insert by the toothpicks into a piece of styrofoam for easy cooling, or simply place them on a sheet of wax paper. White chocolate may be drizzled over the milk chocolate for a fancier look. They are perfect for weddings when decorated with frosting bow ties, bells, butterflies, roses, etc. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F845742.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "24"], ["Yield:", "3 cups"]], "ingredients": ["16 ounces milk chocolate chips", "2 tablespoons shortening", "1 pound fresh strawberries with leaves"], "direction": ["In a double boiler, melt the chocolate and shortening, stirring occasionally until smooth. Holding them by the toothpicks, dip the strawberries into the chocolate mixture.", "Insert toothpicks into the tops of the strawberries.", "Turn the strawberries upside down and insert the toothpick into styrofoam for the chocolate to cool."], "facts": "115 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 7.3g 11% DV; cholesterol 6.2mg 2% DV; sodium 31.3mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/229453/valentines-salmon/", "name": "Valentine's Salmon", "summary": "\nThis really produces a fantastic piece of salmon, and when paired with a simple potato and leek chowder, would make a terrific Valentine's dinner idea. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1102164.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  green onions", "1 slice bacon, sliced", "1 clove garlic", "1  leek, white and tender green parts only, halved lengthwise and sliced", "salt to taste", "½ teaspoon butter", "1 ½ cups diced Yukon Gold potatoes", "3 cups water, or more as needed", "1 pinch cayenne pepper", "2 (12 ounce) center-cut salmon fillets", "1 teaspoon tarragon Dijon mustard", "salt and freshly ground black pepper to taste", "1 tablespoon vegetable oil", "2 tablespoons Asian chili paste (sambal), or more to taste  (Optional)", "1  green onion, chopped"], "direction": ["Bring a large pot of lightly salted water to a boil. Add 8 green onions and cook uncovered until slightly softened, about 30 seconds. Immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the onions are cold, drain well, and set aside.", "Cook bacon in a large skillet over medium-low heat until browned, about 8 minutes. Stir in garlic, leek, salt, and butter; cook and stir until leek is softened, about 10 minutes. Add potatoes and enough water to cover, about 3 cups. Season with salt and cayenne pepper. Bring to a simmer, reduce heat to low and cook until potatoes are tender, about 15 minutes. Set aside.", "Preheat oven to 375 degrees F (190 degrees C). Line a baking dish with parchment paper lightly coated with vegetable oil.", "Prepare each salmon filet salmon by cutting the belly, the bottom 1/3 of the fillet, off the skin. Cut remaining 2/3 of fillet away from skin. Cut this piece in half. Cut belly in half horizontally. Spread each piece with tarragon mustard and top with a slice salmon belly. Season with salt and black pepper. Wrap each salmon packet with two green onions, crisscrossing like ribbons, tucking the ends on the underside.", "Place salmon packets, belly-side up, on the parchment and drizzle each with vegetable oil.", "Bake in the preheated oven until the salmon is slightly firm to the touch and no longer translucent inside, about 15 minutes.", "Heat potato leek soup and stir in chopped green onion. Season with salt and black pepper. Serve soup in shallow bowls, topped with 1 salmon packet and garnished with chili paste."], "facts": "444 calories; protein 39.3g 79% DV; carbohydrates 20.9g 7% DV; fat 21.8g 34% DV; cholesterol 121.6mg 41% DV; sodium 264.6mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/42704/prosciutto-wrapped-asparagus/", "name": "Prosciutto Wrapped Asparagus", "summary": "\nMy husband taught me this elegant yet easy side dish! Always a hit at the holidays, and dresses up every day chicken. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1378444.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ pound prosciutto, sliced", "½ (8 ounce) package Neufchatel cheese, softened", "12 spears fresh asparagus, trimmed"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).", "Spread prosciutto slices with Neufchatel cheese. Wrap slices around 2 or 3 asparagus spears. Arrange wrapped spears in a single layer on a medium baking sheet.", "Bake 15 minutes in the preheated oven, until asparagus is tender."], "facts": "292 calories; protein 14.8g 30% DV; carbohydrates 2.7g 1% DV; fat 24.6g 38% DV; cholesterol 71.2mg 24% DV; sodium 1210.1mg 48% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10470/valentine-heart-necklaces/", "name": "Valentine Heart Necklaces", "summary": "\nThese are a great substitute for children to take to school in lieu of Valentine's Day cards!  Use a drinking straw to cut the holes in the pastry. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F180905.jpg", "meta": [["prep:", "35 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 42 mins"], ["Servings:", "15"], ["Yield:", "30 cookies"]], "ingredients": ["1 cup butter, softened", "¾ cup white sugar", "1  egg", "1 teaspoon vanilla extract", "1 tablespoon lemon zest", "2 ½ cups sifted all-purpose flour", "1 teaspoon baking powder", "3 cups confectioners' sugar", "⅓ cup butter, softened", "1 ½ teaspoons vanilla extract", "2 tablespoons milk", "3 drops red food coloring", "2 ¼ ounces colored candy sprinkles", "60  long red vine licorice"], "direction": ["Cream 1 cup butter or margarine and 3/4 cup white sugar together.  Blend in egg, 1 teaspoon vanilla extract, and grated lemon peel.  Sift together 2 1/2 cups all-purpose flour and baking powder.  Add to creamed mixture and blend well. Cover and refrigerate dough for approximately 2 hours.", "Preheat oven to 375 degrees F (190 degrees C).", "Roll dough to 1/4 inch thickness on a lightly floured surface.  Use a floured heart shaped 1 to 2 inch cookie cutter and cut dough into heart shapes.  Place the cut-out hearts on greased cookie sheets.", "Using the drinking straw, make a hole at the top center of each heart before baking.  Bake for 5 to 7 minutes until very lightly browned.  Cool the cookies on a wire rack.", "To Make Butter Frosting:  Mix 3 cups confectioners' sugar and 1/3 cup butter together.  Stir in 1 1/2 teaspoons vanilla extract and 2 tablespoons  milk.  Beat until smooth making sure frosting is of spreading consistency.  Stir in food coloring to create a pink or red colored frosting, if desired.", "After cookies have cooled, frost and decorate them with nonpareils, sprinkles, dragees, or colored sugar.  Use a toothpick to dislodge the hole, if necessary.  Let the frosting dry.", "To make a necklace, tie the ends off of two pieces of red colored licorice with a knot.  Thread it through the hole at the top center of the cookie.  Tie the other ends off with another knot to create a \"chain.\"  Makes approximately 30 heart necklaces."], "facts": "521 calories; protein 3.9g 8% DV; carbohydrates 87.2g 28% DV; fat 17.8g 27% DV; cholesterol 56mg 19% DV; sodium 175.6mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/67432/smothered-filet-mignon/", "name": "Smothered Filet Mignon", "summary": "\nA great combination of flavors. Serve with some mashed garlic red potatoes and sweetened green beans for a fabulous special occasion meal. Don't forget to serve a bottle of Cabernet or Zinfandel. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1335503.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) filet mignon steaks", "seasoned salt to taste", "cracked black pepper to taste", "¼ cup extra virgin olive oil", "¼ cup balsamic vinegar", "1 tablespoon Dijon mustard", "2 teaspoons dried rosemary", "1 tablespoon butter", "2 cups onion slices", "1 teaspoon white sugar", "4 ounces blue cheese, crumbled"], "direction": ["Season steaks with seasoned salt and black pepper, and arrange in a single layer in a large baking dish. In a bowl, whisk together olive oil, balsamic vinegar, mustard, and rosemary. Pour mixture over filets, and turn to coat. Marinate for up to 30 minutes.", "While you are marinating the meat, melt the butter in a skillet over medium heat. Cook onion slices in butter until soft, then stir in sugar. Continue cooking until onions are caramelized. Set aside.", "Preheat grill for high heat on one side, and medium heat on the other side.", "Lightly oil the grill grate. Place steaks on the hot side of the grill, and cook for 10 minutes, turning once. When the steaks are almost done, move to the cooler side of the grill. Top each filet with a quarter of the caramelized onions and blue cheese. Close the lid, and continue cooking until the cheese is melted."], "facts": "590 calories; protein 35.3g 71% DV; carbohydrates 13.4g 4% DV; fat 43.4g 67% DV; cholesterol 124.5mg 42% DV; sodium 689.4mg 28% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213469/sweetheart-cupcakes/", "name": "Sweetheart Cupcakes", "summary": "\nInstead of just plain white cupcakes, I took it a step further and made them special. You can change the colors for any holiday. Shades of green for St. Patrick's Day, pastel colors for Easter, red white and blue for the 4th of July. You get the picture. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F585472.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "1 hr"], ["total:", "1 hr 40 mins"], ["Servings:", "24"], ["Yield:", "2 dozen cupcakes"]], "ingredients": ["1 (18.25 ounce) package white cake mix", "1 ¼ cups water", "⅓ cup vegetable oil", "3  egg whites", "8 drops red food coloring", "2 drops raspberry candy oil"], "direction": ["Preheat an oven to 350 degrees F (175 degrees C). Line a standard muffin tin with paper cupcake liners.", "Beat the cake mix, water, vegetable oil, and egg whites together on low speed for 30 seconds, then on medium for 2 minutes, until smooth. Fill cupcake liners 1/3 full with white batter; set aside.", "Stir 4 drops of red food coloring into the remaining bowl of batter to make the batter pink. Stir in the raspberry oil. Pour 1/3 of pink batter into a resealable plastic bag and set aside.", "Mix more food coloring into the remaining bowl of pink batter until it is an orange/red color and pour the batter into a resealable plastic bag. Cut a corner off the bag, stick the open tip into the center of each cup of white batter and squeeze in about two tablespoons of red batter.", "Cut the corner off the bag with the pink batter, stick the open tip into the center of the red batter and squeeze about 1 tablespoon pink batter into each cup.", "Bake the layered cupcakes in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool completely before frosting."], "facts": "120 calories; protein 1.4g 3% DV; carbohydrates 16.6g 5% DV; fat 5.3g 8% DV; cholesterol 0mg; sodium 148.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10413/easy-valentine-sandwich-cookies/", "name": "Easy Valentine Sandwich Cookies", "summary": "\nThis recipe makes 17- 3 inch sandwich cookies and 17 - 1 1/2 inch heart shaped cookies.  You'll need a 3-inch heart shaped cutter and a 1 1/2-inch heart shaped cutter.  Frost with Pink Valentine Frosting (see recipe). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1101763.jpg", "meta": [["Servings:", "17"], ["Yield:", "34 cookies"]], "ingredients": ["1 cup butter", "1 ½ cups confectioners' sugar", "1  egg", "1 teaspoon vanilla extract", "½ teaspoon almond extract  (Optional)", "2 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon cream of tartar"], "direction": ["In a large bowl, cream together butter and confectioners' sugar.  Beat in egg, vanilla and almond extract.  Mix well.", "In a medium bowl, stir together flour, baking soda and cream of tartar;  blend into the butter mixture.  Divide dough into thirds and shape into balls.", "Working with 1/3 of dough at a time, roll out dough into desired thickness on a lightly floured surface.  For each heart sandwich cookie, cut out 2 3-inch hearts.  Cut out the center of ONE of the 3-inch hearts with the 1 1/2-inch cutter.", "Place each piece separately on an ungreased cookie sheet, 1 - 2 inches apart.  Bake in a preheated, 350 degrees F (175 degrees C) oven until lightly browned (7-8 minutes for 1/4 inch thick cookies).  Cool completely on wire rack.  Frost bottom cookie with Pink Valentine Frosting and place an open centered cookie on top to form the sandwich.  Also frost the small 1 1/2 inch hearts and serve as separate cookies."], "facts": "210 calories; protein 2.4g 5% DV; carbohydrates 24.7g 8% DV; fat 11.3g 17% DV; cholesterol 39.7mg 13% DV; sodium 155.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/13309/rich-and-simple-french-onion-soup/", "name": "Rich and Simple French Onion Soup", "summary": "\nWe have been trying French onion soup in restaurants for years and my family and friends agree none can compare to my recipe for taste and simplicity of preparation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1081318.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup unsalted butter", "2 tablespoons olive oil", "4 cups sliced onions", "4 (10.5 ounce) cans beef broth", "2 tablespoons dry sherry", "1 teaspoon dried thyme", "salt and pepper to taste", "4 slices French bread", "4 slices provolone cheese", "2 slices Swiss cheese, diced", "¼ cup grated Parmesan cheese"], "direction": ["Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions.", "Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes.", "Heat the oven broiler.", "Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly."], "facts": "585 calories; protein 20.9g 42% DV; carbohydrates 27.9g 9% DV; fat 43.9g 68% DV; cholesterol 98mg 33% DV; sodium 1578.3mg 63% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/", "name": "The Best Rolled Sugar Cookies", "summary": "\nWhenever you make these cookies for someone, be sure to bring along several copies of the recipe!  You will be asked for it, I promise! NOTE: I make icing with confectioners' sugar and milk. I make it fairly thin, as I 'paint' the icing on the cookies with a pastry brush. Thin enough to spread easily but not so thin that it just makes your cookies wet and runs off. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F519229_original-2000.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "2 hrs 32 mins"], ["total:", "3 hrs"], ["Servings:", "60"], ["Yield:", "5 dozen"]], "ingredients": ["1 ½ cups butter, softened", "2 cups white sugar", "4  eggs", "1 teaspoon vanilla extract", "5 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt"], "direction": ["In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).", "Preheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.", "Bake 6 to 8 minutes in preheated oven. Cool completely."], "facts": "110 calories; protein 1.5g 3% DV; carbohydrates 14.7g 5% DV; fat 5g 8% DV; cholesterol 24.6mg 8% DV; sodium 92.6mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/31972/peking-duck/", "name": "Peking Duck", "summary": "\nI have made this recipe and it is delicious. It can be served with plum sauce as well as a fruit sauce. This is actually a short-cut version but it is fantastic. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662217.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 35 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (4 pound) whole duck, dressed", "½ teaspoon ground cinnamon", "½ teaspoon ground ginger", "¼ teaspoon ground nutmeg", "¼ teaspoon ground white pepper", "⅛ teaspoon ground cloves", "3 tablespoons soy sauce", "1 tablespoon honey", "1  orange, sliced in rounds", "1 tablespoon chopped fresh parsley, for garnish", "5  green onions", "½ cup plum jam", "1 ½ teaspoons sugar", "1 ½ teaspoons distilled white vinegar", "¼ cup finely chopped chutney"], "direction": ["Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.", "Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.", "Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.", "Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.", "Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping."], "facts": "556 calories; protein 22.4g 45% DV; carbohydrates 48.1g 16% DV; fat 31g 48% DV; cholesterol 91.1mg 30% DV; sodium 747.8mg 30% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/21736/pan-seared-salmon-i/", "name": "Pan Seared Salmon I", "summary": "\nSimply seasoned with salt and pepper, these salmon fillets are pan seared with capers, and garnished with slices of lemon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998740.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) fillets salmon", "2 tablespoons olive oil", "2 tablespoons capers", "⅛ teaspoon salt", "⅛ teaspoon ground black pepper", "4 slices  lemon"], "direction": ["Preheat a large heavy skillet over medium heat for 3 minutes.", "Coat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.", "Transfer salmon to individual plates, and garnish with lemon slices."], "facts": "371 calories; protein 33.7g 67% DV; carbohydrates 1.7g 1% DV; fat 25.1g 39% DV; cholesterol 99.1mg 33% DV; sodium 299.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/65147/roasted-duck/", "name": "Roasted Duck", "summary": "\nI made this last year out of the blue, and my whole family enjoyed it.  We had never had duck before, and it was a nice exchange for the traditional turkey.  We served it with all the usual side dishes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1897853.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons salt", "2 teaspoons paprika", "1 teaspoon black pepper", "1 (5 pound) whole duck", "½ cup melted butter"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Rub salt, pepper, and paprika into the skin of the duck.  Place in a roasting pan.", "Roast duck in preheated oven for 1 hour. Spoon 1/4 cup melted butter over bird, and continue cooking for 45 more minutes. Spoon remaining 1/4 cup melted butter over duck, and cook for 15 more minutes, or until golden brown."], "facts": "625 calories; protein 51.8g 104% DV; carbohydrates 1g; fat 45.1g 69% DV; cholesterol 280mg 93% DV; sodium 1538.1mg 62% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/269592/pork-chops-in-garlic-mushroom-sauce/", "name": "Pork Chops in Garlic Mushroom Sauce", "summary": "\nThis recipe is my twist on a fancy restaurant meal we got on Valentine's Day. The recipe has half the amount of garlic than was originally used. Hope everyone else enjoys it just as much as we do. Garnish with fresh parsley, chives, or thyme leaves. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F499eb3d3-548a-4704-b2c1-67f693a7939e%2F74158190-3ec7-49d2-b150-e794eb82af20%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 pounds boneless pork chops", "½ teaspoon paprika", "1 pinch kosher salt and ground black pepper to taste", "¼ cup butter, divided", "1 (8 ounce) package sliced fresh mushrooms", "4 cloves garlic, minced", "1 teaspoon Dijon mustard", "2 tablespoons all-purpose flour", "2 cups beef broth"], "direction": ["Season both sides of pork chops with paprika, salt, and pepper.", "Heat a large skillet over medium-high heat; add 2 tablespoons butter. Sear pork chops until golden brown and no longer pink in the center, 2 to 4 minutes per side. Remove pork chops from the skillet and set aside.", "Melt remaining butter in the same skillet over medium-high heat. Add mushrooms and cook until golden and excess moisture evaporates, about 5 minutes. Add garlic and mustard; cook until garlic is fragrant, about 1 minute.", "Add flour to the skillet, stirring to remove any lumps. Slowly add beef broth, whisking until incorporated. Season with salt and pepper. Reduce heat to medium and simmer, stirring often, until sauce thickens, about 5 minutes. Check for seasoning again.", "Return pork chops to the skillet and cook until heated through, about 1 minute. Serve hot."], "facts": "199 calories; protein 16.3g 33% DV; carbohydrates 3.1g 1% DV; fat 13.4g 21% DV; cholesterol 53.9mg 18% DV; sodium 332.7mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/76637/perfect-lobster-bisque/", "name": "Perfect Lobster Bisque", "summary": "\nThis is a decadent lobster bisque that is surprisingly easy to prepare. Your guests will be impressed and feel pampered. I serve this with salad and hot, buttered French bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3265409.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 cups"]], "ingredients": ["3 tablespoons butter", "¼ cup chopped fresh mushrooms", "2 tablespoons chopped onion", "2 tablespoons chopped celery", "2 tablespoons chopped carrot", "1 (14.5 ounce) can chicken broth", "⅛ teaspoon salt", "⅛ teaspoon cayenne pepper", "1 ½ cups half-and-half", "½ cup dry white wine", "½ pound cooked lump lobster meat"], "direction": ["Melt the butter in a large saucepan over medium-low heat. Add the mushrooms, onion, celery, and carrot. Cook and stir until tender, about 10 minutes. Stir in the chicken broth, and season with salt and cayenne pepper. Bring to a boil, then simmer for 10 minutes.", "Pour the vegetable and broth mixture into the container of a blender, and add 1/4 cup of the lobster meat. Cover, and process until smooth. Return to the saucepan, and stir in the half-and-half, white wine, and remaining lobster meat.  Cook over low heat, stirring frequently until thickened, about 30 minutes."], "facts": "191 calories; protein 10g 20% DV; carbohydrates 4.7g 2% DV; fat 13.1g 20% DV; cholesterol 66.2mg 22% DV; sodium 553.6mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/232908/chef-johns-meatless-meatballs/", "name": "Chef John's Meatless Meatballs", "summary": "\nI made this recipe to celebrate Earth Day. Thanks to a thorough browning, mushrooms provide more than enough savoriness. The garlic, cheese, and parsley do the rest. What really blew me away was how close the texture was to actual meatballs. They are officially approved for use on spaghetti! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2266615.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "4 hrs"], ["total:", "5 hrs 30 mins"], ["Servings:", "4"], ["Yield:", "16 small meatballs"]], "ingredients": ["1 tablespoon olive oil", "1 pound fresh white mushrooms, finely chopped", "1 pinch salt", "1 tablespoon butter", "½ cup finely chopped onion", "4 cloves garlic, minced", "½ cup quick-cooking oats", "1 ounce very finely shredded Parmigiano-Reggiano cheese", "½ cup bread crumbs", "¼ cup chopped flat-leaf (Italian) parsley, packed", "2  eggs, divided", "1 teaspoon salt", "freshly ground black pepper to taste", "1 pinch cayenne pepper, or to taste", "1 pinch dried oregano", "3 cups pasta sauce", "1 tablespoon very finely shredded Parmigiano-Reggiano cheese, or to taste", "1 tablespoon chopped flat-leaf (Italian) parsley, or to taste"], "direction": ["Heat olive oil in a skillet over medium-high heat. Add mushrooms to the hot oil, sprinkle with salt, and cook and stir until liquid from mushrooms has evaporated. Stir butter into mushrooms, reduce heat to medium, and cook and stir mushrooms until golden brown, about 5 minutes.", "Stir onion into mushrooms and cook, stirring often, until onion is translucent, 5 minutes. Remove skillet from heat and stir garlic into mushroom mixture until fragrant, about 1 minute. Transfer mixture to a mixing bowl.", "Mix oats into mushroom mixture until thoroughly combined. Gently stir 1 ounce Parmigiano-Reggiano cheese into mixture. Add bread crumbs, 1/4 cup parsley, and 1 egg; season with salt, black pepper, cayenne pepper, and oregano. Mix together with a fork until crumbly. Stir in remaining 1 egg. Mixture should hold together when pressed.", "Cover bowl with plastic wrap and refrigerate at least 4 hours. For best flavor and texture, refrigerate overnight.", "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with a silicone baking mat or parchment paper.", "Form mixture into small meatballs using a 2-tablespoon scoop. Roll meatballs lightly between your hands until smooth, if desired; arrange meatballs on prepared baking sheet.", "Bake in the preheated oven until meatballs are lightly golden brown, 12 to 15 minutes.", "Bring pasta sauce to a boil in a large saucepan; reduce heat to low. Gently stir meatballs into sauce until coated. Simmer meatballs in sauce until cooked through, 45 minutes to 1 hour. Transfer to a serving bowl and garnish with 1 tablespoon Parmigiano-Reggiano cheese and 1 tablespoon parsley."], "facts": "421 calories; protein 16.9g 34% DV; carbohydrates 50.1g 16% DV; fat 17.9g 28% DV; cholesterol 110.4mg 37% DV; sodium 1695.2mg 68% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/14064/easy-guacamole/", "name": "Easy Guacamole", "summary": "\nSimply a quick recipe for tasty guacamole! Great with tortilla chips or as a topping for Mexican foods! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1488197.jpg", "meta": [["prep:", "10 mins"], ["additional:", "30 mins"], ["total:", "40 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["2  avocados", "1 small onion, finely chopped", "1 clove garlic, minced", "1  ripe tomato, chopped", "1  lime, juiced", "salt and pepper to taste"], "direction": ["Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper.  Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors."], "facts": "45 calories; protein 0.7g 1% DV; carbohydrates 3.4g 1% DV; fat 3.7g 6% DV; cholesterol 0mg; sodium 2.4mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/", "name": "Shrimp Scampi with Pasta", "summary": "\nWell-rounded seafood and pasta dish. Good with any pasta; angel hair is less filling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2606852.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package linguine pasta", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "2  shallots, finely diced", "2 cloves garlic, minced", "1 pinch red pepper flakes  (Optional)", "1 pound shrimp, peeled and deveined", "1 pinch kosher salt and freshly ground pepper", "½ cup dry white wine", "1  lemon, juiced", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "¼ cup finely chopped fresh parsley leaves", "1 teaspoon extra-virgin olive oil, or to taste"], "direction": ["Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.", "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.", "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve."], "facts": "511 calories; protein 21.9g 44% DV; carbohydrates 57.5g 19% DV; fat 19.4g 30% DV; cholesterol 135.4mg 45% DV; sodium 260mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/132358/easy-garlic-lemon-scallops/", "name": "Easy Garlic-Lemon Scallops", "summary": "\nScallops sauteed in butter and garlic will melt in your mouth. Lemon juice gives it a nice kick. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5916120.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¾ cup butter", "3 tablespoons minced garlic", "2 pounds large sea scallops", "1 teaspoon salt", "⅛ teaspoon pepper", "2 tablespoons fresh lemon juice"], "direction": ["Melt butter in a large skillet over medium-high heat. Stir in garlic, and cook for a few seconds until fragrant. Add scallops, and cook for several minutes on one side, then turn over, and continue cooking until firm and opaque.", "Remove scallops to a platter, then whisk salt, pepper, and lemon juice into butter. Pour sauce over scallops to serve."], "facts": "408 calories; protein 38.5g 77% DV; carbohydrates 8.9g 3% DV; fat 24.4g 38% DV; cholesterol 152.4mg 51% DV; sodium 987.9mg 40% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/51283/maple-salmon/", "name": "Maple Salmon", "summary": "\nThis is the best and most delicious salmon recipe, and very easy to prepare. I love maple in everything and put this together one night. My husband totally loved it; he did not like salmon that much until he had this. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F862371.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup maple syrup", "2 tablespoons soy sauce", "1 clove garlic, minced", "¼ teaspoon garlic salt", "⅛ teaspoon ground black pepper", "1 pound salmon"], "direction": ["In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.", "Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.", "Preheat oven to 400 degrees F (200 degrees C).", "Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."], "facts": "265 calories; protein 23.2g 46% DV; carbohydrates 14.1g 5% DV; fat 12.4g 19% DV; cholesterol 67mg 22% DV; sodium 633.1mg 25% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/", "name": "Homemade Four Cheese Ravioli", "summary": "\nGreat homemade Italian ravioli recipe that I have recreated to taste like the ravioli at Maggiano's restaurant. Don't be intimidated by the large list of ingredients, it is well worth it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5943283.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "20 ravioli"]], "ingredients": ["2 cups all-purpose flour", "1 pinch salt", "1 teaspoon olive oil", "2  eggs", "1 ½ tablespoons water"], "direction": ["Mound the flour and salt together on a work surface and form a well. Beat the teaspoon of olive oil, 2 eggs, and water in a bowl. Pour half the egg mixture into the well. Begin mixing the egg with the flour with one hand; use your other hand to keep the flour mound steady. Add the remaining egg mixture and knead to form a dough.", "Knead the dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form the dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour.", "While the dough is resting, prepare the ravioli filling. Combine the ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley and mix well. Set the filling aside.", "Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the crushed garlic and pesto sauce and cook for one minute. Pour in the heavy cream, raise the heat to high, and bring the sauce to a boil. Reduce the heat and simmer for 5 minutes. Add the Parmesan cheese and stir until the cheese melts. Remove the pan from the heat and keep warm.", "Meanwhile, in a separate saucepan, warm the marinara sauce over medium-low heat.", "Preheat an oven to 375 degrees F (190 degrees C). Beat the egg with the tablespoon of water to make the egg wash.", "Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop the filling mixture on the dough by teaspoonfuls about one inch apart. Cover the filling with the top sheet of pasta, pressing out the air from around each portion of filling. Press firmly around the filling to seal. Cut into individual ravioli with a knife or pizza cutter. Seal the edges.", "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well.", "Grease a baking sheet. Place the cooked ravioli on the sheet pan and bake in the preheated oven until brown, about 4 minutes.", "To serve the ravioli, divide them among four warmed serving bowls. Drizzle the marinara sauce over the ravioli and then top with the cream sauce."], "facts": "1270 calories; protein 37.8g 76% DV; carbohydrates 80.4g 26% DV; fat 89.2g 137% DV; cholesterol 406.5mg 136% DV; sodium 1358.9mg 54% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/12481/old-fashioned-coconut-cream-pie/", "name": "Old Fashioned Coconut Cream Pie", "summary": "\nThis is a tried-and-true, old-fashioned coconut cream pie. Took many years of searching and baking to find the right one and this is it! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4899464.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 50 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 cup sweetened flaked coconut", "3 cups half-and-half", "2  eggs, beaten", "¾ cup white sugar", "½ cup all-purpose flour", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 (9 inch) pie shell, baked", "1 cup frozen whipped topping, thawed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Spread the coconut on a baking sheet and bake it, stirring occasionally, until golden brown, about 5 minutes.", "In a medium saucepan, combine the half-and-half, eggs, sugar, flour and salt and mix well. Bring to a boil over low heat, stirring constantly. Cook, stirring constantly, for 2 minutes more. Remove the pan from the heat, and stir in 3/4 cup of the toasted coconut and the vanilla extract. Reserve the remaining coconut to top the pie.", "Pour the filling into the pie shell and chill until firm, about 4 hours.", "Top with whipped topping and with the reserved coconut."], "facts": "423 calories; protein 6.8g 14% DV; carbohydrates 46.1g 15% DV; fat 23.5g 36% DV; cholesterol 80.1mg 27% DV; sodium 275.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/214488/lemon-chicken-piccata/", "name": "Lemon Chicken Piccata", "summary": "\nThis delicious chicken dish is exquisite and easy to prepare. The light and luscious lemon sauce really pops without being too acidic; it is simply divine. Serve it with herb-roasted potatoes or lemon-rice pilaf. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F450856.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 large skinless, boneless chicken breast halves - cut into 1/2-inch medallions", "salt and pepper to taste", "½ cup all-purpose flour", "2 tablespoons vegetable oil, or as needed", "1 clove garlic, minced", "1 cup low sodium chicken broth", "½  lemon, thinly sliced", "¼ cup fresh lemon juice", "2 tablespoons capers, drained and rinsed", "3 tablespoons butter", "2 tablespoons minced Italian (flat-leaf) parsley"], "direction": ["Preheat oven to 200 degrees F (95 degrees C). Place a serving platter into the oven to warm.", "Season the chicken breast pieces with salt and pepper and dredge them in flour. Shake off excess flour. Heat the vegetable oil in a skillet; pan-fry the chicken pieces until golden brown on both sides, about 3 minutes per side. Work in batches and do not crowd skillet, adding oil as needed . Place the chicken pieces onto the warmed platter in the oven. When finished with all the chicken, drain most of the oil from the skillet, leaving a thin coating on the surface of the pan.", "Cook and stir the minced garlic in the skillet until fragrant, about 20 seconds. Pour in the chicken broth. Scrape and dissolve any brown bits from the bottom of the skillet. Stir in the lemon slices and bring the mixture to a boil. Let cook, stirring occasionally, until the sauce reduces to about 2/3 cup, 5 to 8 minutes. Add the lemon juice and capers; simmer until the sauce is reduced and slightly thickened, about 5 minutes more. Drop the butter into the skillet and swirl it into the sauce by tilting the skillet until the butter is melted and incorporated. Add the parsley; remove from heat and set aside.", "Arrange the chicken medallions on serving plates and spoon sauce over each portion to serve."], "facts": "421 calories; protein 41.1g 82% DV; carbohydrates 16.1g 5% DV; fat 21.2g 33% DV; cholesterol 127.6mg 43% DV; sodium 347.9mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/15869/cream-puffs/", "name": "Cream Puffs", "summary": "\nAn easy and impressive way to make a great dessert.  Whip them up and watch them disappear! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6206622.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "20"], ["Yield:", "20 to 25 cream puffs"]], "ingredients": ["2 (3.5 ounce) packages instant vanilla pudding mix", "2 cups heavy cream", "1 cup milk", "½ cup butter", "1 cup water", "¼ teaspoon salt", "1 cup all-purpose flour", "4  eggs"], "direction": ["Mix together vanilla instant pudding mix, cream and milk. Cover and refrigerate to set.", "Preheat oven to 425 degrees F (220 degrees C).", "In a large pot, bring water and butter to a rolling boil. Stir in flour and salt until the mixture forms a ball. Transfer the dough to a large mixing bowl. Using a wooden spoon or stand mixer, beat in the eggs one at a time, mixing well after each. Drop by tablespoonfuls onto an ungreased baking sheet.", "Bake for 20 to 25 minutes in the preheated oven,  until golden brown. Centers should be dry.", "When the shells are cool, either split and fill them with the pudding mixture, or use a pastry bag to pipe the pudding into the shells."], "facts": "190 calories; protein 2.9g 6% DV; carbohydrates 15.2g 5% DV; fat 13.3g 21% DV; cholesterol 76.9mg 26% DV; sodium 230.6mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/91192/french-onion-soup-gratinee/", "name": "French Onion Soup Gratinee", "summary": "\nAbout as good as it gets! This is the version of French Onion Soup that people seek when they go to restaurants. I have been making it for 30 years and it never fails to please. It makes an exquisite presentation, too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2088781.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 tablespoons butter", "1 teaspoon salt", "2 large red onions, thinly sliced", "2 large sweet onions, thinly sliced", "1 (48 fluid ounce) can chicken broth", "1 (14 ounce) can beef broth", "½ cup red wine", "1 tablespoon Worcestershire sauce", "2 sprigs fresh parsley", "1 sprig fresh thyme leaves", "1  bay leaf", "1 tablespoon balsamic vinegar", "salt and freshly ground black pepper to taste", "4 thick slices French or Italian bread", "8 slices Gruyere or Swiss cheese slices, room temperature", "½ cup shredded Asiago or mozzarella cheese, room temperature", "4 pinches paprika"], "direction": ["Melt butter in a large pot over medium-high heat. Stir in salt, red onions and sweet onions. Cook 35 minutes, stirring frequently, until onions are caramelized and almost syrupy.", "Mix chicken broth, beef broth, red wine and Worcestershire sauce into pot. Bundle the parsley, thyme, and bay leaf with twine and place in pot.  Simmer over medium heat for 20 minutes, stirring occasionally. Remove and discard the herbs. Reduce the heat to low, mix in vinegar and season with salt and pepper. Cover and keep over low heat to stay hot while you prepare the bread.", "Preheat oven broiler. Arrange bread slices on a baking sheet and broil 3 minutes, turning once, until well toasted on both sides. Remove from heat; do not turn off broiler.", "Arrange 4 large oven safe bowls or crocks on a rimmed baking sheet. Fill each bowl 2/3 full with hot soup. Top each bowl with 1 slice toasted bread, 2 slice Gruyere cheese and 1/4 of the Asiago or mozzarella cheese. Sprinkle a little bit of paprika over the top of each one.", "Broil 5 minutes, or until bubbly and golden brown. As it softens, the cheese will cascade over the sides of the crock and form a beautifully melted crusty seal. Serve immediately!"], "facts": "618 calories; protein 29.7g 59% DV; carbohydrates 39.5g 13% DV; fat 35.9g 55% DV; cholesterol 113.9mg 38% DV; sodium 3335.7mg 133% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/257193/chef-johns-chocolate-souffle/", "name": "Chef John's Chocolate Souffle", "summary": "\nThese visually impressive individual chocolate soufflés are perfect for your special someone. If you're serving more people, the recipe should scale up just fine. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4479094.jpg", "meta": [["prep:", "15 mins"], ["cook:", "24 mins"], ["total:", "39 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1 teaspoon melted butter, or as needed", "2 tablespoons white sugar", "2 ounces 70% dark chocolate, broken into pieces", "1 tablespoon butter", "1 tablespoon all-purpose flour", "4 ⅓ tablespoons cold milk", "1 pinch salt", "1 pinch cayenne pepper", "1 large egg yolk", "2  large egg whites", "1 pinch cream of tartar", "1 tablespoon white sugar, divided"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper.", "Brush bottom and sides of 2 (5-ounce) ramekins lightly with 1 teaspoon melted butter; cover bottom and sides right up to the rim. Add 1 tablespoon white sugar to ramekins. Rotate ramekins until sugar coats all surfaces. Pour off extra sugar.", "Place chocolate pieces in a metal mixing bowl. Place bowl over a pan of about 3 cups hot water over low heat. Do not let water boil or come to a simmer.", "Melt 1 tablespoon butter in a skillet over medium heat. Sprinkle in flour. Whisk until flour is incorporated into butter and mixture thickens, about 1 minute. Reduce heat to low. Whisk in cold milk until mixture becomes smooth and thickens, 2 or 3 minutes. Remove skillet from heat. Transfer mixture to bowl with melted chocolate. Add salt and very small pinch of cayenne pepper. Mix together thoroughly. Add egg yolk and mix to combine. Leave bowl above the hot (not simmering) water to keep chocolate warm while you whip the egg whites.", "Place 2 egg whites in a mixing bowl; add cream of tartar. Whisk until mixture begins to thicken and a drizzle from the whisk stays on the surface about 1 second before disappearing into the mix, 2 or 3 minutes. Add 1/3 of sugar and whisk in. Whisk in a bit more sugar about 15 seconds; whisk in the rest of the sugar. Continue whisking until mixture is about as thick as shaving cream and holds soft peaks, 3 to 5 minutes.", "Transfer a little less than half of egg whites to chocolate. Mix until egg whites are thoroughly incorporated into the chocolate, 1 or 2 minutes. Add the rest of the egg whites; gently fold into the chocolate with a spatula, lifting from the bottom and folding over. Stop mixing after the egg white disappears. Divide mixture between 2 prepared ramekins. Place ramekins on prepared baking sheet.", "Bake in preheated oven until scuffles are puffed and have risen above the top of the rims, 12 to 15 minutes."], "facts": "356 calories; protein 7.4g 15% DV; carbohydrates 38.6g 13% DV; fat 19.5g 30% DV; cholesterol 124.3mg 41% DV; sodium 194mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/33647/chocolate-ganache/", "name": "Chocolate Ganache", "summary": "\nThis is a rich, dark chocolate topping or decoration that has lots of uses. It can be whipped as filling or icing, or just poured over whatever cake you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5472303.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["9 ounces bittersweet chocolate, chopped", "1 cup heavy cream", "1 tablespoon dark rum"], "direction": ["Place the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil, watching very carefully because if it boils for a few seconds, it will boil out of the pot. When the cream has come to a boil, pour over the chopped chocolate, and whisk until smooth. Stir in the rum if desired.", "Allow the ganache to cool slightly before pouring over a cake. Start at the center of the cake and work outward. For a fluffy frosting or chocolate filling, allow it to cool until thick, then whip with a whisk until light and fluffy."], "facts": "142 calories; protein 1.4g 3% DV; carbohydrates 9.4g 3% DV; fat 10.8g 17% DV; cholesterol 21.1mg 7% DV; sodium 6.5mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/20338/strawberry-pretzel-salad/", "name": "Strawberry Pretzel Salad", "summary": "\nIt is a dessert, but isn't too sweet, nor too salty. It is really pretty when you put it in a clear ovenproof dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4537072.jpg", "meta": [["prep:", "35 mins"], ["cook:", "10 mins"], ["total:", "45 mins"], ["Servings:", "12"], ["Yield:", "1 9x13 inch baking dish"]], "ingredients": ["2 cups crushed pretzels", "¾ cup butter, melted", "3 tablespoons white sugar", "1 (8 ounce) package cream cheese, softened", "1 cup white sugar", "1 (8 ounce) container frozen whipped topping, thawed", "2 (3 ounce) packages strawberry flavored Jell-O®", "2 cups boiling water", "2 (10 ounce) packages frozen strawberries"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Stir together crushed pretzels, melted butter and 3 tablespoons sugar; mix well and press mixture into the bottom of a 9x13 inch baking dish.", "Bake 8 to 10 minutes, until set.  Set aside to cool.", "In a large mixing bowl cream together cream cheese and 1 cup sugar.  Fold in whipped topping.  Spread mixture onto cooled crust.", "Dissolve gelatin in boiling water.  Stir in still frozen strawberries and allow to set briefly.  When mixture is about the consistency of egg whites, pour and spread over cream cheese layer.  Refrigerate until set."], "facts": "424 calories; protein 4.5g 9% DV; carbohydrates 52.1g 17% DV; fat 23.3g 36% DV; cholesterol 51mg 17% DV; sodium 441.7mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/127491/easy-oreo-truffles/", "name": "Easy OREO Truffles", "summary": "\nThese truffles are very easy and delicious. You can't go wrong with OREO, cream cheese and chocolate! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4513169.jpg", "meta": [["additional:", "1 hr 30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "42"], ["Yield:", "3 -1/2 dozen"]], "ingredients": ["1 (16 ounce) package OREO Chocolate Sandwich Cookies, divided", "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened", "2 (8 ounce) packages BAKER'S Semi-Sweet Baking Chocolate, melted"], "direction": ["Crush 9 of the cookies to fine crumbs in food processor; reserve for later use. (Cookies can also be finely crushed in a resealable plastic bag using a rolling pin.) Crush remaining 36 cookies to fine crumbs; place in medium bowl. Add cream cheese; mix until well blended. Roll cookie mixture into 42 balls, about 1-inch in diameter.", "Dip balls in chocolate; place on wax paper-covered baking sheet. (Any leftover chocolate can be stored at room temperature for another use.) Sprinkle with reserved cookie crumbs.", "Refrigerate until firm, about 1 hour. Store leftover truffles, covered, in refrigerator."], "facts": "None"}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/34746/baked-salmon-ii/", "name": "Baked Salmon II", "summary": "\nThis is a great recipe for beginners! This was my first time making fish and it was a hit. Even my 9 year old daughter who wouldn't dream of eating fish EVER had half of my portion! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F593567.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 cloves garlic, minced", "6 tablespoons light olive oil", "1 teaspoon dried basil", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 tablespoon lemon juice", "1 tablespoon fresh parsley, chopped", "2 (6 ounce) fillets salmon"], "direction": ["In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley. Place salmon fillets in a medium glass baking dish, and cover with the marinade. Marinate in the refrigerator about 1 hour, turning occasionally.", "Preheat oven to 375  degrees F (190 degrees C).", "Place fillets in aluminum foil, cover with marinade, and seal. Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork."], "facts": "613 calories; protein 36.3g 73% DV; carbohydrates 2.9g 1% DV; fat 51.9g 80% DV; cholesterol 74.7mg 25% DV; sodium 1234.5mg 49% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/148889/sauteed-swiss-chard-with-parmesan-cheese/", "name": "Sauteed Swiss Chard with Parmesan Cheese", "summary": "\nLemon and Parmesan cheese season this simple, tasty recipe for Swiss chard on your stovetop! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F384364.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "2 cups"]], "ingredients": ["2 tablespoons butter", "2 tablespoons olive oil", "1 tablespoon minced garlic", "½ small red onion, diced", "1 bunch Swiss chard, stems and center ribs cut out and chopped together, leaves coarsely chopped separately", "½ cup dry white wine", "1 tablespoon fresh lemon juice, or to taste", "2 tablespoons freshly grated Parmesan cheese", "1 pinch salt to taste"], "direction": ["Melt butter and olive oil together in a large skillet over medium-high heat. Stir in the garlic and onion, and cook for 30 seconds until fragrant. Add the chard stems and the white wine. Simmer until the stems begin to soften, about 5 minutes. Stir in the chard leaves, and cook until wilted. Finally, stir in lemon juice and Parmesan cheese; season to taste with salt if needed."], "facts": "165 calories; protein 2.3g 5% DV; carbohydrates 4.9g 2% DV; fat 13.4g 21% DV; cholesterol 17.5mg 6% DV; sodium 202.4mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/109297/cedar-planked-salmon/", "name": "Cedar Planked Salmon", "summary": "\nThis is a dish my brother prepared for me in Seattle. It is by far the best salmon I've ever eaten. I like to serve it with an Asian-inspired rice and roasted asparagus. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2609651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 (12 inch) untreated cedar planks", "⅓ cup vegetable oil", "1 ½ tablespoons rice vinegar", "1 teaspoon sesame oil", "⅓ cup soy sauce", "¼ cup chopped green onions", "1 tablespoon grated fresh ginger root", "1 teaspoon minced garlic", "2 (2 pound) salmon fillets, skin removed"], "direction": ["Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time.", "In a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour.", "Preheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little.", "Place the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill."], "facts": "678 calories; protein 61.3g 123% DV; carbohydrates 1.7g 1% DV; fat 45.8g 70% DV; cholesterol 178.6mg 60% DV; sodium 981.2mg 39% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216757/savory-sea-scallops-and-angel-hair-pasta/", "name": "Savory Sea Scallops and Angel Hair Pasta", "summary": "\nThis is a very simple, easy to prepare meal that you will most likely be asked to prepare again. The taste, if carefully prepared and not overcooked, is incredible. ENJOY! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8248413.jpg", "meta": [["prep:", "25 mins"], ["cook:", "5 mins"], ["total:", "30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package angel hair pasta", "¼ cup butter", "2 cloves garlic, minced", "2 pounds sea scallops, rinsed and patted dry", "3 tablespoons chopped fresh basil", "2 tablespoons chopped fresh flat-leaf parsley", "2 tablespoons fresh lemon juice", "salt and freshly ground black pepper to taste", "½ cup heavy cream", "1 tablespoon grated Parmesan cheese to taste"], "direction": ["Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.", "Melt butter in a skillet over medium heat. Stir in the garlic and cook just until fragrant and softened, about 1 minute. Slice any scallops over 3/4-inch thick in half so they'll cook evenly; stir scallops, basil, and parsley into the skillet. Cook and gently stir just until scallops feel slightly firm when pressed with a finger, 2 to 3 minutes. Scallops will become tough and chewy if overcooked. Stir in lemon juice, and season with salt and black pepper. Pour in cream if you like a thicker sauce. Bring the mixture just to a bare simmer.", "Serve over hot angel hair pasta; sprinkle to taste with Parmesan cheese."], "facts": "515 calories; protein 33.1g 66% DV; carbohydrates 46.3g 15% DV; fat 21.9g 34% DV; cholesterol 95.5mg 32% DV; sodium 527.8mg 21% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16018/caramels/", "name": "Caramels", "summary": "\nI have used this recipe for almost 41 years, and have yet to have any bad batches. My grandson loves 'em! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F755536.jpg", "meta": [["Servings:", "60"], ["Yield:", "4 to 5 dozen caramels"]], "ingredients": ["2 cups white sugar", "1 cup packed brown sugar", "1 cup corn syrup", "1 cup evaporated milk", "1 pint heavy whipping cream", "1 cup butter", "1 ¼ teaspoons vanilla extract"], "direction": ["Grease a 12x15 inch pan.", "In a medium-size pot, combine sugar, brown sugar, corn syrup, evaporated milk, whipping cream, and butter. Monitor the heat of the mixture with a candy thermometer while stirring. When the thermometer reaches 250 degrees F (120 degrees C) remove the pot from the heat.", "Stir in vanilla. Transfer mixture to the prepared pan and let the mixture cool completely. When cooled cut the Carmel into small squares and wrap them in wax paper for storage."], "facts": "115 calories; protein 0.5g 1% DV; carbohydrates 14.8g 5% DV; fat 6.3g 10% DV; cholesterol 20.2mg 7% DV; sodium 30.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/231345/bacon-wrapped-venison-tenderloin-with-garlic-cream-sauce/", "name": "Bacon-Wrapped Venison Tenderloin with Garlic Cream Sauce", "summary": "\nThis recipe originated via other recipe suggestions for filet mignon. I made this recipe on my own to celebrate my hunter-husband's Valentine's! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8284558.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 thick slices bacon", "2 (3/4 pound) venison tenderloin roasts", "2 teaspoons olive oil, divided", "¼ teaspoon onion powder, divided", "kosher salt and ground black pepper to taste", "2 tablespoons butter", "1 (8 ounce) package sliced cremini mushrooms", "2 cloves garlic, chopped", "1 tablespoon chopped green onion, or more to taste", "½ cup heavy whipping cream, or more to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Place bacon on a slotted baking pan.", "Bake bacon in the preheated oven until partially cooked but still flexible, 6 to 8 minutes.", "Brush venison tenderloins with olive oil and season with onion powder, salt, and black pepper. Place tenderloin roasts side by side and wrap them together in strips of partially cooked bacon. Place into a roasting pan.", "Roast until bacon is browned and an instant-read meat thermometer inserted into the thickest part of a tenderloin reads at least 145 degrees F (65 degrees C), about 1 hour.", "Heat butter in a saucepan over medium heat; cook and stir mushrooms and garlic in hot butter until mushrooms are soft, 8 to 10 minutes. Stir green onion into mushroom mixture; pour in cream. Cook, stirring often, until sauce is heated through. Serve sauce with tenderloins."], "facts": "310 calories; protein 28.2g 56% DV; carbohydrates 2.4g 1% DV; fat 20.3g 31% DV; cholesterol 130.4mg 44% DV; sodium 443.3mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/19010/eclairs-ii/", "name": "Eclairs II", "summary": "\nMy family loves these eclairs and request them all the time. I usually make them as dessert whenever we have company coming, they are always a hit! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1530950.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "9"], ["Yield:", "9 eclairs"]], "ingredients": ["½ cup butter", "1 cup water", "1 cup all-purpose flour", "¼ teaspoon salt", "4  eggs", "1 (5 ounce) package instant vanilla pudding mix", "2 ½ cups cold milk", "1 cup heavy cream", "¼ cup confectioners' sugar", "1 teaspoon vanilla extract", "2 (1 ounce) squares semisweet chocolate", "2 tablespoons butter", "1 cup confectioners' sugar", "1 teaspoon vanilla extract", "3 tablespoons hot water"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).  Grease a cookie sheet.", "In a medium saucepan, combine 1/2 cup butter and 1 cup water.  Bring to a boil, stirring until butter melts completely.  Reduce heat to low, and add flour and salt.  Stir vigorously until mixture leaves the sides of the pan and begins to form a stiff ball.  Remove from heat.  Add eggs, one at a time, beating well to incorporate completely after each addition.  With a spoon or a pastry bag fitted with a No. 10, or larger, tip, spoon or pipe dough onto cookie sheet in  1 1/2 x 4 inch strips.", "Bake 15 minutes in the preheated oven, then reduce heat to 325 degrees F (165 degrees C) and bake 20 minutes more, until hollow sounding when lightly tapped on the bottom.  Cool completely on a wire rack.", "For the filling, combine pudding mix and milk in medium bowl according to package directions.  In a separate bowl, beat the cream with an electric mixer until soft peaks form.  Beat in 1/4 cup confectioners' sugar and 1 teaspoon vanilla.  Fold whipped cream into pudding.  Cut tops off of cooled pastry shells with a sharp knife.  Fill shells with pudding mixture and replace tops.", "For the icing, melt the chocolate and 2 tablespoons butter in a medium saucepan over low heat.  Stir in 1 cup confectioners' sugar and 1 teaspoon vanilla.  Stir in hot water, one tablespoon  at a time, until icing is smooth and has reached desired consistency.  Remove from heat, cool slightly, and drizzle over filled eclairs.  Refrigerate until serving."], "facts": "476 calories; protein 7.6g 15% DV; carbohydrates 49.4g 16% DV; fat 28.4g 44% DV; cholesterol 157.8mg 53% DV; sodium 484.9mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/241308/fresh-raspberry-sauce/", "name": "Fresh Raspberry Sauce", "summary": "\nThis stuff is so beautiful and delicious, you and your Valentine may not even need the cake. This will absolutely work even if you use frozen raspberries, but nothing compares to the flavor of the sauce if you can somehow find and use fresh raspberries. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2063248.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["additional:", "45 mins"], ["total:", "55 mins"], ["Servings:", "12"], ["Yield:", "3 cups"]], "ingredients": ["1 ½ pounds fresh raspberries", "¼ cup white sugar", "1 tablespoon water, or as needed  (Optional)", "2 teaspoons lemon juice, or more to taste"], "direction": ["Combine raspberries, sugar, water, and lemon juice in a saucepan over medium heat; cook and stir until raspberries break down, sugar dissolves, and sauce is heated through, 3 to 7 minutes. Remove from heat and press sauce through a fine-mesh strainer to remove seeds. Cool to room temperature, cover the bowl with plastic wrap, and refrigerate until chilled, at least 45 minutes."], "facts": "44 calories; protein 0.5g 1% DV; carbohydrates 10.8g 4% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 0mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/8975/chicken-parmigiana/", "name": "Chicken Parmigiana", "summary": "\nThis is a very nice dinner for two. Serve it with your favorite pasta and tossed greens. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F10037.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  egg, beaten", "2 ounces dry bread crumbs", "2  skinless, boneless chicken breast halves", "¾ (16 ounce) jar spaghetti sauce", "2 ounces shredded mozzarella cheese", "¼ cup grated Parmesan cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.", "Pour egg into a small shallow bowl. Place bread crumbs in a separate shallow bowl. Dip chicken into egg, then into the bread crumbs. Place coated chicken on the prepared baking sheet and bake in the preheated oven for 40 minutes, or until no longer pink and juices run clear.", "Pour 1/2 of the spaghetti sauce into a 7x11 inch baking dish. Place chicken over sauce, and cover with remaining sauce. Sprinkle mozzarella and Parmesan cheeses on top and return to the preheated oven for 20 minutes."], "facts": "528 calories; protein 43.5g 87% DV; carbohydrates 44.9g 15% DV; fat 18.3g 28% DV; cholesterol 184.1mg 61% DV; sodium 1309.5mg 52% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/218179/my-favorite-beet-salad/", "name": "My Favorite Beet Salad", "summary": "\nFresh roasted beets over a bed of baby spinach with tomatoes, avocados, onions and feta cheese drizzled with a  balsamic dressing. You can cut this recipe in half for 4 servings, though it so good the next day too that I always make plenty. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672001.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6 large beets, trimmed", "¼ cup extra virgin olive oil", "salt and ground black pepper to taste", "1 (8 ounce) package baby spinach leaves", "2  tomatoes, cut into bite-sized pieces", "2  avocados - peeled, pitted, and cut into bite-sized pieces", "½  red onion, chopped, or to taste", "1 (4 ounce) container crumbled feta cheese", "½ cup balsamic vinegar", "½ cup extra-virgin olive oil", "1 tablespoon Dijon mustard, or more to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Place the beets into a large bowl, and drizzle with 1/4 cup olive oil, salt, and black pepper. Lay out 2 large squares of aluminum foil on a work surface, and place 3 beets onto the center of each sheet. Fold the aluminum foil into 2 envelopes, sealing the beets into the packets; place the packets into a baking dish.", "Bake in the preheated oven until tender, 1 to 1 1/2 hours. Check for tenderness after 1 hour by piercing a beet with a fork. Open the foil, and allow the beets to cool until they can be handled; peel, and slice.", "Lay out the spinach leaves on an attractive oblong-shaped serving platter. Sprinkle pieces of tomato and avocado over the spinach leaves, and top with chopped red onion. Lay the sliced warm beets over the salad, and top with crumbled feta cheese.", "Whisk together balsamic vinegar, 1/2 cup of olive oil, and Dijon mustard until smooth; pour over the salad to serve."], "facts": "413 calories; protein 7.2g 14% DV; carbohydrates 28.2g 9% DV; fat 31.9g 49% DV; cholesterol 12.6mg 4% DV; sodium 400.3mg 16% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/17205/eggs-benedict/", "name": "Eggs Benedict", "summary": "\nHot buttered English muffins, Canadian-style bacon, and poached eggs are topped with a heavenly drizzle of hollandaise sauce. Wonderful for Easter, Mother's Day, or anytime you want to treat yourself to the best brunch in the world! Serve with roasted potatoes for mopping up the extra egg yolk and hollandaise. If you prefer, you can substitute ham for the Canadian bacon in this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F828993.jpg", "meta": [["prep:", "25 mins"], ["cook:", "5 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  egg yolks", "3 ½ tablespoons lemon juice", "1 pinch ground white pepper", "⅛ teaspoon Worcestershire sauce", "1 tablespoon water", "1 cup butter, melted", "¼ teaspoon salt", "8  eggs", "1 teaspoon distilled white vinegar", "8 strips Canadian-style bacon", "4  English muffins, split", "2 tablespoons butter, softened"], "direction": ["To Make Hollandaise: Fill the bottom of a double boiler part-way with water. Make sure that water does not touch the top pan. Bring water to a gentle simmer. In the top of the double boiler, whisk together egg yolks, lemon juice, white pepper, Worcestershire sauce, and 1 tablespoon water.", "Add the melted butter to egg yolk mixture 1 or 2 tablespoons at a time while whisking yolks constantly. If hollandaise begins to get too thick, add a teaspoon or two of hot water. Continue whisking until all butter is incorporated. Whisk in salt, then remove from heat. Place a lid on pan to keep sauce warm.", "Preheat oven on broiler setting. To Poach Eggs: Fill a large saucepan with 3 inches of water. Bring water to a gentle simmer, then add vinegar. Carefully break eggs into simmering water, and allow to cook for 2 1/2 to 3 minutes. Yolks should still be soft in center. Remove eggs from water with a slotted spoon and set on a warm plate", "While eggs are poaching, brown the bacon in a medium skillet over medium-high heat and toast the English muffins on a baking sheet under the broiler.", "Spread toasted muffins with softened butter, and top each one with a slice of bacon, followed by one poached egg. Place 2 muffins on each plate and drizzle with hollandaise sauce. Sprinkle with chopped chives and serve immediately."], "facts": "879 calories; protein 31.8g 64% DV; carbohydrates 29.6g 10% DV; fat 71.1g 109% DV; cholesterol 742.1mg 247% DV; sodium 1719.3mg 69% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/187409/valentine-night-strawberries/", "name": "Valentine Night Strawberries", "summary": "\nStrawberries stuffed with lightly-sweetened cream cheese and walnuts are perfect for that romantic evening. They go great with champagne! Pecans also work well in this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F180904.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "18"], ["Yield:", "18 strawberries"]], "ingredients": ["20  fresh strawberries", "1 (3 ounce) package cream cheese, softened", "2 tablespoons chopped walnuts", "1 ½ tablespoons confectioners' sugar"], "direction": ["Dice two strawberries and set aside. Cut the stems off of each of the remaining strawberries, forming a base for strawberries to stand on. Starting at the pointed ends and cutting most of the way, but not completely through the stem end, slice each strawberry into four wedges.", "Beat the cream cheese until fluffy; stir in the diced strawberries, walnuts, and powdered sugar. Spoon or pipe about a teaspoon of mix into each strawberry."], "facts": "31 calories; protein 0.6g 1% DV; carbohydrates 2.4g 1% DV; fat 2.2g 4% DV; cholesterol 5.2mg 2% DV; sodium 14.2mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/25808/chocolate-truffle-cookies/", "name": "Chocolate Truffle Cookies", "summary": "\nA very dark, rich chocolate cookie for the true chocoholic. This recipe uses relatively little flour, resulting in dense, fudge-like cookies. These cookies keep well in the freezer (but you may have a hard time waiting for them to thaw before you eat them). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F442366.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["additional:", "1 hr 35 mins"], ["total:", "2 hrs"], ["Servings:", "36"], ["Yield:", "3 dozen"]], "ingredients": ["4 (1 ounce) squares unsweetened chocolate, chopped", "1 cup semisweet chocolate chips", "6 tablespoons butter", "3  eggs", "1 cup white sugar", "1 ½ teaspoons vanilla extract", "½ cup all-purpose flour", "2 tablespoons unsweetened cocoa powder", "¼ teaspoon baking powder", "¼ teaspoon salt", "1 cup semisweet chocolate chips"], "direction": ["In the microwave or in a metal bowl over a pan of simmering water, melt unsweetened chocolate, 1 cup of the chocolate chips, and the butter stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, whip eggs and sugar until thick and pale, about 2 minutes. Stir in the vanilla and the chocolate mixture until well mixed. Combine the flour, cocoa, baking powder and salt; gradually stir into the chocolate mixture. Fold in remaining 1 cup chocolate chips. Cover dough and chill for at least an hour or overnight.", "Preheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls. Place on ungreased cookie sheets so they are 2 inches apart.", "Bake for 9 to 11 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely."], "facts": "112 calories; protein 1.6g 3% DV; carbohydrates 13.9g 5% DV; fat 6.8g 11% DV; cholesterol 20.6mg 7% DV; sodium 40mg 2% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/11808/creamy-pesto-shrimp/", "name": "Creamy Pesto Shrimp", "summary": "\nOne of our family's favorites, it's also great when made with crab meat instead of the shrimp. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F352934.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 pound linguine pasta", "½ cup butter", "2 cups heavy cream", "½ teaspoon ground black pepper", "1 cup grated Parmesan cheese", "⅓ cup pesto", "1 pound large shrimp, peeled and deveined"], "direction": ["Bring a large pot of lightly salted water to a boil. Add linguine pasta, and cook for 8 to 10 minutes, or until al dente; drain.", "In a large skillet, melt the butter over medium heat. Stir in cream, and season with pepper. Cook 6 to 8 minutes, stirring constantly.", "Stir Parmesan cheese into cream sauce, stirring until thoroughly mixed. Blend in the pesto, and cook for 3 to 5 minutes, until thickened.", "Stir in the shrimp, and cook until they turn pink, about 5 minutes. Serve over the hot linguine."], "facts": "646 calories; protein 23.1g 46% DV; carbohydrates 43g 14% DV; fat 42.5g 66% DV; cholesterol 210.4mg 70% DV; sodium 437.2mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/21712/chocolate-covered-strawberries/", "name": "Chocolate Covered Strawberries", "summary": "\nThis is the simplest version of chocolate covered strawberries I know. Paraffin was originally used instead of shortening. Turn the strawberries upside down and insert by the toothpicks into a piece of styrofoam for easy cooling, or simply place them on a sheet of wax paper. White chocolate may be drizzled over the milk chocolate for a fancier look. They are perfect for weddings when decorated with frosting bow ties, bells, butterflies, roses, etc. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F845742.jpg", "meta": [["prep:", "15 mins"], ["total:", "15 mins"], ["Servings:", "24"], ["Yield:", "3 cups"]], "ingredients": ["16 ounces milk chocolate chips", "2 tablespoons shortening", "1 pound fresh strawberries with leaves"], "direction": ["In a double boiler, melt the chocolate and shortening, stirring occasionally until smooth. Holding them by the toothpicks, dip the strawberries into the chocolate mixture.", "Insert toothpicks into the tops of the strawberries.", "Turn the strawberries upside down and insert the toothpick into styrofoam for the chocolate to cool."], "facts": "115 calories; protein 1.4g 3% DV; carbohydrates 12.7g 4% DV; fat 7.3g 11% DV; cholesterol 6.2mg 2% DV; sodium 31.3mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/229453/valentines-salmon/", "name": "Valentine's Salmon", "summary": "\nThis really produces a fantastic piece of salmon, and when paired with a simple potato and leek chowder, would make a terrific Valentine's dinner idea. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1102164.jpg", "meta": [["prep:", "20 mins"], ["cook:", "45 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8  green onions", "1 slice bacon, sliced", "1 clove garlic", "1  leek, white and tender green parts only, halved lengthwise and sliced", "salt to taste", "½ teaspoon butter", "1 ½ cups diced Yukon Gold potatoes", "3 cups water, or more as needed", "1 pinch cayenne pepper", "2 (12 ounce) center-cut salmon fillets", "1 teaspoon tarragon Dijon mustard", "salt and freshly ground black pepper to taste", "1 tablespoon vegetable oil", "2 tablespoons Asian chili paste (sambal), or more to taste  (Optional)", "1  green onion, chopped"], "direction": ["Bring a large pot of lightly salted water to a boil. Add 8 green onions and cook uncovered until slightly softened, about 30 seconds. Immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the onions are cold, drain well, and set aside.", "Cook bacon in a large skillet over medium-low heat until browned, about 8 minutes. Stir in garlic, leek, salt, and butter; cook and stir until leek is softened, about 10 minutes. Add potatoes and enough water to cover, about 3 cups. Season with salt and cayenne pepper. Bring to a simmer, reduce heat to low and cook until potatoes are tender, about 15 minutes. Set aside.", "Preheat oven to 375 degrees F (190 degrees C). Line a baking dish with parchment paper lightly coated with vegetable oil.", "Prepare each salmon filet salmon by cutting the belly, the bottom 1/3 of the fillet, off the skin. Cut remaining 2/3 of fillet away from skin. Cut this piece in half. Cut belly in half horizontally. Spread each piece with tarragon mustard and top with a slice salmon belly. Season with salt and black pepper. Wrap each salmon packet with two green onions, crisscrossing like ribbons, tucking the ends on the underside.", "Place salmon packets, belly-side up, on the parchment and drizzle each with vegetable oil.", "Bake in the preheated oven until the salmon is slightly firm to the touch and no longer translucent inside, about 15 minutes.", "Heat potato leek soup and stir in chopped green onion. Season with salt and black pepper. Serve soup in shallow bowls, topped with 1 salmon packet and garnished with chili paste."], "facts": "444 calories; protein 39.3g 79% DV; carbohydrates 20.9g 7% DV; fat 21.8g 34% DV; cholesterol 121.6mg 41% DV; sodium 264.6mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/42704/prosciutto-wrapped-asparagus/", "name": "Prosciutto Wrapped Asparagus", "summary": "\nMy husband taught me this elegant yet easy side dish! Always a hit at the holidays, and dresses up every day chicken. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1378444.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ pound prosciutto, sliced", "½ (8 ounce) package Neufchatel cheese, softened", "12 spears fresh asparagus, trimmed"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).", "Spread prosciutto slices with Neufchatel cheese. Wrap slices around 2 or 3 asparagus spears. Arrange wrapped spears in a single layer on a medium baking sheet.", "Bake 15 minutes in the preheated oven, until asparagus is tender."], "facts": "292 calories; protein 14.8g 30% DV; carbohydrates 2.7g 1% DV; fat 24.6g 38% DV; cholesterol 71.2mg 24% DV; sodium 1210.1mg 48% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10470/valentine-heart-necklaces/", "name": "Valentine Heart Necklaces", "summary": "\nThese are a great substitute for children to take to school in lieu of Valentine's Day cards!  Use a drinking straw to cut the holes in the pastry. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F180905.jpg", "meta": [["prep:", "35 mins"], ["cook:", "7 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 42 mins"], ["Servings:", "15"], ["Yield:", "30 cookies"]], "ingredients": ["1 cup butter, softened", "¾ cup white sugar", "1  egg", "1 teaspoon vanilla extract", "1 tablespoon lemon zest", "2 ½ cups sifted all-purpose flour", "1 teaspoon baking powder", "3 cups confectioners' sugar", "⅓ cup butter, softened", "1 ½ teaspoons vanilla extract", "2 tablespoons milk", "3 drops red food coloring", "2 ¼ ounces colored candy sprinkles", "60  long red vine licorice"], "direction": ["Cream 1 cup butter or margarine and 3/4 cup white sugar together.  Blend in egg, 1 teaspoon vanilla extract, and grated lemon peel.  Sift together 2 1/2 cups all-purpose flour and baking powder.  Add to creamed mixture and blend well. Cover and refrigerate dough for approximately 2 hours.", "Preheat oven to 375 degrees F (190 degrees C).", "Roll dough to 1/4 inch thickness on a lightly floured surface.  Use a floured heart shaped 1 to 2 inch cookie cutter and cut dough into heart shapes.  Place the cut-out hearts on greased cookie sheets.", "Using the drinking straw, make a hole at the top center of each heart before baking.  Bake for 5 to 7 minutes until very lightly browned.  Cool the cookies on a wire rack.", "To Make Butter Frosting:  Mix 3 cups confectioners' sugar and 1/3 cup butter together.  Stir in 1 1/2 teaspoons vanilla extract and 2 tablespoons  milk.  Beat until smooth making sure frosting is of spreading consistency.  Stir in food coloring to create a pink or red colored frosting, if desired.", "After cookies have cooled, frost and decorate them with nonpareils, sprinkles, dragees, or colored sugar.  Use a toothpick to dislodge the hole, if necessary.  Let the frosting dry.", "To make a necklace, tie the ends off of two pieces of red colored licorice with a knot.  Thread it through the hole at the top center of the cookie.  Tie the other ends off with another knot to create a \"chain.\"  Makes approximately 30 heart necklaces."], "facts": "521 calories; protein 3.9g 8% DV; carbohydrates 87.2g 28% DV; fat 17.8g 27% DV; cholesterol 56mg 19% DV; sodium 175.6mg 7% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/67432/smothered-filet-mignon/", "name": "Smothered Filet Mignon", "summary": "\nA great combination of flavors. Serve with some mashed garlic red potatoes and sweetened green beans for a fabulous special occasion meal. Don't forget to serve a bottle of Cabernet or Zinfandel. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1335503.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) filet mignon steaks", "seasoned salt to taste", "cracked black pepper to taste", "¼ cup extra virgin olive oil", "¼ cup balsamic vinegar", "1 tablespoon Dijon mustard", "2 teaspoons dried rosemary", "1 tablespoon butter", "2 cups onion slices", "1 teaspoon white sugar", "4 ounces blue cheese, crumbled"], "direction": ["Season steaks with seasoned salt and black pepper, and arrange in a single layer in a large baking dish. In a bowl, whisk together olive oil, balsamic vinegar, mustard, and rosemary. Pour mixture over filets, and turn to coat. Marinate for up to 30 minutes.", "While you are marinating the meat, melt the butter in a skillet over medium heat. Cook onion slices in butter until soft, then stir in sugar. Continue cooking until onions are caramelized. Set aside.", "Preheat grill for high heat on one side, and medium heat on the other side.", "Lightly oil the grill grate. Place steaks on the hot side of the grill, and cook for 10 minutes, turning once. When the steaks are almost done, move to the cooler side of the grill. Top each filet with a quarter of the caramelized onions and blue cheese. Close the lid, and continue cooking until the cheese is melted."], "facts": "590 calories; protein 35.3g 71% DV; carbohydrates 13.4g 4% DV; fat 43.4g 67% DV; cholesterol 124.5mg 42% DV; sodium 689.4mg 28% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213469/sweetheart-cupcakes/", "name": "Sweetheart Cupcakes", "summary": "\nInstead of just plain white cupcakes, I took it a step further and made them special. You can change the colors for any holiday. Shades of green for St. Patrick's Day, pastel colors for Easter, red white and blue for the 4th of July. You get the picture. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F585472.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["additional:", "1 hr"], ["total:", "1 hr 40 mins"], ["Servings:", "24"], ["Yield:", "2 dozen cupcakes"]], "ingredients": ["1 (18.25 ounce) package white cake mix", "1 ¼ cups water", "⅓ cup vegetable oil", "3  egg whites", "8 drops red food coloring", "2 drops raspberry candy oil"], "direction": ["Preheat an oven to 350 degrees F (175 degrees C). Line a standard muffin tin with paper cupcake liners.", "Beat the cake mix, water, vegetable oil, and egg whites together on low speed for 30 seconds, then on medium for 2 minutes, until smooth. Fill cupcake liners 1/3 full with white batter; set aside.", "Stir 4 drops of red food coloring into the remaining bowl of batter to make the batter pink. Stir in the raspberry oil. Pour 1/3 of pink batter into a resealable plastic bag and set aside.", "Mix more food coloring into the remaining bowl of pink batter until it is an orange/red color and pour the batter into a resealable plastic bag. Cut a corner off the bag, stick the open tip into the center of each cup of white batter and squeeze in about two tablespoons of red batter.", "Cut the corner off the bag with the pink batter, stick the open tip into the center of the red batter and squeeze about 1 tablespoon pink batter into each cup.", "Bake the layered cupcakes in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool completely before frosting."], "facts": "120 calories; protein 1.4g 3% DV; carbohydrates 16.6g 5% DV; fat 5.3g 8% DV; cholesterol 0mg; sodium 148.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10413/easy-valentine-sandwich-cookies/", "name": "Easy Valentine Sandwich Cookies", "summary": "\nThis recipe makes 17- 3 inch sandwich cookies and 17 - 1 1/2 inch heart shaped cookies.  You'll need a 3-inch heart shaped cutter and a 1 1/2-inch heart shaped cutter.  Frost with Pink Valentine Frosting (see recipe). \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1101763.jpg", "meta": [["Servings:", "17"], ["Yield:", "34 cookies"]], "ingredients": ["1 cup butter", "1 ½ cups confectioners' sugar", "1  egg", "1 teaspoon vanilla extract", "½ teaspoon almond extract  (Optional)", "2 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon cream of tartar"], "direction": ["In a large bowl, cream together butter and confectioners' sugar.  Beat in egg, vanilla and almond extract.  Mix well.", "In a medium bowl, stir together flour, baking soda and cream of tartar;  blend into the butter mixture.  Divide dough into thirds and shape into balls.", "Working with 1/3 of dough at a time, roll out dough into desired thickness on a lightly floured surface.  For each heart sandwich cookie, cut out 2 3-inch hearts.  Cut out the center of ONE of the 3-inch hearts with the 1 1/2-inch cutter.", "Place each piece separately on an ungreased cookie sheet, 1 - 2 inches apart.  Bake in a preheated, 350 degrees F (175 degrees C) oven until lightly browned (7-8 minutes for 1/4 inch thick cookies).  Cool completely on wire rack.  Frost bottom cookie with Pink Valentine Frosting and place an open centered cookie on top to form the sandwich.  Also frost the small 1 1/2 inch hearts and serve as separate cookies."], "facts": "210 calories; protein 2.4g 5% DV; carbohydrates 24.7g 8% DV; fat 11.3g 17% DV; cholesterol 39.7mg 13% DV; sodium 155.7mg 6% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/13309/rich-and-simple-french-onion-soup/", "name": "Rich and Simple French Onion Soup", "summary": "\nWe have been trying French onion soup in restaurants for years and my family and friends agree none can compare to my recipe for taste and simplicity of preparation. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1081318.jpg", "meta": [["prep:", "15 mins"], ["cook:", "50 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["½ cup unsalted butter", "2 tablespoons olive oil", "4 cups sliced onions", "4 (10.5 ounce) cans beef broth", "2 tablespoons dry sherry", "1 teaspoon dried thyme", "salt and pepper to taste", "4 slices French bread", "4 slices provolone cheese", "2 slices Swiss cheese, diced", "¼ cup grated Parmesan cheese"], "direction": ["Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions.", "Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes.", "Heat the oven broiler.", "Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly."], "facts": "585 calories; protein 20.9g 42% DV; carbohydrates 27.9g 9% DV; fat 43.9g 68% DV; cholesterol 98mg 33% DV; sodium 1578.3mg 63% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/", "name": "The Best Rolled Sugar Cookies", "summary": "\nWhenever you make these cookies for someone, be sure to bring along several copies of the recipe!  You will be asked for it, I promise! NOTE: I make icing with confectioners' sugar and milk. I make it fairly thin, as I 'paint' the icing on the cookies with a pastry brush. Thin enough to spread easily but not so thin that it just makes your cookies wet and runs off. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F519229_original-2000.jpg", "meta": [["prep:", "20 mins"], ["cook:", "8 mins"], ["additional:", "2 hrs 32 mins"], ["total:", "3 hrs"], ["Servings:", "60"], ["Yield:", "5 dozen"]], "ingredients": ["1 ½ cups butter, softened", "2 cups white sugar", "4  eggs", "1 teaspoon vanilla extract", "5 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt"], "direction": ["In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).", "Preheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.", "Bake 6 to 8 minutes in preheated oven. Cool completely."], "facts": "110 calories; protein 1.5g 3% DV; carbohydrates 14.7g 5% DV; fat 5g 8% DV; cholesterol 24.6mg 8% DV; sodium 92.6mg 4% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/31972/peking-duck/", "name": "Peking Duck", "summary": "\nI have made this recipe and it is delicious. It can be served with plum sauce as well as a fruit sauce. This is actually a short-cut version but it is fantastic. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662217.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 35 mins"], ["additional:", "2 hrs"], ["total:", "3 hrs 50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 (4 pound) whole duck, dressed", "½ teaspoon ground cinnamon", "½ teaspoon ground ginger", "¼ teaspoon ground nutmeg", "¼ teaspoon ground white pepper", "⅛ teaspoon ground cloves", "3 tablespoons soy sauce", "1 tablespoon honey", "1  orange, sliced in rounds", "1 tablespoon chopped fresh parsley, for garnish", "5  green onions", "½ cup plum jam", "1 ½ teaspoons sugar", "1 ½ teaspoons distilled white vinegar", "¼ cup finely chopped chutney"], "direction": ["Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.", "Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.", "Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.", "Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.", "Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping."], "facts": "556 calories; protein 22.4g 45% DV; carbohydrates 48.1g 16% DV; fat 31g 48% DV; cholesterol 91.1mg 30% DV; sodium 747.8mg 30% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/21736/pan-seared-salmon-i/", "name": "Pan Seared Salmon I", "summary": "\nSimply seasoned with salt and pepper, these salmon fillets are pan seared with capers, and garnished with slices of lemon. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998740.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 (6 ounce) fillets salmon", "2 tablespoons olive oil", "2 tablespoons capers", "⅛ teaspoon salt", "⅛ teaspoon ground black pepper", "4 slices  lemon"], "direction": ["Preheat a large heavy skillet over medium heat for 3 minutes.", "Coat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.", "Transfer salmon to individual plates, and garnish with lemon slices."], "facts": "371 calories; protein 33.7g 67% DV; carbohydrates 1.7g 1% DV; fat 25.1g 39% DV; cholesterol 99.1mg 33% DV; sodium 299.8mg 12% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/65147/roasted-duck/", "name": "Roasted Duck", "summary": "\nI made this last year out of the blue, and my whole family enjoyed it.  We had never had duck before, and it was a nice exchange for the traditional turkey.  We served it with all the usual side dishes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1897853.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 teaspoons salt", "2 teaspoons paprika", "1 teaspoon black pepper", "1 (5 pound) whole duck", "½ cup melted butter"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Rub salt, pepper, and paprika into the skin of the duck.  Place in a roasting pan.", "Roast duck in preheated oven for 1 hour. Spoon 1/4 cup melted butter over bird, and continue cooking for 45 more minutes. Spoon remaining 1/4 cup melted butter over duck, and cook for 15 more minutes, or until golden brown."], "facts": "625 calories; protein 51.8g 104% DV; carbohydrates 1g; fat 45.1g 69% DV; cholesterol 280mg 93% DV; sodium 1538.1mg 62% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/269592/pork-chops-in-garlic-mushroom-sauce/", "name": "Pork Chops in Garlic Mushroom Sauce", "summary": "\nThis recipe is my twist on a fancy restaurant meal we got on Valentine's Day. The recipe has half the amount of garlic than was originally used. Hope everyone else enjoys it just as much as we do. Garnish with fresh parsley, chives, or thyme leaves. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F499eb3d3-548a-4704-b2c1-67f693a7939e%2F74158190-3ec7-49d2-b150-e794eb82af20%2F1280x720%2Fmatch%2Fimage.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["total:", "30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 pounds boneless pork chops", "½ teaspoon paprika", "1 pinch kosher salt and ground black pepper to taste", "¼ cup butter, divided", "1 (8 ounce) package sliced fresh mushrooms", "4 cloves garlic, minced", "1 teaspoon Dijon mustard", "2 tablespoons all-purpose flour", "2 cups beef broth"], "direction": ["Season both sides of pork chops with paprika, salt, and pepper.", "Heat a large skillet over medium-high heat; add 2 tablespoons butter. Sear pork chops until golden brown and no longer pink in the center, 2 to 4 minutes per side. Remove pork chops from the skillet and set aside.", "Melt remaining butter in the same skillet over medium-high heat. Add mushrooms and cook until golden and excess moisture evaporates, about 5 minutes. Add garlic and mustard; cook until garlic is fragrant, about 1 minute.", "Add flour to the skillet, stirring to remove any lumps. Slowly add beef broth, whisking until incorporated. Season with salt and pepper. Reduce heat to medium and simmer, stirring often, until sauce thickens, about 5 minutes. Check for seasoning again.", "Return pork chops to the skillet and cook until heated through, about 1 minute. Serve hot."], "facts": "199 calories; protein 16.3g 33% DV; carbohydrates 3.1g 1% DV; fat 13.4g 21% DV; cholesterol 53.9mg 18% DV; sodium 332.7mg 13% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/76637/perfect-lobster-bisque/", "name": "Perfect Lobster Bisque", "summary": "\nThis is a decadent lobster bisque that is surprisingly easy to prepare. Your guests will be impressed and feel pampered. I serve this with salad and hot, buttered French bread. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3265409.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 cups"]], "ingredients": ["3 tablespoons butter", "¼ cup chopped fresh mushrooms", "2 tablespoons chopped onion", "2 tablespoons chopped celery", "2 tablespoons chopped carrot", "1 (14.5 ounce) can chicken broth", "⅛ teaspoon salt", "⅛ teaspoon cayenne pepper", "1 ½ cups half-and-half", "½ cup dry white wine", "½ pound cooked lump lobster meat"], "direction": ["Melt the butter in a large saucepan over medium-low heat. Add the mushrooms, onion, celery, and carrot. Cook and stir until tender, about 10 minutes. Stir in the chicken broth, and season with salt and cayenne pepper. Bring to a boil, then simmer for 10 minutes.", "Pour the vegetable and broth mixture into the container of a blender, and add 1/4 cup of the lobster meat. Cover, and process until smooth. Return to the saucepan, and stir in the half-and-half, white wine, and remaining lobster meat.  Cook over low heat, stirring frequently until thickened, about 30 minutes."], "facts": "191 calories; protein 10g 20% DV; carbohydrates 4.7g 2% DV; fat 13.1g 20% DV; cholesterol 66.2mg 22% DV; sodium 553.6mg 22% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/232908/chef-johns-meatless-meatballs/", "name": "Chef John's Meatless Meatballs", "summary": "\nI made this recipe to celebrate Earth Day. Thanks to a thorough browning, mushrooms provide more than enough savoriness. The garlic, cheese, and parsley do the rest. What really blew me away was how close the texture was to actual meatballs. They are officially approved for use on spaghetti! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2266615.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["additional:", "4 hrs"], ["total:", "5 hrs 30 mins"], ["Servings:", "4"], ["Yield:", "16 small meatballs"]], "ingredients": ["1 tablespoon olive oil", "1 pound fresh white mushrooms, finely chopped", "1 pinch salt", "1 tablespoon butter", "½ cup finely chopped onion", "4 cloves garlic, minced", "½ cup quick-cooking oats", "1 ounce very finely shredded Parmigiano-Reggiano cheese", "½ cup bread crumbs", "¼ cup chopped flat-leaf (Italian) parsley, packed", "2  eggs, divided", "1 teaspoon salt", "freshly ground black pepper to taste", "1 pinch cayenne pepper, or to taste", "1 pinch dried oregano", "3 cups pasta sauce", "1 tablespoon very finely shredded Parmigiano-Reggiano cheese, or to taste", "1 tablespoon chopped flat-leaf (Italian) parsley, or to taste"], "direction": ["Heat olive oil in a skillet over medium-high heat. Add mushrooms to the hot oil, sprinkle with salt, and cook and stir until liquid from mushrooms has evaporated. Stir butter into mushrooms, reduce heat to medium, and cook and stir mushrooms until golden brown, about 5 minutes.", "Stir onion into mushrooms and cook, stirring often, until onion is translucent, 5 minutes. Remove skillet from heat and stir garlic into mushroom mixture until fragrant, about 1 minute. Transfer mixture to a mixing bowl.", "Mix oats into mushroom mixture until thoroughly combined. Gently stir 1 ounce Parmigiano-Reggiano cheese into mixture. Add bread crumbs, 1/4 cup parsley, and 1 egg; season with salt, black pepper, cayenne pepper, and oregano. Mix together with a fork until crumbly. Stir in remaining 1 egg. Mixture should hold together when pressed.", "Cover bowl with plastic wrap and refrigerate at least 4 hours. For best flavor and texture, refrigerate overnight.", "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with a silicone baking mat or parchment paper.", "Form mixture into small meatballs using a 2-tablespoon scoop. Roll meatballs lightly between your hands until smooth, if desired; arrange meatballs on prepared baking sheet.", "Bake in the preheated oven until meatballs are lightly golden brown, 12 to 15 minutes.", "Bring pasta sauce to a boil in a large saucepan; reduce heat to low. Gently stir meatballs into sauce until coated. Simmer meatballs in sauce until cooked through, 45 minutes to 1 hour. Transfer to a serving bowl and garnish with 1 tablespoon Parmigiano-Reggiano cheese and 1 tablespoon parsley."], "facts": "421 calories; protein 16.9g 34% DV; carbohydrates 50.1g 16% DV; fat 17.9g 28% DV; cholesterol 110.4mg 37% DV; sodium 1695.2mg 68% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/14064/easy-guacamole/", "name": "Easy Guacamole", "summary": "\nSimply a quick recipe for tasty guacamole! Great with tortilla chips or as a topping for Mexican foods! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1488197.jpg", "meta": [["prep:", "10 mins"], ["additional:", "30 mins"], ["total:", "40 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["2  avocados", "1 small onion, finely chopped", "1 clove garlic, minced", "1  ripe tomato, chopped", "1  lime, juiced", "salt and pepper to taste"], "direction": ["Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper.  Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors."], "facts": "45 calories; protein 0.7g 1% DV; carbohydrates 3.4g 1% DV; fat 3.7g 6% DV; cholesterol 0mg; sodium 2.4mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/", "name": "Shrimp Scampi with Pasta", "summary": "\nWell-rounded seafood and pasta dish. Good with any pasta; angel hair is less filling. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2606852.jpg", "meta": [["prep:", "20 mins"], ["cook:", "20 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package linguine pasta", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "2  shallots, finely diced", "2 cloves garlic, minced", "1 pinch red pepper flakes  (Optional)", "1 pound shrimp, peeled and deveined", "1 pinch kosher salt and freshly ground pepper", "½ cup dry white wine", "1  lemon, juiced", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "¼ cup finely chopped fresh parsley leaves", "1 teaspoon extra-virgin olive oil, or to taste"], "direction": ["Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.", "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.", "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve."], "facts": "511 calories; protein 21.9g 44% DV; carbohydrates 57.5g 19% DV; fat 19.4g 30% DV; cholesterol 135.4mg 45% DV; sodium 260mg 10% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/132358/easy-garlic-lemon-scallops/", "name": "Easy Garlic-Lemon Scallops", "summary": "\nScallops sauteed in butter and garlic will melt in your mouth. Lemon juice gives it a nice kick. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5916120.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["¾ cup butter", "3 tablespoons minced garlic", "2 pounds large sea scallops", "1 teaspoon salt", "⅛ teaspoon pepper", "2 tablespoons fresh lemon juice"], "direction": ["Melt butter in a large skillet over medium-high heat. Stir in garlic, and cook for a few seconds until fragrant. Add scallops, and cook for several minutes on one side, then turn over, and continue cooking until firm and opaque.", "Remove scallops to a platter, then whisk salt, pepper, and lemon juice into butter. Pour sauce over scallops to serve."], "facts": "408 calories; protein 38.5g 77% DV; carbohydrates 8.9g 3% DV; fat 24.4g 38% DV; cholesterol 152.4mg 51% DV; sodium 987.9mg 40% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/51283/maple-salmon/", "name": "Maple Salmon", "summary": "\nThis is the best and most delicious salmon recipe, and very easy to prepare. I love maple in everything and put this together one night. My husband totally loved it; he did not like salmon that much until he had this. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F862371.jpg", "meta": [["prep:", "10 mins"], ["cook:", "20 mins"], ["additional:", "30 mins"], ["total:", "1 hr"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["¼ cup maple syrup", "2 tablespoons soy sauce", "1 clove garlic, minced", "¼ teaspoon garlic salt", "⅛ teaspoon ground black pepper", "1 pound salmon"], "direction": ["In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.", "Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.", "Preheat oven to 400 degrees F (200 degrees C).", "Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."], "facts": "265 calories; protein 23.2g 46% DV; carbohydrates 14.1g 5% DV; fat 12.4g 19% DV; cholesterol 67mg 22% DV; sodium 633.1mg 25% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/", "name": "Homemade Four Cheese Ravioli", "summary": "\nGreat homemade Italian ravioli recipe that I have recreated to taste like the ravioli at Maggiano's restaurant. Don't be intimidated by the large list of ingredients, it is well worth it! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5943283.jpg", "meta": [["prep:", "45 mins"], ["cook:", "15 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "4"], ["Yield:", "20 ravioli"]], "ingredients": ["2 cups all-purpose flour", "1 pinch salt", "1 teaspoon olive oil", "2  eggs", "1 ½ tablespoons water"], "direction": ["Mound the flour and salt together on a work surface and form a well. Beat the teaspoon of olive oil, 2 eggs, and water in a bowl. Pour half the egg mixture into the well. Begin mixing the egg with the flour with one hand; use your other hand to keep the flour mound steady. Add the remaining egg mixture and knead to form a dough.", "Knead the dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form the dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour.", "While the dough is resting, prepare the ravioli filling. Combine the ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley and mix well. Set the filling aside.", "Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the crushed garlic and pesto sauce and cook for one minute. Pour in the heavy cream, raise the heat to high, and bring the sauce to a boil. Reduce the heat and simmer for 5 minutes. Add the Parmesan cheese and stir until the cheese melts. Remove the pan from the heat and keep warm.", "Meanwhile, in a separate saucepan, warm the marinara sauce over medium-low heat.", "Preheat an oven to 375 degrees F (190 degrees C). Beat the egg with the tablespoon of water to make the egg wash.", "Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop the filling mixture on the dough by teaspoonfuls about one inch apart. Cover the filling with the top sheet of pasta, pressing out the air from around each portion of filling. Press firmly around the filling to seal. Cut into individual ravioli with a knife or pizza cutter. Seal the edges.", "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well.", "Grease a baking sheet. Place the cooked ravioli on the sheet pan and bake in the preheated oven until brown, about 4 minutes.", "To serve the ravioli, divide them among four warmed serving bowls. Drizzle the marinara sauce over the ravioli and then top with the cream sauce."], "facts": "1270 calories; protein 37.8g 76% DV; carbohydrates 80.4g 26% DV; fat 89.2g 137% DV; cholesterol 406.5mg 136% DV; sodium 1358.9mg 54% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/12481/old-fashioned-coconut-cream-pie/", "name": "Old Fashioned Coconut Cream Pie", "summary": "\nThis is a tried-and-true, old-fashioned coconut cream pie. Took many years of searching and baking to find the right one and this is it! Enjoy! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4899464.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["additional:", "4 hrs"], ["total:", "4 hrs 50 mins"], ["Servings:", "8"], ["Yield:", "1 9-inch pie"]], "ingredients": ["1 cup sweetened flaked coconut", "3 cups half-and-half", "2  eggs, beaten", "¾ cup white sugar", "½ cup all-purpose flour", "¼ teaspoon salt", "1 teaspoon vanilla extract", "1 (9 inch) pie shell, baked", "1 cup frozen whipped topping, thawed"], "direction": ["Preheat oven to 350 degrees F (175 degrees C).", "Spread the coconut on a baking sheet and bake it, stirring occasionally, until golden brown, about 5 minutes.", "In a medium saucepan, combine the half-and-half, eggs, sugar, flour and salt and mix well. Bring to a boil over low heat, stirring constantly. Cook, stirring constantly, for 2 minutes more. Remove the pan from the heat, and stir in 3/4 cup of the toasted coconut and the vanilla extract. Reserve the remaining coconut to top the pie.", "Pour the filling into the pie shell and chill until firm, about 4 hours.", "Top with whipped topping and with the reserved coconut."], "facts": "423 calories; protein 6.8g 14% DV; carbohydrates 46.1g 15% DV; fat 23.5g 36% DV; cholesterol 80.1mg 27% DV; sodium 275.9mg 11% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/214488/lemon-chicken-piccata/", "name": "Lemon Chicken Piccata", "summary": "\nThis delicious chicken dish is exquisite and easy to prepare. The light and luscious lemon sauce really pops without being too acidic; it is simply divine. Serve it with herb-roasted potatoes or lemon-rice pilaf. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F450856.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3 large skinless, boneless chicken breast halves - cut into 1/2-inch medallions", "salt and pepper to taste", "½ cup all-purpose flour", "2 tablespoons vegetable oil, or as needed", "1 clove garlic, minced", "1 cup low sodium chicken broth", "½  lemon, thinly sliced", "¼ cup fresh lemon juice", "2 tablespoons capers, drained and rinsed", "3 tablespoons butter", "2 tablespoons minced Italian (flat-leaf) parsley"], "direction": ["Preheat oven to 200 degrees F (95 degrees C). Place a serving platter into the oven to warm.", "Season the chicken breast pieces with salt and pepper and dredge them in flour. Shake off excess flour. Heat the vegetable oil in a skillet; pan-fry the chicken pieces until golden brown on both sides, about 3 minutes per side. Work in batches and do not crowd skillet, adding oil as needed . Place the chicken pieces onto the warmed platter in the oven. When finished with all the chicken, drain most of the oil from the skillet, leaving a thin coating on the surface of the pan.", "Cook and stir the minced garlic in the skillet until fragrant, about 20 seconds. Pour in the chicken broth. Scrape and dissolve any brown bits from the bottom of the skillet. Stir in the lemon slices and bring the mixture to a boil. Let cook, stirring occasionally, until the sauce reduces to about 2/3 cup, 5 to 8 minutes. Add the lemon juice and capers; simmer until the sauce is reduced and slightly thickened, about 5 minutes more. Drop the butter into the skillet and swirl it into the sauce by tilting the skillet until the butter is melted and incorporated. Add the parsley; remove from heat and set aside.", "Arrange the chicken medallions on serving plates and spoon sauce over each portion to serve."], "facts": "421 calories; protein 41.1g 82% DV; carbohydrates 16.1g 5% DV; fat 21.2g 33% DV; cholesterol 127.6mg 43% DV; sodium 347.9mg 14% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/15869/cream-puffs/", "name": "Cream Puffs", "summary": "\nAn easy and impressive way to make a great dessert.  Whip them up and watch them disappear! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6206622.jpg", "meta": [["prep:", "30 mins"], ["cook:", "25 mins"], ["total:", "55 mins"], ["Servings:", "20"], ["Yield:", "20 to 25 cream puffs"]], "ingredients": ["2 (3.5 ounce) packages instant vanilla pudding mix", "2 cups heavy cream", "1 cup milk", "½ cup butter", "1 cup water", "¼ teaspoon salt", "1 cup all-purpose flour", "4  eggs"], "direction": ["Mix together vanilla instant pudding mix, cream and milk. Cover and refrigerate to set.", "Preheat oven to 425 degrees F (220 degrees C).", "In a large pot, bring water and butter to a rolling boil. Stir in flour and salt until the mixture forms a ball. Transfer the dough to a large mixing bowl. Using a wooden spoon or stand mixer, beat in the eggs one at a time, mixing well after each. Drop by tablespoonfuls onto an ungreased baking sheet.", "Bake for 20 to 25 minutes in the preheated oven,  until golden brown. Centers should be dry.", "When the shells are cool, either split and fill them with the pudding mixture, or use a pastry bag to pipe the pudding into the shells."], "facts": "190 calories; protein 2.9g 6% DV; carbohydrates 15.2g 5% DV; fat 13.3g 21% DV; cholesterol 76.9mg 26% DV; sodium 230.6mg 9% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/91192/french-onion-soup-gratinee/", "name": "French Onion Soup Gratinee", "summary": "\nAbout as good as it gets! This is the version of French Onion Soup that people seek when they go to restaurants. I have been making it for 30 years and it never fails to please. It makes an exquisite presentation, too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2088781.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4 tablespoons butter", "1 teaspoon salt", "2 large red onions, thinly sliced", "2 large sweet onions, thinly sliced", "1 (48 fluid ounce) can chicken broth", "1 (14 ounce) can beef broth", "½ cup red wine", "1 tablespoon Worcestershire sauce", "2 sprigs fresh parsley", "1 sprig fresh thyme leaves", "1  bay leaf", "1 tablespoon balsamic vinegar", "salt and freshly ground black pepper to taste", "4 thick slices French or Italian bread", "8 slices Gruyere or Swiss cheese slices, room temperature", "½ cup shredded Asiago or mozzarella cheese, room temperature", "4 pinches paprika"], "direction": ["Melt butter in a large pot over medium-high heat. Stir in salt, red onions and sweet onions. Cook 35 minutes, stirring frequently, until onions are caramelized and almost syrupy.", "Mix chicken broth, beef broth, red wine and Worcestershire sauce into pot. Bundle the parsley, thyme, and bay leaf with twine and place in pot.  Simmer over medium heat for 20 minutes, stirring occasionally. Remove and discard the herbs. Reduce the heat to low, mix in vinegar and season with salt and pepper. Cover and keep over low heat to stay hot while you prepare the bread.", "Preheat oven broiler. Arrange bread slices on a baking sheet and broil 3 minutes, turning once, until well toasted on both sides. Remove from heat; do not turn off broiler.", "Arrange 4 large oven safe bowls or crocks on a rimmed baking sheet. Fill each bowl 2/3 full with hot soup. Top each bowl with 1 slice toasted bread, 2 slice Gruyere cheese and 1/4 of the Asiago or mozzarella cheese. Sprinkle a little bit of paprika over the top of each one.", "Broil 5 minutes, or until bubbly and golden brown. As it softens, the cheese will cascade over the sides of the crock and form a beautifully melted crusty seal. Serve immediately!"], "facts": "618 calories; protein 29.7g 59% DV; carbohydrates 39.5g 13% DV; fat 35.9g 55% DV; cholesterol 113.9mg 38% DV; sodium 3335.7mg 133% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/257193/chef-johns-chocolate-souffle/", "name": "Chef John's Chocolate Souffle", "summary": "\nThese visually impressive individual chocolate soufflés are perfect for your special someone. If you're serving more people, the recipe should scale up just fine. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4479094.jpg", "meta": [["prep:", "15 mins"], ["cook:", "24 mins"], ["total:", "39 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1 teaspoon melted butter, or as needed", "2 tablespoons white sugar", "2 ounces 70% dark chocolate, broken into pieces", "1 tablespoon butter", "1 tablespoon all-purpose flour", "4 ⅓ tablespoons cold milk", "1 pinch salt", "1 pinch cayenne pepper", "1 large egg yolk", "2  large egg whites", "1 pinch cream of tartar", "1 tablespoon white sugar, divided"], "direction": ["Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper.", "Brush bottom and sides of 2 (5-ounce) ramekins lightly with 1 teaspoon melted butter; cover bottom and sides right up to the rim. Add 1 tablespoon white sugar to ramekins. Rotate ramekins until sugar coats all surfaces. Pour off extra sugar.", "Place chocolate pieces in a metal mixing bowl. Place bowl over a pan of about 3 cups hot water over low heat. Do not let water boil or come to a simmer.", "Melt 1 tablespoon butter in a skillet over medium heat. Sprinkle in flour. Whisk until flour is incorporated into butter and mixture thickens, about 1 minute. Reduce heat to low. Whisk in cold milk until mixture becomes smooth and thickens, 2 or 3 minutes. Remove skillet from heat. Transfer mixture to bowl with melted chocolate. Add salt and very small pinch of cayenne pepper. Mix together thoroughly. Add egg yolk and mix to combine. Leave bowl above the hot (not simmering) water to keep chocolate warm while you whip the egg whites.", "Place 2 egg whites in a mixing bowl; add cream of tartar. Whisk until mixture begins to thicken and a drizzle from the whisk stays on the surface about 1 second before disappearing into the mix, 2 or 3 minutes. Add 1/3 of sugar and whisk in. Whisk in a bit more sugar about 15 seconds; whisk in the rest of the sugar. Continue whisking until mixture is about as thick as shaving cream and holds soft peaks, 3 to 5 minutes.", "Transfer a little less than half of egg whites to chocolate. Mix until egg whites are thoroughly incorporated into the chocolate, 1 or 2 minutes. Add the rest of the egg whites; gently fold into the chocolate with a spatula, lifting from the bottom and folding over. Stop mixing after the egg white disappears. Divide mixture between 2 prepared ramekins. Place ramekins on prepared baking sheet.", "Bake in preheated oven until scuffles are puffed and have risen above the top of the rims, 12 to 15 minutes."], "facts": "356 calories; protein 7.4g 15% DV; carbohydrates 38.6g 13% DV; fat 19.5g 30% DV; cholesterol 124.3mg 41% DV; sodium 194mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/33647/chocolate-ganache/", "name": "Chocolate Ganache", "summary": "\nThis is a rich, dark chocolate topping or decoration that has lots of uses. It can be whipped as filling or icing, or just poured over whatever cake you like. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5472303.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["9 ounces bittersweet chocolate, chopped", "1 cup heavy cream", "1 tablespoon dark rum"], "direction": ["Place the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil, watching very carefully because if it boils for a few seconds, it will boil out of the pot. When the cream has come to a boil, pour over the chopped chocolate, and whisk until smooth. Stir in the rum if desired.", "Allow the ganache to cool slightly before pouring over a cake. Start at the center of the cake and work outward. For a fluffy frosting or chocolate filling, allow it to cool until thick, then whip with a whisk until light and fluffy."], "facts": "142 calories; protein 1.4g 3% DV; carbohydrates 9.4g 3% DV; fat 10.8g 17% DV; cholesterol 21.1mg 7% DV; sodium 6.5mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/20338/strawberry-pretzel-salad/", "name": "Strawberry Pretzel Salad", "summary": "\nIt is a dessert, but isn't too sweet, nor too salty. It is really pretty when you put it in a clear ovenproof dish. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4537072.jpg", "meta": [["prep:", "35 mins"], ["cook:", "10 mins"], ["total:", "45 mins"], ["Servings:", "12"], ["Yield:", "1 9x13 inch baking dish"]], "ingredients": ["2 cups crushed pretzels", "¾ cup butter, melted", "3 tablespoons white sugar", "1 (8 ounce) package cream cheese, softened", "1 cup white sugar", "1 (8 ounce) container frozen whipped topping, thawed", "2 (3 ounce) packages strawberry flavored Jell-O®", "2 cups boiling water", "2 (10 ounce) packages frozen strawberries"], "direction": ["Preheat oven to 400 degrees F (200 degrees C).", "Stir together crushed pretzels, melted butter and 3 tablespoons sugar; mix well and press mixture into the bottom of a 9x13 inch baking dish.", "Bake 8 to 10 minutes, until set.  Set aside to cool.", "In a large mixing bowl cream together cream cheese and 1 cup sugar.  Fold in whipped topping.  Spread mixture onto cooled crust.", "Dissolve gelatin in boiling water.  Stir in still frozen strawberries and allow to set briefly.  When mixture is about the consistency of egg whites, pour and spread over cream cheese layer.  Refrigerate until set."], "facts": "424 calories; protein 4.5g 9% DV; carbohydrates 52.1g 17% DV; fat 23.3g 36% DV; cholesterol 51mg 17% DV; sodium 441.7mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/127491/easy-oreo-truffles/", "name": "Easy OREO Truffles", "summary": "\nThese truffles are very easy and delicious. You can't go wrong with OREO, cream cheese and chocolate! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4513169.jpg", "meta": [["additional:", "1 hr 30 mins"], ["total:", "1 hr 30 mins"], ["Servings:", "42"], ["Yield:", "3 -1/2 dozen"]], "ingredients": ["1 (16 ounce) package OREO Chocolate Sandwich Cookies, divided", "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened", "2 (8 ounce) packages BAKER'S Semi-Sweet Baking Chocolate, melted"], "direction": ["Crush 9 of the cookies to fine crumbs in food processor; reserve for later use. (Cookies can also be finely crushed in a resealable plastic bag using a rolling pin.) Crush remaining 36 cookies to fine crumbs; place in medium bowl. Add cream cheese; mix until well blended. Roll cookie mixture into 42 balls, about 1-inch in diameter.", "Dip balls in chocolate; place on wax paper-covered baking sheet. (Any leftover chocolate can be stored at room temperature for another use.) Sprinkle with reserved cookie crumbs.", "Refrigerate until firm, about 1 hour. Store leftover truffles, covered, in refrigerator."], "facts": "None"}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/34746/baked-salmon-ii/", "name": "Baked Salmon II", "summary": "\nThis is a great recipe for beginners! This was my first time making fish and it was a hit. Even my 9 year old daughter who wouldn't dream of eating fish EVER had half of my portion! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F593567.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["additional:", "1 hr"], ["total:", "2 hrs"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["2 cloves garlic, minced", "6 tablespoons light olive oil", "1 teaspoon dried basil", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 tablespoon lemon juice", "1 tablespoon fresh parsley, chopped", "2 (6 ounce) fillets salmon"], "direction": ["In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley. Place salmon fillets in a medium glass baking dish, and cover with the marinade. Marinate in the refrigerator about 1 hour, turning occasionally.", "Preheat oven to 375  degrees F (190 degrees C).", "Place fillets in aluminum foil, cover with marinade, and seal. Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork."], "facts": "613 calories; protein 36.3g 73% DV; carbohydrates 2.9g 1% DV; fat 51.9g 80% DV; cholesterol 74.7mg 25% DV; sodium 1234.5mg 49% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/148889/sauteed-swiss-chard-with-parmesan-cheese/", "name": "Sauteed Swiss Chard with Parmesan Cheese", "summary": "\nLemon and Parmesan cheese season this simple, tasty recipe for Swiss chard on your stovetop! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F384364.jpg", "meta": [["prep:", "15 mins"], ["cook:", "10 mins"], ["total:", "25 mins"], ["Servings:", "4"], ["Yield:", "2 cups"]], "ingredients": ["2 tablespoons butter", "2 tablespoons olive oil", "1 tablespoon minced garlic", "½ small red onion, diced", "1 bunch Swiss chard, stems and center ribs cut out and chopped together, leaves coarsely chopped separately", "½ cup dry white wine", "1 tablespoon fresh lemon juice, or to taste", "2 tablespoons freshly grated Parmesan cheese", "1 pinch salt to taste"], "direction": ["Melt butter and olive oil together in a large skillet over medium-high heat. Stir in the garlic and onion, and cook for 30 seconds until fragrant. Add the chard stems and the white wine. Simmer until the stems begin to soften, about 5 minutes. Stir in the chard leaves, and cook until wilted. Finally, stir in lemon juice and Parmesan cheese; season to taste with salt if needed."], "facts": "165 calories; protein 2.3g 5% DV; carbohydrates 4.9g 2% DV; fat 13.4g 21% DV; cholesterol 17.5mg 6% DV; sodium 202.4mg 8% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/109297/cedar-planked-salmon/", "name": "Cedar Planked Salmon", "summary": "\nThis is a dish my brother prepared for me in Seattle. It is by far the best salmon I've ever eaten. I like to serve it with an Asian-inspired rice and roasted asparagus. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2609651.jpg", "meta": [["prep:", "15 mins"], ["cook:", "20 mins"], ["total:", "35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["3 (12 inch) untreated cedar planks", "⅓ cup vegetable oil", "1 ½ tablespoons rice vinegar", "1 teaspoon sesame oil", "⅓ cup soy sauce", "¼ cup chopped green onions", "1 tablespoon grated fresh ginger root", "1 teaspoon minced garlic", "2 (2 pound) salmon fillets, skin removed"], "direction": ["Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time.", "In a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour.", "Preheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little.", "Place the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill."], "facts": "678 calories; protein 61.3g 123% DV; carbohydrates 1.7g 1% DV; fat 45.8g 70% DV; cholesterol 178.6mg 60% DV; sodium 981.2mg 39% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/216757/savory-sea-scallops-and-angel-hair-pasta/", "name": "Savory Sea Scallops and Angel Hair Pasta", "summary": "\nThis is a very simple, easy to prepare meal that you will most likely be asked to prepare again. The taste, if carefully prepared and not overcooked, is incredible. ENJOY! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8248413.jpg", "meta": [["prep:", "25 mins"], ["cook:", "5 mins"], ["total:", "30 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 (16 ounce) package angel hair pasta", "¼ cup butter", "2 cloves garlic, minced", "2 pounds sea scallops, rinsed and patted dry", "3 tablespoons chopped fresh basil", "2 tablespoons chopped fresh flat-leaf parsley", "2 tablespoons fresh lemon juice", "salt and freshly ground black pepper to taste", "½ cup heavy cream", "1 tablespoon grated Parmesan cheese to taste"], "direction": ["Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.", "Melt butter in a skillet over medium heat. Stir in the garlic and cook just until fragrant and softened, about 1 minute. Slice any scallops over 3/4-inch thick in half so they'll cook evenly; stir scallops, basil, and parsley into the skillet. Cook and gently stir just until scallops feel slightly firm when pressed with a finger, 2 to 3 minutes. Scallops will become tough and chewy if overcooked. Stir in lemon juice, and season with salt and black pepper. Pour in cream if you like a thicker sauce. Bring the mixture just to a bare simmer.", "Serve over hot angel hair pasta; sprinkle to taste with Parmesan cheese."], "facts": "515 calories; protein 33.1g 66% DV; carbohydrates 46.3g 15% DV; fat 21.9g 34% DV; cholesterol 95.5mg 32% DV; sodium 527.8mg 21% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/16018/caramels/", "name": "Caramels", "summary": "\nI have used this recipe for almost 41 years, and have yet to have any bad batches. My grandson loves 'em! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F755536.jpg", "meta": [["Servings:", "60"], ["Yield:", "4 to 5 dozen caramels"]], "ingredients": ["2 cups white sugar", "1 cup packed brown sugar", "1 cup corn syrup", "1 cup evaporated milk", "1 pint heavy whipping cream", "1 cup butter", "1 ¼ teaspoons vanilla extract"], "direction": ["Grease a 12x15 inch pan.", "In a medium-size pot, combine sugar, brown sugar, corn syrup, evaporated milk, whipping cream, and butter. Monitor the heat of the mixture with a candy thermometer while stirring. When the thermometer reaches 250 degrees F (120 degrees C) remove the pot from the heat.", "Stir in vanilla. Transfer mixture to the prepared pan and let the mixture cool completely. When cooled cut the Carmel into small squares and wrap them in wax paper for storage."], "facts": "115 calories; protein 0.5g 1% DV; carbohydrates 14.8g 5% DV; fat 6.3g 10% DV; cholesterol 20.2mg 7% DV; sodium 30.4mg 1% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/231345/bacon-wrapped-venison-tenderloin-with-garlic-cream-sauce/", "name": "Bacon-Wrapped Venison Tenderloin with Garlic Cream Sauce", "summary": "\nThis recipe originated via other recipe suggestions for filet mignon. I made this recipe on my own to celebrate my hunter-husband's Valentine's! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8284558.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 thick slices bacon", "2 (3/4 pound) venison tenderloin roasts", "2 teaspoons olive oil, divided", "¼ teaspoon onion powder, divided", "kosher salt and ground black pepper to taste", "2 tablespoons butter", "1 (8 ounce) package sliced cremini mushrooms", "2 cloves garlic, chopped", "1 tablespoon chopped green onion, or more to taste", "½ cup heavy whipping cream, or more to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Place bacon on a slotted baking pan.", "Bake bacon in the preheated oven until partially cooked but still flexible, 6 to 8 minutes.", "Brush venison tenderloins with olive oil and season with onion powder, salt, and black pepper. Place tenderloin roasts side by side and wrap them together in strips of partially cooked bacon. Place into a roasting pan.", "Roast until bacon is browned and an instant-read meat thermometer inserted into the thickest part of a tenderloin reads at least 145 degrees F (65 degrees C), about 1 hour.", "Heat butter in a saucepan over medium heat; cook and stir mushrooms and garlic in hot butter until mushrooms are soft, 8 to 10 minutes. Stir green onion into mushroom mixture; pour in cream. Cook, stirring often, until sauce is heated through. Serve sauce with tenderloins."], "facts": "310 calories; protein 28.2g 56% DV; carbohydrates 2.4g 1% DV; fat 20.3g 31% DV; cholesterol 130.4mg 44% DV; sodium 443.3mg 18% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/19010/eclairs-ii/", "name": "Eclairs II", "summary": "\nMy family loves these eclairs and request them all the time. I usually make them as dessert whenever we have company coming, they are always a hit! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1530950.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "9"], ["Yield:", "9 eclairs"]], "ingredients": ["½ cup butter", "1 cup water", "1 cup all-purpose flour", "¼ teaspoon salt", "4  eggs", "1 (5 ounce) package instant vanilla pudding mix", "2 ½ cups cold milk", "1 cup heavy cream", "¼ cup confectioners' sugar", "1 teaspoon vanilla extract", "2 (1 ounce) squares semisweet chocolate", "2 tablespoons butter", "1 cup confectioners' sugar", "1 teaspoon vanilla extract", "3 tablespoons hot water"], "direction": ["Preheat oven to 450 degrees F (230 degrees C).  Grease a cookie sheet.", "In a medium saucepan, combine 1/2 cup butter and 1 cup water.  Bring to a boil, stirring until butter melts completely.  Reduce heat to low, and add flour and salt.  Stir vigorously until mixture leaves the sides of the pan and begins to form a stiff ball.  Remove from heat.  Add eggs, one at a time, beating well to incorporate completely after each addition.  With a spoon or a pastry bag fitted with a No. 10, or larger, tip, spoon or pipe dough onto cookie sheet in  1 1/2 x 4 inch strips.", "Bake 15 minutes in the preheated oven, then reduce heat to 325 degrees F (165 degrees C) and bake 20 minutes more, until hollow sounding when lightly tapped on the bottom.  Cool completely on a wire rack.", "For the filling, combine pudding mix and milk in medium bowl according to package directions.  In a separate bowl, beat the cream with an electric mixer until soft peaks form.  Beat in 1/4 cup confectioners' sugar and 1 teaspoon vanilla.  Fold whipped cream into pudding.  Cut tops off of cooled pastry shells with a sharp knife.  Fill shells with pudding mixture and replace tops.", "For the icing, melt the chocolate and 2 tablespoons butter in a medium saucepan over low heat.  Stir in 1 cup confectioners' sugar and 1 teaspoon vanilla.  Stir in hot water, one tablespoon  at a time, until icing is smooth and has reached desired consistency.  Remove from heat, cool slightly, and drizzle over filled eclairs.  Refrigerate until serving."], "facts": "476 calories; protein 7.6g 15% DV; carbohydrates 49.4g 16% DV; fat 28.4g 44% DV; cholesterol 157.8mg 53% DV; sodium 484.9mg 19% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/241308/fresh-raspberry-sauce/", "name": "Fresh Raspberry Sauce", "summary": "\nThis stuff is so beautiful and delicious, you and your Valentine may not even need the cake. This will absolutely work even if you use frozen raspberries, but nothing compares to the flavor of the sauce if you can somehow find and use fresh raspberries. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2063248.jpg", "meta": [["prep:", "5 mins"], ["cook:", "5 mins"], ["additional:", "45 mins"], ["total:", "55 mins"], ["Servings:", "12"], ["Yield:", "3 cups"]], "ingredients": ["1 ½ pounds fresh raspberries", "¼ cup white sugar", "1 tablespoon water, or as needed  (Optional)", "2 teaspoons lemon juice, or more to taste"], "direction": ["Combine raspberries, sugar, water, and lemon juice in a saucepan over medium heat; cook and stir until raspberries break down, sugar dissolves, and sauce is heated through, 3 to 7 minutes. Remove from heat and press sauce through a fine-mesh strainer to remove seeds. Cool to room temperature, cover the bowl with plastic wrap, and refrigerate until chilled, at least 45 minutes."], "facts": "44 calories; protein 0.5g 1% DV; carbohydrates 10.8g 4% DV; fat 0.3g 1% DV; cholesterol 0mg; sodium 0mg."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/8975/chicken-parmigiana/", "name": "Chicken Parmigiana", "summary": "\nThis is a very nice dinner for two. Serve it with your favorite pasta and tossed greens. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F10037.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  egg, beaten", "2 ounces dry bread crumbs", "2  skinless, boneless chicken breast halves", "¾ (16 ounce) jar spaghetti sauce", "2 ounces shredded mozzarella cheese", "¼ cup grated Parmesan cheese"], "direction": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.", "Pour egg into a small shallow bowl. Place bread crumbs in a separate shallow bowl. Dip chicken into egg, then into the bread crumbs. Place coated chicken on the prepared baking sheet and bake in the preheated oven for 40 minutes, or until no longer pink and juices run clear.", "Pour 1/2 of the spaghetti sauce into a 7x11 inch baking dish. Place chicken over sauce, and cover with remaining sauce. Sprinkle mozzarella and Parmesan cheeses on top and return to the preheated oven for 20 minutes."], "facts": "528 calories; protein 43.5g 87% DV; carbohydrates 44.9g 15% DV; fat 18.3g 28% DV; cholesterol 184.1mg 61% DV; sodium 1309.5mg 52% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/218179/my-favorite-beet-salad/", "name": "My Favorite Beet Salad", "summary": "\nFresh roasted beets over a bed of baby spinach with tomatoes, avocados, onions and feta cheese drizzled with a  balsamic dressing. You can cut this recipe in half for 4 servings, though it so good the next day too that I always make plenty. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672001.jpg", "meta": [["prep:", "30 mins"], ["cook:", "1 hr"], ["total:", "1 hr 30 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["6 large beets, trimmed", "¼ cup extra virgin olive oil", "salt and ground black pepper to taste", "1 (8 ounce) package baby spinach leaves", "2  tomatoes, cut into bite-sized pieces", "2  avocados - peeled, pitted, and cut into bite-sized pieces", "½  red onion, chopped, or to taste", "1 (4 ounce) container crumbled feta cheese", "½ cup balsamic vinegar", "½ cup extra-virgin olive oil", "1 tablespoon Dijon mustard, or more to taste"], "direction": ["Preheat oven to 375 degrees F (190 degrees C).", "Place the beets into a large bowl, and drizzle with 1/4 cup olive oil, salt, and black pepper. Lay out 2 large squares of aluminum foil on a work surface, and place 3 beets onto the center of each sheet. Fold the aluminum foil into 2 envelopes, sealing the beets into the packets; place the packets into a baking dish.", "Bake in the preheated oven until tender, 1 to 1 1/2 hours. Check for tenderness after 1 hour by piercing a beet with a fork. Open the foil, and allow the beets to cool until they can be handled; peel, and slice.", "Lay out the spinach leaves on an attractive oblong-shaped serving platter. Sprinkle pieces of tomato and avocado over the spinach leaves, and top with chopped red onion. Lay the sliced warm beets over the salad, and top with crumbled feta cheese.", "Whisk together balsamic vinegar, 1/2 cup of olive oil, and Dijon mustard until smooth; pour over the salad to serve."], "facts": "413 calories; protein 7.2g 14% DV; carbohydrates 28.2g 9% DV; fat 31.9g 49% DV; cholesterol 12.6mg 4% DV; sodium 400.3mg 16% DV."}, {"type": "By Holidays and Events  ", "package": "valentine_s_day_recipes", "link": "https://www.allrecipes.com/recipe/17205/eggs-benedict/", "name": "Eggs Benedict", "summary": "\nHot buttered English muffins, Canadian-style bacon, and poached eggs are topped with a heavenly drizzle of hollandaise sauce. Wonderful for Easter, Mother's Day, or anytime you want to treat yourself to the best brunch in the world! Serve with roasted potatoes for mopping up the extra egg yolk and hollandaise. If you prefer, you can substitute ham for the Canadian bacon in this recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F828993.jpg", "meta": [["prep:", "25 mins"], ["cook:", "5 mins"], ["total:", "30 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["4  egg yolks", "3 ½ tablespoons lemon juice", "1 pinch ground white pepper", "⅛ teaspoon Worcestershire sauce", "1 tablespoon water", "1 cup butter, melted", "¼ teaspoon salt", "8  eggs", "1 teaspoon distilled white vinegar", "8 strips Canadian-style bacon", "4  English muffins, split", "2 tablespoons butter, softened"], "direction": ["To Make Hollandaise: Fill the bottom of a double boiler part-way with water. Make sure that water does not touch the top pan. Bring water to a gentle simmer. In the top of the double boiler, whisk together egg yolks, lemon juice, white pepper, Worcestershire sauce, and 1 tablespoon water.", "Add the melted butter to egg yolk mixture 1 or 2 tablespoons at a time while whisking yolks constantly. If hollandaise begins to get too thick, add a teaspoon or two of hot water. Continue whisking until all butter is incorporated. Whisk in salt, then remove from heat. Place a lid on pan to keep sauce warm.", "Preheat oven on broiler setting. To Poach Eggs: Fill a large saucepan with 3 inches of water. Bring water to a gentle simmer, then add vinegar. Carefully break eggs into simmering water, and allow to cook for 2 1/2 to 3 minutes. Yolks should still be soft in center. Remove eggs from water with a slotted spoon and set on a warm plate", "While eggs are poaching, brown the bacon in a medium skillet over medium-high heat and toast the English muffins on a baking sheet under the broiler.", "Spread toasted muffins with softened butter, and top each one with a slice of bacon, followed by one poached egg. Place 2 muffins on each plate and drizzle with hollandaise sauce. Sprinkle with chopped chives and serve immediately."], "facts": "879 calories; protein 31.8g 64% DV; carbohydrates 29.6g 10% DV; fat 71.1g 109% DV; cholesterol 742.1mg 247% DV; sodium 1719.3mg 69% DV."}]