[{"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263728/vegan-mug-cake-with-pineapple-and-mint/", "name": "Vegan Mug Cake with Pineapple and Mint", "summary": "\nMost mug cakes are made with chocolate - this tropical vegan mug cake version is made with fresh pineapple, banana, coconut cream, and mint. No chocolate in sight! Just the way I like it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5307195.jpg", "meta": [["prep:", "5 mins"], ["cook:", "3 mins"], ["additional:", "5 mins"], ["total:", "13 mins"], ["Servings:", "2"], ["Yield:", "2 mug cakes"]], "ingredients": ["2 slices fresh pineapple", "1  ripe banana", "2 tablespoons cream of coconut", "1 tablespoon rolled oats", "1 tablespoon quick-cooking oats", "¼ teaspoon baking powder", "3 leaves fresh mint", "1 teaspoon chia seeds", "1 teaspoon poppy seeds"], "direction": ["Combine pineapple, banana, cream of coconut, rolled oats, quick-cooking oats, baking powder, mint, chia seeds, and poppy seeds in a blender; blend until smooth. Pour into 2 mugs.", "Microwave at the highest setting until mug cakes have set and risen well, about 3 minutes. Allow to cool a few minutes before serving."], "facts": "196 calories; protein 2.4g 5% DV; carbohydrates 39.1g 13% DV; fat 4.7g 7% DV; cholesterol 0mg; sodium 70.1mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/256021/ultimate-tofu-breakfast-burrito-bowls/", "name": "Ultimate Tofu Breakfast Burrito Bowls", "summary": "\nTofu scrambles up just like eggs, and with some clever spices, even non-vegans will barely notice the difference. Try setting out toppings to let family or guests assemble their own burrito bowls. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4306820.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "3"], ["Yield:", "3 servings"]], "ingredients": ["3 tablespoons olive oil, divided", "1 (14 ounce) package extra-firm tofu, drained", "½ teaspoon salt", "black pepper to taste", "1 ½ teaspoons onion powder", "1 ½ teaspoons garlic powder", "½ teaspoon ground turmeric", "1 tablespoon fresh lemon juice", "1 tablespoon olive oil", "1 cup finely diced red onion", "2  jalapeno peppers, seeded and chopped", "½ teaspoon salt", "3 cloves garlic, minced", "2 cups chopped tomatoes", "1 ½ teaspoons cumin", "¼ cup chopped fresh cilantro", "1 tablespoon fresh lemon juice", "1 (15.5 ounce) can no-salt-added black beans, drained and rinsed", "1 ½ cups cooked hash brown potatoes", "1  avocado - peeled, pitted and sliced", "1 teaspoon fresh lemon juice", "¼ cup chopped fresh cilantro", "1 teaspoon hot sauce, or to taste"], "direction": ["Preheat a large, heavy skillet over medium-high heat. Add 2 tablespoons oil. Break tofu apart over skillet into bite-size pieces, sprinkle with salt and pepper, then cook, stirring frequently with a thin metal spatula, until liquid cooks out and tofu browns, about 10 minutes. (If you notice liquid collecting in pan, increase heat to evaporate water.) Be sure to get under the tofu when you stir, scraping the bottom of the pan where the good, crispy stuff is and keeping it from sticking.", "Add onion and garlic powders, turmeric, juice, and remaining tablespoon oil and toss to coat. Cook 5 minutes more.", "Preheat a heavy-bottomed saucepan over medium-high heat. Add oil. Cook onion and jalapenos with a pinch of salt, stirring, until translucent, about 5 minutes, Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes, cumin, and remaining salt, and cook, stirring, until tomatoes become saucy, about 5 minutes. Add cilantro and lemon juice. Let cilantro wilt in. Add beans and heat through, stirring occasionally, about 2 minutes. Taste for salt and seasoning.", "Spoon some hash browns into each bowl, followed by a scoop of beans and a scoop of scramble. Top with avocado, a squeeze of fresh lemon juice, and a sprinkle of cilantro. Serve with hot sauce."], "facts": "579 calories; protein 22g 44% DV; carbohydrates 57.2g 18% DV; fat 39.6g 61% DV; cholesterol 0mg; sodium 1170.5mg 47% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263743/vegan-zucchini-noodles-with-chickpeas-and-zucchini-blossoms/", "name": "Vegan Zucchini Noodles with Chickpeas and Zucchini Blossoms", "summary": "\nThis is a quick and nutritious vegan main. You can leave out the zucchini blossoms since they are only in season for a short while, but if you can find them, make sure to use them! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5310531.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["4 tablespoons olive oil", "2 cloves garlic, minced", "2 medium zucchini, cut into noodles with a spiralizer", "12  zucchini blossoms, pistils removed, cut into strips", "½ cup canned chickpeas, drained and rinsed", "salt", "6  fresh basil leaves, cut into strips, or to taste"], "direction": ["Heat olive oil in a large skillet over low heat and cook garlic until softened, about 10 minutes. Add zucchini and zucchini blossoms; mix well with olive oil. Add chickpeas and stir to combine. Season with salt and stir in basil. Serve immediately."], "facts": "348 calories; protein 5.7g 11% DV; carbohydrates 21.6g 7% DV; fat 28.1g 43% DV; cholesterol 0mg; sodium 278.2mg 11% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263706/rice-paper-fake-bacon/", "name": "Rice Paper Fake Bacon", "summary": "\nSome fake bacons are hit-and-miss, but because bacon is the one thing most people miss when switching to a vegetarian or vegan way of life, it's expected a fitting alternative is created. This recipe not only offers a completely meat-free bacon, but one that is low in fat and calories. To mimic the intoxicating aroma that we have come to love in the real thing, we used a combination of liquid smoke and paprika to achieve similar results cleverly using rice paper. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5529675.jpg", "meta": [["prep:", "15 mins"], ["cook:", "6 mins"], ["total:", "21 mins"], ["Servings:", "24"], ["Yield:", "24 pieces"]], "ingredients": ["2 tablespoons sesame oil", "2 tablespoons reduced-sodium soy sauce", "2 teaspoons maple syrup", "1 ½ teaspoons miso paste", "1 teaspoon liquid smoke flavoring", "½ teaspoon ground paprika", "½ teaspoon ground black pepper", "2  sheets rice paper"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "Whisk sesame oil, soy sauce, maple syrup, miso, liquid smoke, paprika, and black pepper together in a shallow bowl.", "Stack 2 pieces of rice paper and soak them in a bowl of cold water until slightly soft and pliable, about 30 seconds. Cut the hydrated rice paper into strips using a pizza cutter. Dip each strip in the soy mixture and place on a sheet of parchment paper. Carefully lay the parchment paper directly on the oven rack.", "Bake in the preheated oven until strips are dry, 6 to 8 minutes."], "facts": "16 calories; protein 0.2g; carbohydrates 1g; fat 1.4g 2% DV; cholesterol 0mg; sodium 57.8mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263635/steamed-vegan-rice-cakes-banh-bo-hap/", "name": "Steamed Vegan Rice Cakes (Banh Bo Hap)", "summary": "\nEasy recipe for steamed rice cake, banh bo hap, a spongy, sweet, and gorgeous-looking vegan dessert. It costs next to nothing to make and fun for the kids. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4576234.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 25 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 cups rice flour", "2 cups lukewarm water", "1 (14 ounce) can coconut milk", "1 cup white sugar", "4 teaspoons tapioca starch", "1 ½ teaspoons active dry yeast", "½ teaspoon vanilla extract", "¼ teaspoon salt", "2 teaspoons oil, or as needed"], "direction": ["Whisk rice flour, water, coconut milk, sugar, tapioca starch, yeast, vanilla extract, and salt together in a bowl until smooth. Cover with a lid. Let batter rest until air bubbles rise to the surface, about 2 hours. Stir well.", "Grease cake molds with oil. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Place cake molds on top and pour batter into each, leaving 1 3/4 inches of space at the top for rising. Bring water to a boil. Cover and steam until a toothpick inserted into a cake comes out clean, about 10 minutes."], "facts": "334 calories; protein 4g 8% DV; carbohydrates 60.8g 20% DV; fat 8.5g 13% DV; cholesterol 0mg; sodium 54.2mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/232210/couscous-with-olives-and-sun-dried-tomato/", "name": "Couscous with Olives and Sun-Dried Tomato", "summary": "\nA delicate, flavorful dish that will satisfy vegans and carnivores alike! Inspired by my family's deep Coptic Orthodox Christian tradition, this is a great meal alternative during strict fasting times. It contains no animal products or fats, but has enough flavor and visual impact to make you feel like you're not sacrificing a thing! I hope you will enjoy this recipe. Add chicken or prawns to make this vegan dish a carnivorous delight! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1011586.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ¼ cups vegetable broth", "1 ¼ cups water", "2 cups pearl (Israeli) couscous", "1 pinch salt", "1 pinch ground black pepper", "5 tablespoons olive oil, divided", "½ cup pine nuts", "4 cloves garlic, minced", "1  shallot, minced", "½ cup sliced black olives", "⅓ cup sun-dried tomatoes packed in oil, drained and chopped", "1 cup vegetable broth", "¼ cup chopped fresh flat-leaf parsley"], "direction": ["Bring 1 1/4 cup vegetable broth and water to a boil in a saucepan, stir in couscous, and mix in salt and black pepper. Reduce heat to low and simmer until liquid is absorbed, about 8 minutes.", "Heat 3 tablespoons olive oil in a skillet over medium-high heat; stir in pine nuts and cook, stirring frequently, until pine nuts smell toasted and are golden brown, about 1 minute. Remove from heat.", "Heat remaining 2 tablespoons olive oil in a saucepan; cook and stir garlic and shallot in the hot oil until softened, about 2 minutes. Stir black olives and sun-dried tomatoes into garlic mixture and cook until heated through, 2 to 3 minutes, stirring often. Slowly pour in 1 cup vegetable broth and bring mixture to a boil. Reduce heat to low and simmer until sauce has reduced, 8 to 10 minutes.", "Transfer couscous to a large serving bowl, mix with sauce, and serve topped with parsley and pine nuts."], "facts": "528 calories; protein 13g 26% DV; carbohydrates 55.5g 18% DV; fat 29.3g 45% DV; cholesterol 0mg; sodium 455.1mg 18% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263458/vegan-tomato-soup/", "name": "Vegan Tomato Soup", "summary": "\nI don't peel the tomatoes because there are lots of vitamins and fiber in the skin. If you puree the soup well, you won't taste them. I use half cherry tomatoes, half regular tomatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5261486.jpg", "meta": [["prep:", "10 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1  onion, chopped", "4 cloves garlic, minced", "4  tomatoes, chopped", "3 ½ cups cherry tomatoes, halved", "¾ cup vegetable broth", "2  bay leaves", "2 sprigs fresh basil, divided"], "direction": ["Heat olive oil in a pot over low heat and cook onion until soft and translucent. Add garlic and cook until fragrant, about 1 minute. Increase heat to medium, add all tomatoes, and cook until they start to break down, about 5 minutes. Stir occasionally. Add vegetable broth, bay leaves, and 1 sprig of basil. Bring to a boil, reduce heat, and simmer until tomatoes have broken down and soup starts to thicken, about 30 minutes.", "Remove soup from heat and cool slightly. Remove bay leaves and basil.", "Puree tomato soup with an immersion blender until smooth. Reheat soup before serving and garnish with basil leaves."], "facts": "140 calories; protein 3.2g 6% DV; carbohydrates 17.5g 6% DV; fat 7.6g 12% DV; cholesterol 0mg; sodium 69.6mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/256014/chai-spice-cheesecake/", "name": "Chai Spice \"Cheesecake\"", "summary": "\nCashews, non-dairy milk, and silken tofu are the secret ingredients in this rich, vegan cheesecake--homey spices like ginger and cinnamon add fall flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4106926.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["additional:", "4 hrs 45 mins"], ["total:", "6 hrs"], ["Servings:", "8"], ["Yield:", "1 (9-inch) cheesecake"]], "ingredients": ["1 ½ cups crushed vegan graham crackers", "¼ cup packed brown sugar", "3 tablespoons coconut oil, melted", "2 tablespoons non-dairy milk (such as rice, soy, or almond)"], "direction": ["Preheat oven to 350 degrees F. Lightly spray a 9-inch springform pan with cooking spray. Stir together graham crackers and brown sugar in a small bowl, then drizzle with oil and stir. Add just enough milk to make crumbs stick together. Press very firmly into bottom of pan. Bake 10 minutes. Keep oven at 350 degrees F.", "Meanwhile, blend cheesecake-batter ingredients in a blender until completely smooth and no bits of cashew remain, giving blender a rest every minute or so and scraping down sides with a rubber spatula. Batter should be completely smooth and not grainy: This takes about 1 minute with a high-powered blender (such as Vitamix) or about 5 minutes with a standard blender.", "Spray inside springform pan (above baked crust) with cooking spray. Pour in batter and jiggle to spread evenly over crust. Bake until top is lightly puffed and edges are golden, 45 to 50 minutes.", "Cool to room temperature on a rack, about 1 hour. Chill, covered, at least 3 hours or, even better, overnight.", "Slice cake with a thin, sharp knife dipped in water. Dollop each slice with whipped topping, dust with cinnamon, and sprinkle with candied ginger."], "facts": "403 calories; protein 6.1g 12% DV; carbohydrates 54.4g 18% DV; fat 20.2g 31% DV; cholesterol 0mg; sodium 230mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14231/guacamole/", "name": "Guacamole", "summary": "\nYou can make this avocado salad smooth or chunky depending on your tastes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521556.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3  avocados - peeled, pitted, and mashed", "1  lime, juiced", "1 teaspoon salt", "½ cup diced onion", "3 tablespoons chopped fresh cilantro", "2  roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper  (Optional)"], "direction": ["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."], "facts": "262 calories; protein 3.7g 7% DV; carbohydrates 18g 6% DV; fat 22.2g 34% DV; cholesterol 0mg; sodium 595.7mg 24% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/99211/perfect-sushi-rice/", "name": "Perfect Sushi Rice", "summary": "\nHere is my recipe for the perfect sushi rice. You can eat this alone or roll into your favorite sushi roll with ingredients of choice. I use strips of carrots, cucumbers and slices of avocado. You can adjust the amount of vinegar in this recipe to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5646437.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "15"], ["Yield:", "5 cups"]], "ingredients": ["2 cups uncooked glutinous white rice (sushi rice)", "3 cups water", "½ cup rice vinegar", "1 tablespoon vegetable oil", "¼ cup white sugar", "1 teaspoon salt"], "direction": ["Rinse the rice in a strainer or colander until the water runs clear. Combine with water in a medium saucepan. Bring to a boil, then reduce the heat to low, cover and cook for 20 minutes. Rice should be tender and water should be absorbed. Cool until cool enough to handle.", "In a small saucepan, combine the rice vinegar, oil, sugar and salt. Cook over medium heat until the sugar dissolves. Cool, then stir into the cooked rice. When you pour this in to the rice it will seem very wet. Keep stirring and the rice will dry as it cools."], "facts": "112 calories; protein 1.7g 3% DV; carbohydrates 23.5g 8% DV; fat 1g 2% DV; cholesterol 0mg; sodium 158.2mg 6% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/13839/spiced-pumpkin-seeds/", "name": "Spiced Pumpkin Seeds", "summary": "\nThese pumpkin seeds make a great tasting and healthy snack. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4569239.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "2 cups"]], "ingredients": ["1 ½ tablespoons margarine, melted", "½ teaspoon salt", "⅛ teaspoon garlic salt", "2 teaspoons Worcestershire sauce", "2 cups raw whole pumpkin seeds"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Combine the margarine, salt, garlic salt, Worcestershire sauce and pumpkin seeds. Mix thoroughly and place in shallow baking dish.", "Bake for 1 hour, stirring occasionally."], "facts": "90 calories; protein 3g 6% DV; carbohydrates 8.9g 3% DV; fat 5.1g 8% DV; cholesterol 0mg; sodium 213.7mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/21134/candied-apples-ii/", "name": "Candied Apples II", "summary": "\nApples with a hard candy coating, like you can get at fairs. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F280191.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "15"], ["Yield:", "15 candied apples"]], "ingredients": ["15  apples", "2 cups white sugar", "1 cup light corn syrup", "1 ½ cups water", "8 drops red food coloring"], "direction": ["Lightly grease cookie sheets.  Insert craft sticks into whole, stemmed apples.", "In a medium saucepan over medium-high heat, combine sugar, corn syrup and water.  Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.  Remove from heat and stir in food coloring.", "Holding apple by its stick, dip in syrup and remove and turn to coat evenly.  Place on prepared sheets to harden."], "facts": "237 calories; protein 0.4g 1% DV; carbohydrates 62.5g 20% DV; fat 0.2g; cholesterol 0mg; sodium 15mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/132785/vegetarian-kale-soup/", "name": "Vegetarian Kale Soup", "summary": "\nThis wonderful soup will warm your insides, delight your taste buds, and fill your stomach on a cold winter's night. It is full of dark green kale, potatoes, and cannellini beans. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1124623.jpg", "meta": [["prep:", "25 mins"], ["cook:", "30 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons olive oil", "1  yellow onion, chopped", "2 tablespoons chopped garlic", "1 bunch kale, stems removed and leaves chopped", "8 cups water", "6 cubes  vegetable bouillon (such as Knorr)", "1 (15 ounce) can diced tomatoes", "6  white potatoes, peeled and cubed", "2 (15 ounce) cans cannellini beans (drained if desired)", "1 tablespoon Italian seasoning", "2 tablespoons dried parsley", "salt and pepper to taste"], "direction": ["Heat the olive oil in a large soup pot; cook the onion and garlic until soft.  Stir in the kale and cook until wilted, about 2 minutes. Stir in the water, vegetable bouillon, tomatoes, potatoes, beans, Italian seasoning, and parsley.  Simmer soup on medium heat for 25 minutes, or until potatoes are cooked through.  Season with salt and pepper to taste."], "facts": "277 calories; protein 9.6g 19% DV; carbohydrates 50.9g 16% DV; fat 4.5g 7% DV; cholesterol 0mg; sodium 372.2mg 15% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/68436/vegan-brownies/", "name": "Vegan Brownies", "summary": "\nMMMMM...Vegan Brownies!!!!  These are very gooey, which is a good thing in my book. However, if you want your brownies a little more solid you'll need to cook them longer than the recommended time. Great for people with egg or dairy allergies too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3927903.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["additional:", "10 mins"], ["total:", "50 mins"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["2 cups unbleached all-purpose flour", "2 cups white sugar", "¾ cup unsweetened cocoa powder", "1 teaspoon baking powder", "1 teaspoon salt", "1 cup water", "1 cup vegetable oil", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "In a large bowl, stir together the flour, sugar, cocoa powder, baking powder and salt. Pour in water, vegetable oil and vanilla; mix until well blended. Spread evenly in a 9x13 inch baking pan.", "Bake for 25 to 30 minutes in the preheated oven, until the top is no longer shiny. Let cool for at least 10 minutes before cutting into squares."], "facts": "284 calories; protein 2.4g 5% DV; carbohydrates 39.2g 13% DV; fat 14.3g 22% DV; cholesterol 0mg; sodium 169.4mg 7% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14021/grandmas-slow-cooker-vegetarian-chili/", "name": "Grandma's Slow Cooker Vegetarian Chili", "summary": "\nThis is a simple crowd pleasing recipe that can sit in a slow cooker until it is time to serve. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F804518.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (19 ounce) can black bean soup", "1 (15 ounce) can kidney beans, rinsed and drained", "1 (15 ounce) can garbanzo beans, rinsed and drained", "1 (16 ounce) can vegetarian baked beans", "1 (14.5 ounce) can chopped tomatoes in puree", "1 (15 ounce) can whole kernel corn, drained", "1  onion, chopped", "1  green bell pepper, chopped", "2 stalks celery, chopped", "2 cloves garlic, chopped", "1 tablespoon chili powder, or to taste", "1 tablespoon dried parsley", "1 tablespoon dried oregano", "1 tablespoon dried basil"], "direction": ["In a slow cooker, combine black bean soup, kidney beans, garbanzo beans, baked beans, tomatoes, corn, onion, bell pepper and celery. Season with garlic, chili powder, parsley, oregano and basil. Cook for at least two hours on High."], "facts": "260 calories; protein 12.4g 25% DV; carbohydrates 52.6g 17% DV; fat 2g 3% DV; cholesterol 0.8mg; sodium 965.9mg 39% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/137650/greek-lentil-soup-fakes/", "name": "Greek Lentil Soup (Fakes)", "summary": "\nFakes (pronounced 'Fah-kehs') is a staple in the Greek kitchen, and an especially filling meal. It is traditionally served with a drizzle of olive oil and lots of vinegar. Though the vinegar is of course optional, try it. It lifts the lentils and adds another dimension of flavor! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6275622.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["total:", "1 hr 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces brown lentils", "¼ cup olive oil", "1 tablespoon minced garlic", "1  onion, minced", "1 large carrot, chopped", "1 quart water", "1 pinch dried oregano", "1 pinch crushed dried rosemary", "2  bay leaves", "1 tablespoon tomato paste", "salt and ground black pepper to taste", "1 teaspoon olive oil, or to taste", "1 teaspoon red wine vinegar, or to taste  (Optional)"], "direction": ["Place lentils in a large saucepan; add enough water to cover by 1 inch. Bring water to a boil and cook until tender, about 10 minutes; drain.", "Heat olive oil in a saucepan over medium heat. Add garlic, onion, and carrot; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in lentils, 1 quart water, oregano, rosemary, and bay leaves. Bring to a boil. Reduce heat to medium-low, cover, and simmer for 10 minutes.", "Stir in tomato paste and season with salt and pepper. Cover and simmer until the lentils have softened, 30 to 40 minutes, stirring occasionally. Add additional water if the soup becomes too thick. Drizzle with 1 teaspoon olive oil and red wine vinegar to taste."], "facts": "357 calories; protein 15.5g 31% DV; carbohydrates 40.3g 13% DV; fat 15.5g 24% DV; cholesterol 0mg; sodium 56.9mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/11771/easy-pizza-sauce-i/", "name": "Easy Pizza Sauce I", "summary": "\nA simple pizza sauce used by many pizzerias. The thickness of the sauce is regulated by the amount of water used; it should be somewhat viscous. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4067127.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 large pizza"]], "ingredients": ["1 (6 ounce) can tomato paste", "1 ½ cups water", "⅓ cup extra virgin olive oil", "2 cloves garlic, minced", "salt to taste", "ground black pepper to taste", "½ tablespoon dried oregano", "½ tablespoon dried basil", "½ teaspoon dried rosemary, crushed"], "direction": ["Mix together the tomato paste, water, and olive oil. Mix well. Add garlic, salt and pepper to taste, oregano, basil, and rosemary. Mix well and let stand several hours to let flavors blend. No cooking necessary, just spread on dough."], "facts": "104 calories; protein 1g 2% DV; carbohydrates 4.7g 2% DV; fat 9.5g 15% DV; cholesterol 0mg; sodium 169.5mg 7% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/72508/the-best-vegetarian-chili-in-the-world/", "name": "The Best Vegetarian Chili in the World", "summary": "\nBreak out your soup pot and fix up a batch of this delicious, spicy vegetarian chili today! It's ready in no time, and packed with vegetables, beans - and flavor! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565674.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon olive oil", "½ medium onion, chopped", "2  bay leaves", "1 teaspoon ground cumin", "2 tablespoons dried oregano", "1 tablespoon salt", "2 stalks celery, chopped", "2  green bell peppers, chopped", "2  jalapeno peppers, chopped", "3 cloves garlic, chopped", "2 (4 ounce) cans chopped green chile peppers, drained", "2 (12 ounce) packages vegetarian burger crumbles", "3 (28 ounce) cans whole peeled tomatoes, crushed", "¼ cup chili powder", "1 tablespoon ground black pepper", "1 (15 ounce) can kidney beans, drained", "1 (15 ounce) can garbanzo beans, drained", "1 (15 ounce) can black beans", "1 (15 ounce) can whole kernel corn"], "direction": ["Heat the olive oil in a large pot over medium heat. Stir in the onion, and season with bay leaves, cumin, oregano, and salt. Cook and stir until onion is tender, then mix in the celery, green bell peppers, jalapeno peppers, garlic, and green chile peppers. When vegetables are heated through, mix in the vegetarian burger crumbles. Reduce heat to low, cover pot, and simmer 5 minutes.", "Mix the tomatoes into the pot. Season chili with chili powder and pepper. Stir in the kidney beans, garbanzo beans, and black beans. Bring to a boil, reduce heat to low, and simmer 45 minutes. Stir in the corn, and continue cooking 5 minutes before serving."], "facts": "391 calories; protein 28.2g 56% DV; carbohydrates 58.7g 19% DV; fat 7.9g 12% DV; cholesterol 0mg; sodium 2571.2mg 103% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/216950/roasted-cauliflower-soup/", "name": "Roasted Cauliflower Soup", "summary": "\nThis is simple and delicious. The taste is so smooth and creamy most people think this is a fattening soup loaded with cream and potatoes. People are always shocked by how few ingredients are needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012540.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads   cauliflower, broken into florets", "olive oil cooking spray", "¼ cup olive oil", "1 large onion, chopped", "4 cloves garlic, chopped", "6 cups water", "salt and ground black pepper to taste"], "direction": ["Place the cauliflower florets into a large bowl of lightly salted water; allow to stand for 20 minutes. Drain well, and arrange on a sheet of heavy aluminum foil on a baking sheet. Spray the olive oil cooking spray evenly on the cauliflower.", "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.", "Broil the cauliflower until browned, 20 to 30 minutes.", "Meanwhile, heat olive oil in a large soup pot, and cook the onion until translucent, about 5 minutes; stir in the garlic and roasted cauliflower. Pour in the water, season with salt and black pepper, and simmer until all the vegetables are tender, about 30 minutes. Blend the soup in the pot with an immersion hand blender until creamy and smooth."], "facts": "141 calories; protein 4.2g 8% DV; carbohydrates 13.2g 4% DV; fat 9.2g 14% DV; cholesterol 0mg; sodium 92.6mg 4% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14064/easy-guacamole/", "name": "Easy Guacamole", "summary": "\nSimply a quick recipe for tasty guacamole! Great with tortilla chips or as a topping for Mexican foods! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1488197.jpg", "meta": [["prep:", "10 mins"], ["additional:", "30 mins"], ["total:", "40 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["2  avocados", "1 small onion, finely chopped", "1 clove garlic, minced", "1  ripe tomato, chopped", "1  lime, juiced", "salt and pepper to taste"], "direction": ["Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper.  Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors."], "facts": "45 calories; protein 0.7g 1% DV; carbohydrates 3.4g 1% DV; fat 3.7g 6% DV; cholesterol 0mg; sodium 2.4mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/19584/green-tomato-relish/", "name": "Green Tomato Relish", "summary": "\nThis delicious, tangy relish of green tomatoes, onions, bell peppers, and spices,  is perfect with sandwiches, potatoes, cheese, and lots of other entrees. A jar of this makes a great gift, too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4554361.jpg", "meta": [["prep:", "1 hr 15 mins"], ["cook:", "45 mins"], ["total:", "2 hrs"], ["Servings:", "192"], ["Yield:", "12 pints"]], "ingredients": ["24 large green tomatoes", "3  red bell peppers, halved and seeded", "3  green bell peppers, halved and seeded", "12 large onions", "3 tablespoons celery seed", "3 tablespoons mustard seed", "1 tablespoon salt", "5 cups white sugar", "2 cups cider vinegar"], "direction": ["In a grinder or food processor, coarsely grind tomatoes, red bell peppers, green bell peppers, and onions. (You may need to do this in batches.) Line a large colander with cheesecloth, place in sink or in a large bowl, and pour in tomato mixture to drain for 1 hour.", "In a large, non-aluminum stockpot, combine tomato mixture, celery seed, mustard seed, salt, sugar, and vinegar. Bring to a boil and simmer over low heat 5 minutes, stirring frequently.", "Sterilize enough jars and lids to hold relish (12 one-pint jars, or 6 one-quart jars). Pack relish into sterilized jars, making sure there are no spaces or air pockets. Fill jars all the way to top. Screw on lids.", "Place a rack in the bottom of a large stockpot and fill halfway with boiling water. Carefully lower jars into pot using a holder. Leave a 2 inch space between jars. Pour in more boiling water if necessary, until tops of jars are covered by 2 inches of water. Bring water to a full boil, then cover and process for 30 minutes.", "Remove jars from pot and place on cloth-covered or wood surface, several inches apart, until cool. Once cool, press top of each lid with finger, ensuring that seal is tight (lid does not move up or down at all). Relish can be stored for up to a year."], "facts": "32 calories; protein 0.5g 1% DV; carbohydrates 7.6g 2% DV; fat 0.1g; cholesterol 0mg; sodium 40.1mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/24700/churros/", "name": "Churros", "summary": "\nThese Mexican fritters are very common at fairs. In my border hometown, the line at this stand is always overwhelming. People wait hours in line just to get a taste of these churros. I have run across several recipes but this is the best one by far. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup water", "2 ½ tablespoons white sugar", "½ teaspoon salt", "2 tablespoons vegetable oil", "1 cup all-purpose flour", "2 quarts oil for frying", "½ cup white sugar, or to taste", "1 teaspoon ground cinnamon"], "direction": ["In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball.", "Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels.", "Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."], "facts": "691 calories; protein 3.3g 7% DV; carbohydrates 57.1g 18% DV; fat 51.1g 79% DV; cholesterol 0mg; sodium 293.1mg 12% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/220642/quick-and-easy-refried-beans/", "name": "Quick and Easy Refried Beans", "summary": "\nWhen you don't have all day to make refried beans and you can't stand the canned ones, these are easy and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1010236.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons canola oil", "2  garlic cloves, peeled", "2 (15 ounce) cans pinto beans", "1 teaspoon cumin", "1 teaspoon chili powder", "salt to taste", "½  lime, juiced"], "direction": ["Heat canola oil in a heavy skillet over medium heat.", "Cook garlic cloves in hot oil, turning once, until brown on both sides, 4 to 5 minutes.", "Smash garlic cloves in skillet with a fork.", "Stir pinto beans, cumin, chili powder, and salt into mashed garlic and cook until beans are thoroughly heated, about 5 minutes. Stir occasionally.", "Smash bean mixture with a potato masher to desired texture. Squeeze lime juice over smashed beans and stir until combined."], "facts": "132 calories; protein 5g 10% DV; carbohydrates 16.1g 5% DV; fat 5.6g 9% DV; cholesterol 0mg; sodium 323.2mg 13% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/9111/cranberry-sauce/", "name": "Cranberry Sauce", "summary": "\nA Thanksgiving classic. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F743657.jpg", "meta": [["Servings:", "11"], ["Yield:", "8 - 12 servings"]], "ingredients": ["12 ounces cranberries", "1 cup white sugar", "1 cup orange juice"], "direction": ["In a medium sized saucepan over medium heat, dissolve the sugar in the orange juice. Stir in the cranberries and cook until the cranberries start to pop (about 10 minutes). Remove from heat and place sauce in a bowl. Cranberry sauce will thicken as it cools."], "facts": "95 calories; protein 0.3g 1% DV; carbohydrates 24.2g 8% DV; fat 0.1g; cholesterol 0mg; sodium 0.8mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/266826/air-fryer-potato-wedges/", "name": "Air Fryer Potato Wedges", "summary": "\nPerfectly crisp and seasoned potato wedges straight out of your air fryer. It doesn't get any easier than this! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7620950.jpg", "meta": [["prep:", "5 mins"], ["cook:", "30 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "16 potato wedges"]], "ingredients": ["2 medium Russet potatoes, cut into wedges", "1 ½ tablespoons olive oil", "½ teaspoon paprika", "½ teaspoon parsley flakes", "½ teaspoon chili powder", "½ teaspoon sea salt", "⅛ teaspoon ground black pepper"], "direction": ["Preheat air fryer to 400 degrees F (200 degrees C).", "Place potato wedges in a large bowl. Add olive oil, paprika, parsley, chili, salt, and pepper and mix well to combine.", "Place 8 wedges in the basket of the air fryer and cook for 10 minutes.", "Flip wedges with tongs and cook for an additional 5 minutes. Repeat with remaining 8 wedges."], "facts": "129 calories; protein 2.3g 5% DV; carbohydrates 19g 6% DV; fat 5.3g 8% DV; cholesterol 0mg; sodium 230.2mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/254517/spaghetti-sauce-with-fresh-tomatoes/", "name": "Spaghetti Sauce with Fresh Tomatoes", "summary": "\nMade with fresh tomatoes! Wonderful taste. Serve over spaghetti noodles and add grated Parmesan cheese as desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3733395.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "1 quart sauce"]], "ingredients": ["¼ cup olive oil", "1  onion, chopped", "½ teaspoon garlic powder", "4 pounds fresh tomatoes, peeled and chopped", "1 tablespoon white sugar", "1 tablespoon dried basil", "1 tablespoon dried parsley", "1 teaspoon salt"], "direction": ["Heat olive oil in a large skillet over medium heat. Add onion and garlic powder; cook and stir until onion is translucent, about 5 minutes. Add tomatoes, sugar, basil, parsley, and salt. Bring to a boil. Reduce heat and simmer, stirring occasionally, until sauce thickens, 1 to 2 hours."], "facts": "120 calories; protein 2.5g 5% DV; carbohydrates 13.5g 4% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 304.3mg 12% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/264825/air-fried-sweet-potato-fries/", "name": "Air-Fried Sweet Potato Fries", "summary": "\nSimple and addicting air-fried sweet potato fries. I bet you can't eat just one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5397989.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  sweet potatoes, peeled and cut into 1/2 inch wide fries", "1 tablespoon canola oil", "½ teaspoon kosher salt", "¼ teaspoon pepper", "⅛ teaspoon garlic powder", "⅛ teaspoon ground sweet paprika"], "direction": ["Preheat the air fryer to 400 degrees F (200 degrees C).", "Combine sweet potato fries and canola oil in a bowl and mix. Season with salt, pepper, garlic powder, and paprika. Mix until all fries are evenly coated.", "Divide sweet potatoes into 2 or 3 batches for cooking. Place an even layer of sweet potatoes in the fry basket, insert in the air fryer, and cook until golden, about 10 minutes. Repeat with remaining sweet potatoes."], "facts": "119 calories; protein 1.1g 2% DV; carbohydrates 13.5g 4% DV; fat 7.1g 11% DV; cholesterol 0mg; sodium 516mg 21% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/51025/microwave-corn-on-the-cob/", "name": "Microwave Corn on the Cob", "summary": "\nThis is a no-nonsense recipe for corn on the cob. Perfect for when you run out of stove or grill space. I freeze the corn on the cob in plastic bags, and remove a single ear of frozen corn in the cold winter months to have the sweet taste of summer corn throughout the year! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F838726.jpg", "meta": [["cook:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["1 ear corn, husked and cleaned"], "direction": ["Wet a paper towel, and wring out. Wrap the ear of corn in the moist towel, and place on a dinner plate. Cook in the microwave for 5 minutes. Carefully remove paper towel, and enjoy!"], "facts": "123 calories; protein 4.6g 9% DV; carbohydrates 27.2g 9% DV; fat 1.7g 3% DV; cholesterol 0mg; sodium 21.5mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/17445/grilled-asparagus/", "name": "Grilled Asparagus", "summary": "\nThe special thing about this recipe is that it's so simple. Fresh asparagus with a little oil, salt, and pepper is cooked quickly over high heat on the grill. Enjoy the natural flavor of your veggies. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014212.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 mins"], ["total:", "18 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound fresh asparagus spears, trimmed", "1 tablespoon olive oil", "salt and pepper to taste"], "direction": ["Preheat grill for high heat.", "Lightly coat the asparagus spears with olive oil. Season with salt and pepper to taste.", "Grill over high heat for 2 to 3 minutes, or to desired tenderness."], "facts": "53 calories; protein 2.5g 5% DV; carbohydrates 4.4g 1% DV; fat 3.5g 5% DV; cholesterol 0mg; sodium 2.3mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/23256/black-halloween-punch/", "name": "Black Halloween Punch", "summary": "\nDelicious! As it is with any Halloween punch, a frozen 'hand' adds just the right spooky touch! The combined colors make a delightfully scary look! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2440215.jpg", "meta": [["prep:", "10 mins"], ["additional:", "50 mins"], ["total:", "1 hr"], ["Servings:", "32"], ["Yield:", "1 gallon"]], "ingredients": ["1 (.13 ounce) envelope unsweetened grape soft drink mix", "1 (.13 ounce) envelope unsweetened orange soft drink mix", "2 cups white sugar", "3 quarts cold water", "1 liter ginger ale"], "direction": ["To make a frozen hand, wash a disposable glove, fill with water, seal with a rubber band and freeze until hard.", "Stir together grape soft drink mix, orange soft drink mix, sugar and water until solids are dissolved.  Combine with chilled ginger ale just before serving.  Dip the frozen hand briefly in warm water, then peel off the glove.  Float the prepared hand in the punch bowl for a ghastly effect."], "facts": "59 calories; protein 0g; carbohydrates 15.2g 5% DV; fat 0g; cholesterol 0mg; sodium 8.7mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14169/mexican-bean-salad/", "name": "Mexican Bean Salad", "summary": "\nA colorful, spicy, and refreshing bean and corn salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F828805.jpg", "meta": [["prep:", "15 mins"], ["additional:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (15 ounce) can black beans, rinsed and drained", "1 (15 ounce) can kidney beans, drained", "1 (15 ounce) can cannellini beans, drained and rinsed", "1  green bell pepper, chopped", "1  red bell pepper, chopped", "1 (10 ounce) package frozen corn kernels", "1  red onion, chopped", "½ cup olive oil", "½ cup red wine vinegar", "2 tablespoons fresh lime juice", "1 tablespoon lemon juice", "2 tablespoons white sugar", "1 tablespoon salt", "1 clove crushed garlic", "¼ cup chopped fresh cilantro", "½ tablespoon ground cumin", "½ tablespoon ground black pepper", "1 dash hot pepper sauce", "½ teaspoon chili powder"], "direction": ["In a large bowl, combine beans, bell peppers, frozen corn, and red onion.", "In a small bowl, whisk together olive oil, red wine vinegar, lime juice, lemon juice, sugar, salt, garlic, cilantro, cumin, and black pepper.  Season to taste with hot sauce and chili powder.", "Pour olive oil dressing over vegetables; mix well.  Chill thoroughly, and serve cold."], "facts": "334 calories; protein 11.2g 22% DV; carbohydrates 41.7g 14% DV; fat 14.8g 23% DV; cholesterol 0mg; sodium 1158.8mg 46% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/", "name": "Spiced Slow Cooker Applesauce", "summary": "\nThis easy and delicious spiced applesauce slow cooks to perfection. My kids and I came up with this recipe one fall weekend. It's a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277498.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 hrs 30 mins"], ["total:", "6 hrs 40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  apples - peeled, cored, and thinly sliced", "½ cup water", "¾ cup packed brown sugar", "½ teaspoon pumpkin pie spice"], "direction": ["Combine the apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in the brown sugar and pumpkin pie spice; continue cooking another 30 minutes."], "facts": "151 calories; protein 0.4g 1% DV; carbohydrates 39.4g 13% DV; fat 0.2g; cholesterol 0mg; sodium 7.7mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/24712/ginger-veggie-stir-fry/", "name": "Ginger Veggie Stir-Fry", "summary": "\nI just whipped this up one day when I felt like a stir-fry but did not have all the ingredients called for in some of the stir-fry recipes on this site. I used certain veggies I had on hand, but any seasonal veggies may be used. It has a mild ginger flavor that can be enhanced according to taste, and is filling yet light on the tummy! Tofu may be added. Serve over a bed of steamed jasmine rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F709130.jpg", "meta": [["prep:", "25 mins"], ["cook:", "15 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon cornstarch", "1 ½ cloves garlic, crushed", "2 teaspoons chopped fresh ginger root, divided", "¼ cup vegetable oil, divided", "1 small head broccoli, cut into florets", "½ cup snow peas", "¾ cup julienned carrots", "½ cup halved green beans", "2 tablespoons soy sauce", "2 ½ tablespoons water", "¼ cup chopped onion", "½ tablespoon salt"], "direction": ["In a large bowl, blend cornstarch, garlic, 1 teaspoon ginger, and 2 tablespoons vegetable oil until cornstarch is dissolved. Mix in broccoli, snow peas, carrots, and green beans, tossing to lightly coat.", "Heat remaining 2 tablespoons oil in a large skillet or wok over medium heat.  Cook vegetables in oil for 2 minutes, stirring constantly to prevent burning. Stir in soy sauce and water. Mix in onion, salt, and remaining 1 teaspoon ginger. Cook until vegetables are tender but still crisp."], "facts": "119 calories; protein 2.2g 4% DV; carbohydrates 8g 3% DV; fat 9.3g 14% DV; cholesterol 0mg; sodium 903.3mg 36% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/35304/pico-de-gallo/", "name": "Pico De Gallo", "summary": "\nSometimes when you eat authentic Mexican food, they give you this salsa stuff made with tomatoes, onions, and jalapenos. You can add a squeeze of lime juice to pico de gallo, but I prefer this basic recipe. Once you serve this with your Mexican dish such as tacos, you will want it with all your Mexican dishes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F377426.jpg", "meta": [["prep:", "20 mins"], ["additional:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 medium tomato, diced", "1  onion, finely chopped", "½  fresh jalapeno pepper, seeded and chopped", "2 sprigs fresh cilantro, finely chopped", "1  green onion, finely chopped", "½ teaspoon garlic powder", "⅛ teaspoon salt", "⅛ teaspoon pepper"], "direction": ["In a medium bowl, combine tomato, onion, jalapeno pepper (to taste,) cilantro and green onion. Season with garlic powder, salt and pepper. Stir until evenly distributed. Refrigerate for 30 minutes."], "facts": "21 calories; protein 0.8g 2% DV; carbohydrates 4.7g 2% DV; fat 0.1g; cholesterol 0mg; sodium 76.3mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/191885/vegan-pancakes/", "name": "Vegan Pancakes", "summary": "\nThis batter makes light, fluffy, and delicious pancakes.  I have been making them for years and everyone that tries them wants the recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2682199.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "3"], ["Yield:", "9 pancakes"]], "ingredients": ["1 ¼ cups all-purpose flour", "2 tablespoons white sugar", "2 teaspoons baking powder", "½ teaspoon salt", "1 ¼ cups water", "1 tablespoon oil"], "direction": ["Sift the flour, sugar, baking powder, and salt into a large bowl.  Whisk the water and oil together in a small bowl.  Make a well in the center of the dry ingredients, and pour in the wet.  Stir just until blended; mixture will be lumpy.", "Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter."], "facts": "264 calories; protein 5.4g 11% DV; carbohydrates 48.9g 16% DV; fat 5.1g 8% DV; cholesterol 0mg; sodium 716.7mg 29% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/265979/air-fryer-baked-potatoes/", "name": "Air Fryer Baked Potatoes", "summary": "\nBeautifully crusty on the outside and light and fluffy on the inside, just like a great baked potato should be! Serve them with your favorite topping, like sour cream, butter, or chives. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6543245.jpg", "meta": [["prep:", "5 mins"], ["cook:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "2"], ["Yield:", "2 baked potatoes"]], "ingredients": ["2 large russet potatoes, scrubbed", "1 tablespoon peanut oil", "½ teaspoon coarse sea salt"], "direction": ["Preheat air fryer to 400 degrees F (200 degrees C).", "Brush potatoes with peanut oil and sprinkle with salt. Place them in the air fryer basket and place basket in the air fryer.", "Cook potatoes until done, about 1 hour. Test for doneness by piercing them with a fork."], "facts": "344 calories; protein 7.5g 15% DV; carbohydrates 64.5g 21% DV; fat 7.1g 11% DV; cholesterol 0mg; sodium 462.1mg 19% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/26391/chili-seasoning-mix-ii/", "name": "Chili Seasoning Mix II", "summary": "\nThis chili seasoning features flour, chili powder, red pepper, onion, garlic and cumin. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4539476.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "6"], ["Yield:", "0.75 cup"]], "ingredients": ["¼ cup all-purpose flour", "4 teaspoons chili powder", "1 tablespoon crushed red pepper", "1 tablespoon dried minced onion", "1 tablespoon dried, minced garlic", "2 teaspoons white sugar", "2 teaspoons ground cumin", "2 teaspoons dried parsley", "2 teaspoons salt", "1 teaspoon dried basil", "¼ teaspoon ground black pepper"], "direction": ["In a bowl, stir together flour, chili powder, red pepper, onion, garlic, sugar, cumin, parsley, salt, basil and pepper.  Store in an airtight container."], "facts": "45 calories; protein 1.4g 3% DV; carbohydrates 9.2g 3% DV; fat 0.8g 1% DV; cholesterol 0mg; sodium 796mg 32% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/42022/easy-apple-cider/", "name": "Easy Apple Cider", "summary": "\nSimple spiced apple cider! I used to buy the spices already mixed at the grocery store, and they stopped carrying it this year, so I just made my own. This is great for a shower or get together and the slow cooker keeps it warm, so guests can enjoy it through the night. When it's done, it's great mixed with spiced rum and/or a slice of orange! Leftover cider is great cold too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F244619.jpg", "meta": [["prep:", "5 mins"], ["cook:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (64 fluid ounce) bottle apple cider", "3  cinnamon sticks", "1 teaspoon whole allspice", "1 teaspoon whole cloves", "⅓ cup brown sugar"], "direction": ["In a slow cooker, combine apple cider and cinnamon sticks. Wrap allspice and cloves in a small piece of cheesecloth, and add to pot. Stir in brown sugar. Bring to a boil over high heat. Reduce heat, and keep warm."], "facts": "172 calories; protein 0.1g; carbohydrates 43.4g 14% DV; fat 0.1g; cholesterol 0mg; sodium 31.1mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/144346/roasted-garlic-lemon-broccoli/", "name": "Roasted Garlic Lemon Broccoli", "summary": "\nI was looking for a unique way to prepare broccoli and decided to give this a try! Florets are roasted after being tossed in olive oil and sprinkled with sea salt, freshly ground black pepper, and minced garlic. A squeeze of lemon juice before serving seals the deal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F549154.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads broccoli, separated into florets", "2 teaspoons extra-virgin olive oil", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 clove garlic, minced", "½ teaspoon lemon juice"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "In a large bowl, toss broccoli florets with the extra virgin olive oil, sea salt, pepper and garlic. Spread the broccoli out in an even layer on a baking sheet.", "Bake in the preheated oven until florets are tender enough to pierce the stems with a fork, 15 to 20 minutes. Remove and transfer to a serving platter. Squeeze lemon juice liberally over the broccoli before serving for a refreshing, tangy finish."], "facts": "49 calories; protein 2.9g 6% DV; carbohydrates 7g 2% DV; fat 1.9g 3% DV; cholesterol 0mg; sodium 326.5mg 13% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/236564/chana-masala-savory-indian-chick-peas/", "name": "Chana Masala (Savory Indian Chick Peas)", "summary": "\nIndian food is not just curried sauces. It's not too exotic either. Unless 'exotic' is code for 'yummy and full of flavor.' This dish features a healthy mixture of chickpeas, tomatoes, onion, and spices. Both carnivores and vegetarians will enjoy this meal. My kids love it. Leave out the green chile if the kiddies will be eating. Serve over basmati or jasmine rice and enjoy. Namaste y'all! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4240620.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "2"], ["Yield:", "2 cups"]], "ingredients": ["1  onion, chopped", "1  tomato, chopped", "1 (1 inch) piece fresh ginger, peeled and chopped", "4 cloves garlic, chopped, or more to taste", "1  green chile pepper, seeded and chopped  (Optional)", "3 tablespoons olive oil", "2  bay leaves, or more to taste", "1 teaspoon chili powder", "1 teaspoon coriander powder", "1 teaspoon garam masala", "½ teaspoon turmeric powder", "1 pinch salt to taste", "water as needed", "1 (15 ounce) can chickpeas", "1 teaspoon fresh cilantro leaves, for garnish, or more to taste"], "direction": ["Grind onion, tomato, ginger, garlic, and chile pepper together in a food processor into a paste.", "Heat olive oil in a large skillet over medium heat. Fry bay leaves in hot oil until fragrant, about 30 seconds. Pour the paste into the skillet and cook until the oil begins to separate from the mixture and is golden brown in color, 2 to 3 minutes. Season the mixture with chili powder, coriander, powder, gram masala, turmeric, and salt; cook and stir until very hot, 2 to 3 minutes.", "Stir enough water into the mixture to get a thick gravy; bring to a boil and stir chickpeas into the gravy. Reduce heat to medium and cook until the chickpeas are heated through, 5 to 7 minutes. Garnish with cilantro."], "facts": "413 calories; protein 9.4g 19% DV; carbohydrates 46.2g 15% DV; fat 22.8g 35% DV; cholesterol 0mg; sodium 524.9mg 21% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263728/vegan-mug-cake-with-pineapple-and-mint/", "name": "Vegan Mug Cake with Pineapple and Mint", "summary": "\nMost mug cakes are made with chocolate - this tropical vegan mug cake version is made with fresh pineapple, banana, coconut cream, and mint. No chocolate in sight! Just the way I like it. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5307195.jpg", "meta": [["prep:", "5 mins"], ["cook:", "3 mins"], ["additional:", "5 mins"], ["total:", "13 mins"], ["Servings:", "2"], ["Yield:", "2 mug cakes"]], "ingredients": ["2 slices fresh pineapple", "1  ripe banana", "2 tablespoons cream of coconut", "1 tablespoon rolled oats", "1 tablespoon quick-cooking oats", "¼ teaspoon baking powder", "3 leaves fresh mint", "1 teaspoon chia seeds", "1 teaspoon poppy seeds"], "direction": ["Combine pineapple, banana, cream of coconut, rolled oats, quick-cooking oats, baking powder, mint, chia seeds, and poppy seeds in a blender; blend until smooth. Pour into 2 mugs.", "Microwave at the highest setting until mug cakes have set and risen well, about 3 minutes. Allow to cool a few minutes before serving."], "facts": "196 calories; protein 2.4g 5% DV; carbohydrates 39.1g 13% DV; fat 4.7g 7% DV; cholesterol 0mg; sodium 70.1mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/256021/ultimate-tofu-breakfast-burrito-bowls/", "name": "Ultimate Tofu Breakfast Burrito Bowls", "summary": "\nTofu scrambles up just like eggs, and with some clever spices, even non-vegans will barely notice the difference. Try setting out toppings to let family or guests assemble their own burrito bowls. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4306820.jpg", "meta": [["prep:", "15 mins"], ["cook:", "30 mins"], ["total:", "45 mins"], ["Servings:", "3"], ["Yield:", "3 servings"]], "ingredients": ["3 tablespoons olive oil, divided", "1 (14 ounce) package extra-firm tofu, drained", "½ teaspoon salt", "black pepper to taste", "1 ½ teaspoons onion powder", "1 ½ teaspoons garlic powder", "½ teaspoon ground turmeric", "1 tablespoon fresh lemon juice", "1 tablespoon olive oil", "1 cup finely diced red onion", "2  jalapeno peppers, seeded and chopped", "½ teaspoon salt", "3 cloves garlic, minced", "2 cups chopped tomatoes", "1 ½ teaspoons cumin", "¼ cup chopped fresh cilantro", "1 tablespoon fresh lemon juice", "1 (15.5 ounce) can no-salt-added black beans, drained and rinsed", "1 ½ cups cooked hash brown potatoes", "1  avocado - peeled, pitted and sliced", "1 teaspoon fresh lemon juice", "¼ cup chopped fresh cilantro", "1 teaspoon hot sauce, or to taste"], "direction": ["Preheat a large, heavy skillet over medium-high heat. Add 2 tablespoons oil. Break tofu apart over skillet into bite-size pieces, sprinkle with salt and pepper, then cook, stirring frequently with a thin metal spatula, until liquid cooks out and tofu browns, about 10 minutes. (If you notice liquid collecting in pan, increase heat to evaporate water.) Be sure to get under the tofu when you stir, scraping the bottom of the pan where the good, crispy stuff is and keeping it from sticking.", "Add onion and garlic powders, turmeric, juice, and remaining tablespoon oil and toss to coat. Cook 5 minutes more.", "Preheat a heavy-bottomed saucepan over medium-high heat. Add oil. Cook onion and jalapenos with a pinch of salt, stirring, until translucent, about 5 minutes, Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes, cumin, and remaining salt, and cook, stirring, until tomatoes become saucy, about 5 minutes. Add cilantro and lemon juice. Let cilantro wilt in. Add beans and heat through, stirring occasionally, about 2 minutes. Taste for salt and seasoning.", "Spoon some hash browns into each bowl, followed by a scoop of beans and a scoop of scramble. Top with avocado, a squeeze of fresh lemon juice, and a sprinkle of cilantro. Serve with hot sauce."], "facts": "579 calories; protein 22g 44% DV; carbohydrates 57.2g 18% DV; fat 39.6g 61% DV; cholesterol 0mg; sodium 1170.5mg 47% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263743/vegan-zucchini-noodles-with-chickpeas-and-zucchini-blossoms/", "name": "Vegan Zucchini Noodles with Chickpeas and Zucchini Blossoms", "summary": "\nThis is a quick and nutritious vegan main. You can leave out the zucchini blossoms since they are only in season for a short while, but if you can find them, make sure to use them! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5310531.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["4 tablespoons olive oil", "2 cloves garlic, minced", "2 medium zucchini, cut into noodles with a spiralizer", "12  zucchini blossoms, pistils removed, cut into strips", "½ cup canned chickpeas, drained and rinsed", "salt", "6  fresh basil leaves, cut into strips, or to taste"], "direction": ["Heat olive oil in a large skillet over low heat and cook garlic until softened, about 10 minutes. Add zucchini and zucchini blossoms; mix well with olive oil. Add chickpeas and stir to combine. Season with salt and stir in basil. Serve immediately."], "facts": "348 calories; protein 5.7g 11% DV; carbohydrates 21.6g 7% DV; fat 28.1g 43% DV; cholesterol 0mg; sodium 278.2mg 11% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263706/rice-paper-fake-bacon/", "name": "Rice Paper Fake Bacon", "summary": "\nSome fake bacons are hit-and-miss, but because bacon is the one thing most people miss when switching to a vegetarian or vegan way of life, it's expected a fitting alternative is created. This recipe not only offers a completely meat-free bacon, but one that is low in fat and calories. To mimic the intoxicating aroma that we have come to love in the real thing, we used a combination of liquid smoke and paprika to achieve similar results cleverly using rice paper. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5529675.jpg", "meta": [["prep:", "15 mins"], ["cook:", "6 mins"], ["total:", "21 mins"], ["Servings:", "24"], ["Yield:", "24 pieces"]], "ingredients": ["2 tablespoons sesame oil", "2 tablespoons reduced-sodium soy sauce", "2 teaspoons maple syrup", "1 ½ teaspoons miso paste", "1 teaspoon liquid smoke flavoring", "½ teaspoon ground paprika", "½ teaspoon ground black pepper", "2  sheets rice paper"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "Whisk sesame oil, soy sauce, maple syrup, miso, liquid smoke, paprika, and black pepper together in a shallow bowl.", "Stack 2 pieces of rice paper and soak them in a bowl of cold water until slightly soft and pliable, about 30 seconds. Cut the hydrated rice paper into strips using a pizza cutter. Dip each strip in the soy mixture and place on a sheet of parchment paper. Carefully lay the parchment paper directly on the oven rack.", "Bake in the preheated oven until strips are dry, 6 to 8 minutes."], "facts": "16 calories; protein 0.2g; carbohydrates 1g; fat 1.4g 2% DV; cholesterol 0mg; sodium 57.8mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263635/steamed-vegan-rice-cakes-banh-bo-hap/", "name": "Steamed Vegan Rice Cakes (Banh Bo Hap)", "summary": "\nEasy recipe for steamed rice cake, banh bo hap, a spongy, sweet, and gorgeous-looking vegan dessert. It costs next to nothing to make and fun for the kids. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4576234.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["additional:", "2 hrs"], ["total:", "2 hrs 25 mins"], ["Servings:", "12"], ["Yield:", "12 servings"]], "ingredients": ["4 cups rice flour", "2 cups lukewarm water", "1 (14 ounce) can coconut milk", "1 cup white sugar", "4 teaspoons tapioca starch", "1 ½ teaspoons active dry yeast", "½ teaspoon vanilla extract", "¼ teaspoon salt", "2 teaspoons oil, or as needed"], "direction": ["Whisk rice flour, water, coconut milk, sugar, tapioca starch, yeast, vanilla extract, and salt together in a bowl until smooth. Cover with a lid. Let batter rest until air bubbles rise to the surface, about 2 hours. Stir well.", "Grease cake molds with oil. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Place cake molds on top and pour batter into each, leaving 1 3/4 inches of space at the top for rising. Bring water to a boil. Cover and steam until a toothpick inserted into a cake comes out clean, about 10 minutes."], "facts": "334 calories; protein 4g 8% DV; carbohydrates 60.8g 20% DV; fat 8.5g 13% DV; cholesterol 0mg; sodium 54.2mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/232210/couscous-with-olives-and-sun-dried-tomato/", "name": "Couscous with Olives and Sun-Dried Tomato", "summary": "\nA delicate, flavorful dish that will satisfy vegans and carnivores alike! Inspired by my family's deep Coptic Orthodox Christian tradition, this is a great meal alternative during strict fasting times. It contains no animal products or fats, but has enough flavor and visual impact to make you feel like you're not sacrificing a thing! I hope you will enjoy this recipe. Add chicken or prawns to make this vegan dish a carnivorous delight! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1011586.jpg", "meta": [["prep:", "20 mins"], ["cook:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 ¼ cups vegetable broth", "1 ¼ cups water", "2 cups pearl (Israeli) couscous", "1 pinch salt", "1 pinch ground black pepper", "5 tablespoons olive oil, divided", "½ cup pine nuts", "4 cloves garlic, minced", "1  shallot, minced", "½ cup sliced black olives", "⅓ cup sun-dried tomatoes packed in oil, drained and chopped", "1 cup vegetable broth", "¼ cup chopped fresh flat-leaf parsley"], "direction": ["Bring 1 1/4 cup vegetable broth and water to a boil in a saucepan, stir in couscous, and mix in salt and black pepper. Reduce heat to low and simmer until liquid is absorbed, about 8 minutes.", "Heat 3 tablespoons olive oil in a skillet over medium-high heat; stir in pine nuts and cook, stirring frequently, until pine nuts smell toasted and are golden brown, about 1 minute. Remove from heat.", "Heat remaining 2 tablespoons olive oil in a saucepan; cook and stir garlic and shallot in the hot oil until softened, about 2 minutes. Stir black olives and sun-dried tomatoes into garlic mixture and cook until heated through, 2 to 3 minutes, stirring often. Slowly pour in 1 cup vegetable broth and bring mixture to a boil. Reduce heat to low and simmer until sauce has reduced, 8 to 10 minutes.", "Transfer couscous to a large serving bowl, mix with sauce, and serve topped with parsley and pine nuts."], "facts": "528 calories; protein 13g 26% DV; carbohydrates 55.5g 18% DV; fat 29.3g 45% DV; cholesterol 0mg; sodium 455.1mg 18% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/263458/vegan-tomato-soup/", "name": "Vegan Tomato Soup", "summary": "\nI don't peel the tomatoes because there are lots of vitamins and fiber in the skin. If you puree the soup well, you won't taste them. I use half cherry tomatoes, half regular tomatoes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5261486.jpg", "meta": [["prep:", "10 mins"], ["cook:", "45 mins"], ["additional:", "10 mins"], ["total:", "1 hr 5 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["2 tablespoons extra-virgin olive oil", "1  onion, chopped", "4 cloves garlic, minced", "4  tomatoes, chopped", "3 ½ cups cherry tomatoes, halved", "¾ cup vegetable broth", "2  bay leaves", "2 sprigs fresh basil, divided"], "direction": ["Heat olive oil in a pot over low heat and cook onion until soft and translucent. Add garlic and cook until fragrant, about 1 minute. Increase heat to medium, add all tomatoes, and cook until they start to break down, about 5 minutes. Stir occasionally. Add vegetable broth, bay leaves, and 1 sprig of basil. Bring to a boil, reduce heat, and simmer until tomatoes have broken down and soup starts to thicken, about 30 minutes.", "Remove soup from heat and cool slightly. Remove bay leaves and basil.", "Puree tomato soup with an immersion blender until smooth. Reheat soup before serving and garnish with basil leaves."], "facts": "140 calories; protein 3.2g 6% DV; carbohydrates 17.5g 6% DV; fat 7.6g 12% DV; cholesterol 0mg; sodium 69.6mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/256014/chai-spice-cheesecake/", "name": "Chai Spice \"Cheesecake\"", "summary": "\nCashews, non-dairy milk, and silken tofu are the secret ingredients in this rich, vegan cheesecake--homey spices like ginger and cinnamon add fall flavor. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4106926.jpg", "meta": [["prep:", "20 mins"], ["cook:", "55 mins"], ["additional:", "4 hrs 45 mins"], ["total:", "6 hrs"], ["Servings:", "8"], ["Yield:", "1 (9-inch) cheesecake"]], "ingredients": ["1 ½ cups crushed vegan graham crackers", "¼ cup packed brown sugar", "3 tablespoons coconut oil, melted", "2 tablespoons non-dairy milk (such as rice, soy, or almond)"], "direction": ["Preheat oven to 350 degrees F. Lightly spray a 9-inch springform pan with cooking spray. Stir together graham crackers and brown sugar in a small bowl, then drizzle with oil and stir. Add just enough milk to make crumbs stick together. Press very firmly into bottom of pan. Bake 10 minutes. Keep oven at 350 degrees F.", "Meanwhile, blend cheesecake-batter ingredients in a blender until completely smooth and no bits of cashew remain, giving blender a rest every minute or so and scraping down sides with a rubber spatula. Batter should be completely smooth and not grainy: This takes about 1 minute with a high-powered blender (such as Vitamix) or about 5 minutes with a standard blender.", "Spray inside springform pan (above baked crust) with cooking spray. Pour in batter and jiggle to spread evenly over crust. Bake until top is lightly puffed and edges are golden, 45 to 50 minutes.", "Cool to room temperature on a rack, about 1 hour. Chill, covered, at least 3 hours or, even better, overnight.", "Slice cake with a thin, sharp knife dipped in water. Dollop each slice with whipped topping, dust with cinnamon, and sprinkle with candied ginger."], "facts": "403 calories; protein 6.1g 12% DV; carbohydrates 54.4g 18% DV; fat 20.2g 31% DV; cholesterol 0mg; sodium 230mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14231/guacamole/", "name": "Guacamole", "summary": "\nYou can make this avocado salad smooth or chunky depending on your tastes. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521556.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["3  avocados - peeled, pitted, and mashed", "1  lime, juiced", "1 teaspoon salt", "½ cup diced onion", "3 tablespoons chopped fresh cilantro", "2  roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper  (Optional)"], "direction": ["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."], "facts": "262 calories; protein 3.7g 7% DV; carbohydrates 18g 6% DV; fat 22.2g 34% DV; cholesterol 0mg; sodium 595.7mg 24% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/99211/perfect-sushi-rice/", "name": "Perfect Sushi Rice", "summary": "\nHere is my recipe for the perfect sushi rice. You can eat this alone or roll into your favorite sushi roll with ingredients of choice. I use strips of carrots, cucumbers and slices of avocado. You can adjust the amount of vinegar in this recipe to suit your taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5646437.jpg", "meta": [["prep:", "5 mins"], ["cook:", "20 mins"], ["total:", "25 mins"], ["Servings:", "15"], ["Yield:", "5 cups"]], "ingredients": ["2 cups uncooked glutinous white rice (sushi rice)", "3 cups water", "½ cup rice vinegar", "1 tablespoon vegetable oil", "¼ cup white sugar", "1 teaspoon salt"], "direction": ["Rinse the rice in a strainer or colander until the water runs clear. Combine with water in a medium saucepan. Bring to a boil, then reduce the heat to low, cover and cook for 20 minutes. Rice should be tender and water should be absorbed. Cool until cool enough to handle.", "In a small saucepan, combine the rice vinegar, oil, sugar and salt. Cook over medium heat until the sugar dissolves. Cool, then stir into the cooked rice. When you pour this in to the rice it will seem very wet. Keep stirring and the rice will dry as it cools."], "facts": "112 calories; protein 1.7g 3% DV; carbohydrates 23.5g 8% DV; fat 1g 2% DV; cholesterol 0mg; sodium 158.2mg 6% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/", "name": "Roasted Brussels Sprouts", "summary": "\nThis recipe is from my mother. It may sound strange, but these are really good and very easy to make. The Brussels sprouts should be brown with a bit of black on the outside when done. Any leftovers can be reheated or even just eaten cold from the fridge. I don't know how, but they taste sweet and salty at the same time! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812447.jpg", "meta": [["prep:", "15 mins"], ["cook:", "45 mins"], ["total:", "1 hr"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 ½ pounds Brussels sprouts, ends trimmed and yellow leaves removed", "3 tablespoons olive oil", "1 teaspoon kosher salt", "½ teaspoon freshly ground black pepper"], "direction": ["Preheat oven to 400 degrees F (205 degrees C).", "Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.", "Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."], "facts": "104 calories; protein 2.9g 6% DV; carbohydrates 10g 3% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 344mg 14% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/13839/spiced-pumpkin-seeds/", "name": "Spiced Pumpkin Seeds", "summary": "\nThese pumpkin seeds make a great tasting and healthy snack. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4569239.jpg", "meta": [["prep:", "10 mins"], ["cook:", "1 hr"], ["total:", "1 hr 10 mins"], ["Servings:", "8"], ["Yield:", "2 cups"]], "ingredients": ["1 ½ tablespoons margarine, melted", "½ teaspoon salt", "⅛ teaspoon garlic salt", "2 teaspoons Worcestershire sauce", "2 cups raw whole pumpkin seeds"], "direction": ["Preheat oven to 275 degrees F (135 degrees C).", "Combine the margarine, salt, garlic salt, Worcestershire sauce and pumpkin seeds. Mix thoroughly and place in shallow baking dish.", "Bake for 1 hour, stirring occasionally."], "facts": "90 calories; protein 3g 6% DV; carbohydrates 8.9g 3% DV; fat 5.1g 8% DV; cholesterol 0mg; sodium 213.7mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/21134/candied-apples-ii/", "name": "Candied Apples II", "summary": "\nApples with a hard candy coating, like you can get at fairs. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F280191.jpg", "meta": [["prep:", "10 mins"], ["cook:", "30 mins"], ["total:", "40 mins"], ["Servings:", "15"], ["Yield:", "15 candied apples"]], "ingredients": ["15  apples", "2 cups white sugar", "1 cup light corn syrup", "1 ½ cups water", "8 drops red food coloring"], "direction": ["Lightly grease cookie sheets.  Insert craft sticks into whole, stemmed apples.", "In a medium saucepan over medium-high heat, combine sugar, corn syrup and water.  Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.  Remove from heat and stir in food coloring.", "Holding apple by its stick, dip in syrup and remove and turn to coat evenly.  Place on prepared sheets to harden."], "facts": "237 calories; protein 0.4g 1% DV; carbohydrates 62.5g 20% DV; fat 0.2g; cholesterol 0mg; sodium 15mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/132785/vegetarian-kale-soup/", "name": "Vegetarian Kale Soup", "summary": "\nThis wonderful soup will warm your insides, delight your taste buds, and fill your stomach on a cold winter's night. It is full of dark green kale, potatoes, and cannellini beans. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1124623.jpg", "meta": [["prep:", "25 mins"], ["cook:", "30 mins"], ["total:", "55 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["2 tablespoons olive oil", "1  yellow onion, chopped", "2 tablespoons chopped garlic", "1 bunch kale, stems removed and leaves chopped", "8 cups water", "6 cubes  vegetable bouillon (such as Knorr)", "1 (15 ounce) can diced tomatoes", "6  white potatoes, peeled and cubed", "2 (15 ounce) cans cannellini beans (drained if desired)", "1 tablespoon Italian seasoning", "2 tablespoons dried parsley", "salt and pepper to taste"], "direction": ["Heat the olive oil in a large soup pot; cook the onion and garlic until soft.  Stir in the kale and cook until wilted, about 2 minutes. Stir in the water, vegetable bouillon, tomatoes, potatoes, beans, Italian seasoning, and parsley.  Simmer soup on medium heat for 25 minutes, or until potatoes are cooked through.  Season with salt and pepper to taste."], "facts": "277 calories; protein 9.6g 19% DV; carbohydrates 50.9g 16% DV; fat 4.5g 7% DV; cholesterol 0mg; sodium 372.2mg 15% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/68436/vegan-brownies/", "name": "Vegan Brownies", "summary": "\nMMMMM...Vegan Brownies!!!!  These are very gooey, which is a good thing in my book. However, if you want your brownies a little more solid you'll need to cook them longer than the recommended time. Great for people with egg or dairy allergies too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3927903.jpg", "meta": [["prep:", "15 mins"], ["cook:", "25 mins"], ["additional:", "10 mins"], ["total:", "50 mins"], ["Servings:", "16"], ["Yield:", "16 brownies"]], "ingredients": ["2 cups unbleached all-purpose flour", "2 cups white sugar", "¾ cup unsweetened cocoa powder", "1 teaspoon baking powder", "1 teaspoon salt", "1 cup water", "1 cup vegetable oil", "1 teaspoon vanilla extract"], "direction": ["Preheat the oven to 350 degrees F (175 degrees C).", "In a large bowl, stir together the flour, sugar, cocoa powder, baking powder and salt. Pour in water, vegetable oil and vanilla; mix until well blended. Spread evenly in a 9x13 inch baking pan.", "Bake for 25 to 30 minutes in the preheated oven, until the top is no longer shiny. Let cool for at least 10 minutes before cutting into squares."], "facts": "284 calories; protein 2.4g 5% DV; carbohydrates 39.2g 13% DV; fat 14.3g 22% DV; cholesterol 0mg; sodium 169.4mg 7% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14021/grandmas-slow-cooker-vegetarian-chili/", "name": "Grandma's Slow Cooker Vegetarian Chili", "summary": "\nThis is a simple crowd pleasing recipe that can sit in a slow cooker until it is time to serve. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F804518.jpg", "meta": [["prep:", "10 mins"], ["cook:", "2 hrs"], ["total:", "2 hrs 10 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (19 ounce) can black bean soup", "1 (15 ounce) can kidney beans, rinsed and drained", "1 (15 ounce) can garbanzo beans, rinsed and drained", "1 (16 ounce) can vegetarian baked beans", "1 (14.5 ounce) can chopped tomatoes in puree", "1 (15 ounce) can whole kernel corn, drained", "1  onion, chopped", "1  green bell pepper, chopped", "2 stalks celery, chopped", "2 cloves garlic, chopped", "1 tablespoon chili powder, or to taste", "1 tablespoon dried parsley", "1 tablespoon dried oregano", "1 tablespoon dried basil"], "direction": ["In a slow cooker, combine black bean soup, kidney beans, garbanzo beans, baked beans, tomatoes, corn, onion, bell pepper and celery. Season with garlic, chili powder, parsley, oregano and basil. Cook for at least two hours on High."], "facts": "260 calories; protein 12.4g 25% DV; carbohydrates 52.6g 17% DV; fat 2g 3% DV; cholesterol 0.8mg; sodium 965.9mg 39% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/137650/greek-lentil-soup-fakes/", "name": "Greek Lentil Soup (Fakes)", "summary": "\nFakes (pronounced 'Fah-kehs') is a staple in the Greek kitchen, and an especially filling meal. It is traditionally served with a drizzle of olive oil and lots of vinegar. Though the vinegar is of course optional, try it. It lifts the lentils and adds another dimension of flavor! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6275622.jpg", "meta": [["prep:", "20 mins"], ["cook:", "1 hr"], ["total:", "1 hr 20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["8 ounces brown lentils", "¼ cup olive oil", "1 tablespoon minced garlic", "1  onion, minced", "1 large carrot, chopped", "1 quart water", "1 pinch dried oregano", "1 pinch crushed dried rosemary", "2  bay leaves", "1 tablespoon tomato paste", "salt and ground black pepper to taste", "1 teaspoon olive oil, or to taste", "1 teaspoon red wine vinegar, or to taste  (Optional)"], "direction": ["Place lentils in a large saucepan; add enough water to cover by 1 inch. Bring water to a boil and cook until tender, about 10 minutes; drain.", "Heat olive oil in a saucepan over medium heat. Add garlic, onion, and carrot; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in lentils, 1 quart water, oregano, rosemary, and bay leaves. Bring to a boil. Reduce heat to medium-low, cover, and simmer for 10 minutes.", "Stir in tomato paste and season with salt and pepper. Cover and simmer until the lentils have softened, 30 to 40 minutes, stirring occasionally. Add additional water if the soup becomes too thick. Drizzle with 1 teaspoon olive oil and red wine vinegar to taste."], "facts": "357 calories; protein 15.5g 31% DV; carbohydrates 40.3g 13% DV; fat 15.5g 24% DV; cholesterol 0mg; sodium 56.9mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/11771/easy-pizza-sauce-i/", "name": "Easy Pizza Sauce I", "summary": "\nA simple pizza sauce used by many pizzerias. The thickness of the sauce is regulated by the amount of water used; it should be somewhat viscous. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4067127.jpg", "meta": [["Servings:", "8"], ["Yield:", "1 large pizza"]], "ingredients": ["1 (6 ounce) can tomato paste", "1 ½ cups water", "⅓ cup extra virgin olive oil", "2 cloves garlic, minced", "salt to taste", "ground black pepper to taste", "½ tablespoon dried oregano", "½ tablespoon dried basil", "½ teaspoon dried rosemary, crushed"], "direction": ["Mix together the tomato paste, water, and olive oil. Mix well. Add garlic, salt and pepper to taste, oregano, basil, and rosemary. Mix well and let stand several hours to let flavors blend. No cooking necessary, just spread on dough."], "facts": "104 calories; protein 1g 2% DV; carbohydrates 4.7g 2% DV; fat 9.5g 15% DV; cholesterol 0mg; sodium 169.5mg 7% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/72508/the-best-vegetarian-chili-in-the-world/", "name": "The Best Vegetarian Chili in the World", "summary": "\nBreak out your soup pot and fix up a batch of this delicious, spicy vegetarian chili today! It's ready in no time, and packed with vegetables, beans - and flavor! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565674.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 tablespoon olive oil", "½ medium onion, chopped", "2  bay leaves", "1 teaspoon ground cumin", "2 tablespoons dried oregano", "1 tablespoon salt", "2 stalks celery, chopped", "2  green bell peppers, chopped", "2  jalapeno peppers, chopped", "3 cloves garlic, chopped", "2 (4 ounce) cans chopped green chile peppers, drained", "2 (12 ounce) packages vegetarian burger crumbles", "3 (28 ounce) cans whole peeled tomatoes, crushed", "¼ cup chili powder", "1 tablespoon ground black pepper", "1 (15 ounce) can kidney beans, drained", "1 (15 ounce) can garbanzo beans, drained", "1 (15 ounce) can black beans", "1 (15 ounce) can whole kernel corn"], "direction": ["Heat the olive oil in a large pot over medium heat. Stir in the onion, and season with bay leaves, cumin, oregano, and salt. Cook and stir until onion is tender, then mix in the celery, green bell peppers, jalapeno peppers, garlic, and green chile peppers. When vegetables are heated through, mix in the vegetarian burger crumbles. Reduce heat to low, cover pot, and simmer 5 minutes.", "Mix the tomatoes into the pot. Season chili with chili powder and pepper. Stir in the kidney beans, garbanzo beans, and black beans. Bring to a boil, reduce heat to low, and simmer 45 minutes. Stir in the corn, and continue cooking 5 minutes before serving."], "facts": "391 calories; protein 28.2g 56% DV; carbohydrates 58.7g 19% DV; fat 7.9g 12% DV; cholesterol 0mg; sodium 2571.2mg 103% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/216950/roasted-cauliflower-soup/", "name": "Roasted Cauliflower Soup", "summary": "\nThis is simple and delicious. The taste is so smooth and creamy most people think this is a fattening soup loaded with cream and potatoes. People are always shocked by how few ingredients are needed. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1012540.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr"], ["additional:", "20 mins"], ["total:", "1 hr 35 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads   cauliflower, broken into florets", "olive oil cooking spray", "¼ cup olive oil", "1 large onion, chopped", "4 cloves garlic, chopped", "6 cups water", "salt and ground black pepper to taste"], "direction": ["Place the cauliflower florets into a large bowl of lightly salted water; allow to stand for 20 minutes. Drain well, and arrange on a sheet of heavy aluminum foil on a baking sheet. Spray the olive oil cooking spray evenly on the cauliflower.", "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.", "Broil the cauliflower until browned, 20 to 30 minutes.", "Meanwhile, heat olive oil in a large soup pot, and cook the onion until translucent, about 5 minutes; stir in the garlic and roasted cauliflower. Pour in the water, season with salt and black pepper, and simmer until all the vegetables are tender, about 30 minutes. Blend the soup in the pot with an immersion hand blender until creamy and smooth."], "facts": "141 calories; protein 4.2g 8% DV; carbohydrates 13.2g 4% DV; fat 9.2g 14% DV; cholesterol 0mg; sodium 92.6mg 4% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14064/easy-guacamole/", "name": "Easy Guacamole", "summary": "\nSimply a quick recipe for tasty guacamole! Great with tortilla chips or as a topping for Mexican foods! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1488197.jpg", "meta": [["prep:", "10 mins"], ["additional:", "30 mins"], ["total:", "40 mins"], ["Servings:", "16"], ["Yield:", "2 cups"]], "ingredients": ["2  avocados", "1 small onion, finely chopped", "1 clove garlic, minced", "1  ripe tomato, chopped", "1  lime, juiced", "salt and pepper to taste"], "direction": ["Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper.  Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors."], "facts": "45 calories; protein 0.7g 1% DV; carbohydrates 3.4g 1% DV; fat 3.7g 6% DV; cholesterol 0mg; sodium 2.4mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/19584/green-tomato-relish/", "name": "Green Tomato Relish", "summary": "\nThis delicious, tangy relish of green tomatoes, onions, bell peppers, and spices,  is perfect with sandwiches, potatoes, cheese, and lots of other entrees. A jar of this makes a great gift, too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4554361.jpg", "meta": [["prep:", "1 hr 15 mins"], ["cook:", "45 mins"], ["total:", "2 hrs"], ["Servings:", "192"], ["Yield:", "12 pints"]], "ingredients": ["24 large green tomatoes", "3  red bell peppers, halved and seeded", "3  green bell peppers, halved and seeded", "12 large onions", "3 tablespoons celery seed", "3 tablespoons mustard seed", "1 tablespoon salt", "5 cups white sugar", "2 cups cider vinegar"], "direction": ["In a grinder or food processor, coarsely grind tomatoes, red bell peppers, green bell peppers, and onions. (You may need to do this in batches.) Line a large colander with cheesecloth, place in sink or in a large bowl, and pour in tomato mixture to drain for 1 hour.", "In a large, non-aluminum stockpot, combine tomato mixture, celery seed, mustard seed, salt, sugar, and vinegar. Bring to a boil and simmer over low heat 5 minutes, stirring frequently.", "Sterilize enough jars and lids to hold relish (12 one-pint jars, or 6 one-quart jars). Pack relish into sterilized jars, making sure there are no spaces or air pockets. Fill jars all the way to top. Screw on lids.", "Place a rack in the bottom of a large stockpot and fill halfway with boiling water. Carefully lower jars into pot using a holder. Leave a 2 inch space between jars. Pour in more boiling water if necessary, until tops of jars are covered by 2 inches of water. Bring water to a full boil, then cover and process for 30 minutes.", "Remove jars from pot and place on cloth-covered or wood surface, several inches apart, until cool. Once cool, press top of each lid with finger, ensuring that seal is tight (lid does not move up or down at all). Relish can be stored for up to a year."], "facts": "32 calories; protein 0.5g 1% DV; carbohydrates 7.6g 2% DV; fat 0.1g; cholesterol 0mg; sodium 40.1mg 2% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/24700/churros/", "name": "Churros", "summary": "\nThese Mexican fritters are very common at fairs. In my border hometown, the line at this stand is always overwhelming. People wait hours in line just to get a taste of these churros. I have run across several recipes but this is the best one by far. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392145.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 cup water", "2 ½ tablespoons white sugar", "½ teaspoon salt", "2 tablespoons vegetable oil", "1 cup all-purpose flour", "2 quarts oil for frying", "½ cup white sugar, or to taste", "1 teaspoon ground cinnamon"], "direction": ["In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball.", "Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels.", "Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."], "facts": "691 calories; protein 3.3g 7% DV; carbohydrates 57.1g 18% DV; fat 51.1g 79% DV; cholesterol 0mg; sodium 293.1mg 12% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/220642/quick-and-easy-refried-beans/", "name": "Quick and Easy Refried Beans", "summary": "\nWhen you don't have all day to make refried beans and you can't stand the canned ones, these are easy and delicious. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1010236.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 tablespoons canola oil", "2  garlic cloves, peeled", "2 (15 ounce) cans pinto beans", "1 teaspoon cumin", "1 teaspoon chili powder", "salt to taste", "½  lime, juiced"], "direction": ["Heat canola oil in a heavy skillet over medium heat.", "Cook garlic cloves in hot oil, turning once, until brown on both sides, 4 to 5 minutes.", "Smash garlic cloves in skillet with a fork.", "Stir pinto beans, cumin, chili powder, and salt into mashed garlic and cook until beans are thoroughly heated, about 5 minutes. Stir occasionally.", "Smash bean mixture with a potato masher to desired texture. Squeeze lime juice over smashed beans and stir until combined."], "facts": "132 calories; protein 5g 10% DV; carbohydrates 16.1g 5% DV; fat 5.6g 9% DV; cholesterol 0mg; sodium 323.2mg 13% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/9111/cranberry-sauce/", "name": "Cranberry Sauce", "summary": "\nA Thanksgiving classic. Originally submitted to ThanksgivingRecipe.com. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F743657.jpg", "meta": [["Servings:", "11"], ["Yield:", "8 - 12 servings"]], "ingredients": ["12 ounces cranberries", "1 cup white sugar", "1 cup orange juice"], "direction": ["In a medium sized saucepan over medium heat, dissolve the sugar in the orange juice. Stir in the cranberries and cook until the cranberries start to pop (about 10 minutes). Remove from heat and place sauce in a bowl. Cranberry sauce will thicken as it cools."], "facts": "95 calories; protein 0.3g 1% DV; carbohydrates 24.2g 8% DV; fat 0.1g; cholesterol 0mg; sodium 0.8mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/9501/hot-apple-cider/", "name": "Hot Apple Cider", "summary": "\nNothing beats a mug of hot cider on a cold winter day. This recipe is great as it calls for fresh apple cider and pure maple syrup.  Start with only 6 strips each of the orange and lemon peel, and adjust to taste. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1061270.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["6 cups apple cider", "¼ cup real maple syrup", "2  cinnamon sticks", "6  whole cloves", "6  whole allspice berries", "1  orange peel, cut into strips", "1  lemon peel, cut into strips"], "direction": ["Pour the apple cider and maple syrup into a large stainless steel saucepan.", "Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture.", "Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling.", "Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired."], "facts": "163 calories; protein 1.2g 2% DV; carbohydrates 40g 13% DV; fat 0.1g; cholesterol 0mg; sodium 29.4mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/266826/air-fryer-potato-wedges/", "name": "Air Fryer Potato Wedges", "summary": "\nPerfectly crisp and seasoned potato wedges straight out of your air fryer. It doesn't get any easier than this! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7620950.jpg", "meta": [["prep:", "5 mins"], ["cook:", "30 mins"], ["total:", "35 mins"], ["Servings:", "4"], ["Yield:", "16 potato wedges"]], "ingredients": ["2 medium Russet potatoes, cut into wedges", "1 ½ tablespoons olive oil", "½ teaspoon paprika", "½ teaspoon parsley flakes", "½ teaspoon chili powder", "½ teaspoon sea salt", "⅛ teaspoon ground black pepper"], "direction": ["Preheat air fryer to 400 degrees F (200 degrees C).", "Place potato wedges in a large bowl. Add olive oil, paprika, parsley, chili, salt, and pepper and mix well to combine.", "Place 8 wedges in the basket of the air fryer and cook for 10 minutes.", "Flip wedges with tongs and cook for an additional 5 minutes. Repeat with remaining 8 wedges."], "facts": "129 calories; protein 2.3g 5% DV; carbohydrates 19g 6% DV; fat 5.3g 8% DV; cholesterol 0mg; sodium 230.2mg 9% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/254517/spaghetti-sauce-with-fresh-tomatoes/", "name": "Spaghetti Sauce with Fresh Tomatoes", "summary": "\nMade with fresh tomatoes! Wonderful taste. Serve over spaghetti noodles and add grated Parmesan cheese as desired. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3733395.jpg", "meta": [["prep:", "15 mins"], ["cook:", "1 hr 10 mins"], ["total:", "1 hr 25 mins"], ["Servings:", "8"], ["Yield:", "1 quart sauce"]], "ingredients": ["¼ cup olive oil", "1  onion, chopped", "½ teaspoon garlic powder", "4 pounds fresh tomatoes, peeled and chopped", "1 tablespoon white sugar", "1 tablespoon dried basil", "1 tablespoon dried parsley", "1 teaspoon salt"], "direction": ["Heat olive oil in a large skillet over medium heat. Add onion and garlic powder; cook and stir until onion is translucent, about 5 minutes. Add tomatoes, sugar, basil, parsley, and salt. Bring to a boil. Reduce heat and simmer, stirring occasionally, until sauce thickens, 1 to 2 hours."], "facts": "120 calories; protein 2.5g 5% DV; carbohydrates 13.5g 4% DV; fat 7.3g 11% DV; cholesterol 0mg; sodium 304.3mg 12% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/264825/air-fried-sweet-potato-fries/", "name": "Air-Fried Sweet Potato Fries", "summary": "\nSimple and addicting air-fried sweet potato fries. I bet you can't eat just one. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5397989.jpg", "meta": [["prep:", "10 mins"], ["cook:", "10 mins"], ["total:", "20 mins"], ["Servings:", "2"], ["Yield:", "2 servings"]], "ingredients": ["1  sweet potatoes, peeled and cut into 1/2 inch wide fries", "1 tablespoon canola oil", "½ teaspoon kosher salt", "¼ teaspoon pepper", "⅛ teaspoon garlic powder", "⅛ teaspoon ground sweet paprika"], "direction": ["Preheat the air fryer to 400 degrees F (200 degrees C).", "Combine sweet potato fries and canola oil in a bowl and mix. Season with salt, pepper, garlic powder, and paprika. Mix until all fries are evenly coated.", "Divide sweet potatoes into 2 or 3 batches for cooking. Place an even layer of sweet potatoes in the fry basket, insert in the air fryer, and cook until golden, about 10 minutes. Repeat with remaining sweet potatoes."], "facts": "119 calories; protein 1.1g 2% DV; carbohydrates 13.5g 4% DV; fat 7.1g 11% DV; cholesterol 0mg; sodium 516mg 21% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/51025/microwave-corn-on-the-cob/", "name": "Microwave Corn on the Cob", "summary": "\nThis is a no-nonsense recipe for corn on the cob. Perfect for when you run out of stove or grill space. I freeze the corn on the cob in plastic bags, and remove a single ear of frozen corn in the cold winter months to have the sweet taste of summer corn throughout the year! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F838726.jpg", "meta": [["cook:", "5 mins"], ["total:", "5 mins"], ["Servings:", "1"], ["Yield:", "1 serving"]], "ingredients": ["1 ear corn, husked and cleaned"], "direction": ["Wet a paper towel, and wring out. Wrap the ear of corn in the moist towel, and place on a dinner plate. Cook in the microwave for 5 minutes. Carefully remove paper towel, and enjoy!"], "facts": "123 calories; protein 4.6g 9% DV; carbohydrates 27.2g 9% DV; fat 1.7g 3% DV; cholesterol 0mg; sodium 21.5mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/17445/grilled-asparagus/", "name": "Grilled Asparagus", "summary": "\nThe special thing about this recipe is that it's so simple. Fresh asparagus with a little oil, salt, and pepper is cooked quickly over high heat on the grill. Enjoy the natural flavor of your veggies. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014212.jpg", "meta": [["prep:", "15 mins"], ["cook:", "3 mins"], ["total:", "18 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 pound fresh asparagus spears, trimmed", "1 tablespoon olive oil", "salt and pepper to taste"], "direction": ["Preheat grill for high heat.", "Lightly coat the asparagus spears with olive oil. Season with salt and pepper to taste.", "Grill over high heat for 2 to 3 minutes, or to desired tenderness."], "facts": "53 calories; protein 2.5g 5% DV; carbohydrates 4.4g 1% DV; fat 3.5g 5% DV; cholesterol 0mg; sodium 2.3mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/23256/black-halloween-punch/", "name": "Black Halloween Punch", "summary": "\nDelicious! As it is with any Halloween punch, a frozen 'hand' adds just the right spooky touch! The combined colors make a delightfully scary look! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2440215.jpg", "meta": [["prep:", "10 mins"], ["additional:", "50 mins"], ["total:", "1 hr"], ["Servings:", "32"], ["Yield:", "1 gallon"]], "ingredients": ["1 (.13 ounce) envelope unsweetened grape soft drink mix", "1 (.13 ounce) envelope unsweetened orange soft drink mix", "2 cups white sugar", "3 quarts cold water", "1 liter ginger ale"], "direction": ["To make a frozen hand, wash a disposable glove, fill with water, seal with a rubber band and freeze until hard.", "Stir together grape soft drink mix, orange soft drink mix, sugar and water until solids are dissolved.  Combine with chilled ginger ale just before serving.  Dip the frozen hand briefly in warm water, then peel off the glove.  Float the prepared hand in the punch bowl for a ghastly effect."], "facts": "59 calories; protein 0g; carbohydrates 15.2g 5% DV; fat 0g; cholesterol 0mg; sodium 8.7mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/14169/mexican-bean-salad/", "name": "Mexican Bean Salad", "summary": "\nA colorful, spicy, and refreshing bean and corn salad. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F828805.jpg", "meta": [["prep:", "15 mins"], ["additional:", "1 hr"], ["total:", "1 hr 15 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (15 ounce) can black beans, rinsed and drained", "1 (15 ounce) can kidney beans, drained", "1 (15 ounce) can cannellini beans, drained and rinsed", "1  green bell pepper, chopped", "1  red bell pepper, chopped", "1 (10 ounce) package frozen corn kernels", "1  red onion, chopped", "½ cup olive oil", "½ cup red wine vinegar", "2 tablespoons fresh lime juice", "1 tablespoon lemon juice", "2 tablespoons white sugar", "1 tablespoon salt", "1 clove crushed garlic", "¼ cup chopped fresh cilantro", "½ tablespoon ground cumin", "½ tablespoon ground black pepper", "1 dash hot pepper sauce", "½ teaspoon chili powder"], "direction": ["In a large bowl, combine beans, bell peppers, frozen corn, and red onion.", "In a small bowl, whisk together olive oil, red wine vinegar, lime juice, lemon juice, sugar, salt, garlic, cilantro, cumin, and black pepper.  Season to taste with hot sauce and chili powder.", "Pour olive oil dressing over vegetables; mix well.  Chill thoroughly, and serve cold."], "facts": "334 calories; protein 11.2g 22% DV; carbohydrates 41.7g 14% DV; fat 14.8g 23% DV; cholesterol 0mg; sodium 1158.8mg 46% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/", "name": "Spiced Slow Cooker Applesauce", "summary": "\nThis easy and delicious spiced applesauce slow cooks to perfection. My kids and I came up with this recipe one fall weekend. It's a family favorite. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277498.jpg", "meta": [["prep:", "10 mins"], ["cook:", "6 hrs 30 mins"], ["total:", "6 hrs 40 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["8  apples - peeled, cored, and thinly sliced", "½ cup water", "¾ cup packed brown sugar", "½ teaspoon pumpkin pie spice"], "direction": ["Combine the apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in the brown sugar and pumpkin pie spice; continue cooking another 30 minutes."], "facts": "151 calories; protein 0.4g 1% DV; carbohydrates 39.4g 13% DV; fat 0.2g; cholesterol 0mg; sodium 7.7mg."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/24712/ginger-veggie-stir-fry/", "name": "Ginger Veggie Stir-Fry", "summary": "\nI just whipped this up one day when I felt like a stir-fry but did not have all the ingredients called for in some of the stir-fry recipes on this site. I used certain veggies I had on hand, but any seasonal veggies may be used. It has a mild ginger flavor that can be enhanced according to taste, and is filling yet light on the tummy! Tofu may be added. Serve over a bed of steamed jasmine rice. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F709130.jpg", "meta": [["prep:", "25 mins"], ["cook:", "15 mins"], ["total:", "40 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["1 tablespoon cornstarch", "1 ½ cloves garlic, crushed", "2 teaspoons chopped fresh ginger root, divided", "¼ cup vegetable oil, divided", "1 small head broccoli, cut into florets", "½ cup snow peas", "¾ cup julienned carrots", "½ cup halved green beans", "2 tablespoons soy sauce", "2 ½ tablespoons water", "¼ cup chopped onion", "½ tablespoon salt"], "direction": ["In a large bowl, blend cornstarch, garlic, 1 teaspoon ginger, and 2 tablespoons vegetable oil until cornstarch is dissolved. Mix in broccoli, snow peas, carrots, and green beans, tossing to lightly coat.", "Heat remaining 2 tablespoons oil in a large skillet or wok over medium heat.  Cook vegetables in oil for 2 minutes, stirring constantly to prevent burning. Stir in soy sauce and water. Mix in onion, salt, and remaining 1 teaspoon ginger. Cook until vegetables are tender but still crisp."], "facts": "119 calories; protein 2.2g 4% DV; carbohydrates 8g 3% DV; fat 9.3g 14% DV; cholesterol 0mg; sodium 903.3mg 36% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/35304/pico-de-gallo/", "name": "Pico De Gallo", "summary": "\nSometimes when you eat authentic Mexican food, they give you this salsa stuff made with tomatoes, onions, and jalapenos. You can add a squeeze of lime juice to pico de gallo, but I prefer this basic recipe. Once you serve this with your Mexican dish such as tacos, you will want it with all your Mexican dishes! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F377426.jpg", "meta": [["prep:", "20 mins"], ["additional:", "30 mins"], ["total:", "50 mins"], ["Servings:", "4"], ["Yield:", "4 servings"]], "ingredients": ["1 medium tomato, diced", "1  onion, finely chopped", "½  fresh jalapeno pepper, seeded and chopped", "2 sprigs fresh cilantro, finely chopped", "1  green onion, finely chopped", "½ teaspoon garlic powder", "⅛ teaspoon salt", "⅛ teaspoon pepper"], "direction": ["In a medium bowl, combine tomato, onion, jalapeno pepper (to taste,) cilantro and green onion. Season with garlic powder, salt and pepper. Stir until evenly distributed. Refrigerate for 30 minutes."], "facts": "21 calories; protein 0.8g 2% DV; carbohydrates 4.7g 2% DV; fat 0.1g; cholesterol 0mg; sodium 76.3mg 3% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/191885/vegan-pancakes/", "name": "Vegan Pancakes", "summary": "\nThis batter makes light, fluffy, and delicious pancakes.  I have been making them for years and everyone that tries them wants the recipe. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2682199.jpg", "meta": [["prep:", "5 mins"], ["cook:", "10 mins"], ["total:", "15 mins"], ["Servings:", "3"], ["Yield:", "9 pancakes"]], "ingredients": ["1 ¼ cups all-purpose flour", "2 tablespoons white sugar", "2 teaspoons baking powder", "½ teaspoon salt", "1 ¼ cups water", "1 tablespoon oil"], "direction": ["Sift the flour, sugar, baking powder, and salt into a large bowl.  Whisk the water and oil together in a small bowl.  Make a well in the center of the dry ingredients, and pour in the wet.  Stir just until blended; mixture will be lumpy.", "Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter."], "facts": "264 calories; protein 5.4g 11% DV; carbohydrates 48.9g 16% DV; fat 5.1g 8% DV; cholesterol 0mg; sodium 716.7mg 29% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/265979/air-fryer-baked-potatoes/", "name": "Air Fryer Baked Potatoes", "summary": "\nBeautifully crusty on the outside and light and fluffy on the inside, just like a great baked potato should be! Serve them with your favorite topping, like sour cream, butter, or chives. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6543245.jpg", "meta": [["prep:", "5 mins"], ["cook:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "2"], ["Yield:", "2 baked potatoes"]], "ingredients": ["2 large russet potatoes, scrubbed", "1 tablespoon peanut oil", "½ teaspoon coarse sea salt"], "direction": ["Preheat air fryer to 400 degrees F (200 degrees C).", "Brush potatoes with peanut oil and sprinkle with salt. Place them in the air fryer basket and place basket in the air fryer.", "Cook potatoes until done, about 1 hour. Test for doneness by piercing them with a fork."], "facts": "344 calories; protein 7.5g 15% DV; carbohydrates 64.5g 21% DV; fat 7.1g 11% DV; cholesterol 0mg; sodium 462.1mg 19% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/26391/chili-seasoning-mix-ii/", "name": "Chili Seasoning Mix II", "summary": "\nThis chili seasoning features flour, chili powder, red pepper, onion, garlic and cumin. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4539476.jpg", "meta": [["prep:", "10 mins"], ["total:", "10 mins"], ["Servings:", "6"], ["Yield:", "0.75 cup"]], "ingredients": ["¼ cup all-purpose flour", "4 teaspoons chili powder", "1 tablespoon crushed red pepper", "1 tablespoon dried minced onion", "1 tablespoon dried, minced garlic", "2 teaspoons white sugar", "2 teaspoons ground cumin", "2 teaspoons dried parsley", "2 teaspoons salt", "1 teaspoon dried basil", "¼ teaspoon ground black pepper"], "direction": ["In a bowl, stir together flour, chili powder, red pepper, onion, garlic, sugar, cumin, parsley, salt, basil and pepper.  Store in an airtight container."], "facts": "45 calories; protein 1.4g 3% DV; carbohydrates 9.2g 3% DV; fat 0.8g 1% DV; cholesterol 0mg; sodium 796mg 32% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/42022/easy-apple-cider/", "name": "Easy Apple Cider", "summary": "\nSimple spiced apple cider! I used to buy the spices already mixed at the grocery store, and they stopped carrying it this year, so I just made my own. This is great for a shower or get together and the slow cooker keeps it warm, so guests can enjoy it through the night. When it's done, it's great mixed with spiced rum and/or a slice of orange! Leftover cider is great cold too! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F244619.jpg", "meta": [["prep:", "5 mins"], ["cook:", "1 hr"], ["total:", "1 hr 5 mins"], ["Servings:", "8"], ["Yield:", "8 servings"]], "ingredients": ["1 (64 fluid ounce) bottle apple cider", "3  cinnamon sticks", "1 teaspoon whole allspice", "1 teaspoon whole cloves", "⅓ cup brown sugar"], "direction": ["In a slow cooker, combine apple cider and cinnamon sticks. Wrap allspice and cloves in a small piece of cheesecloth, and add to pot. Stir in brown sugar. Bring to a boil over high heat. Reduce heat, and keep warm."], "facts": "172 calories; protein 0.1g; carbohydrates 43.4g 14% DV; fat 0.1g; cholesterol 0mg; sodium 31.1mg 1% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/144346/roasted-garlic-lemon-broccoli/", "name": "Roasted Garlic Lemon Broccoli", "summary": "\nI was looking for a unique way to prepare broccoli and decided to give this a try! Florets are roasted after being tossed in olive oil and sprinkled with sea salt, freshly ground black pepper, and minced garlic. A squeeze of lemon juice before serving seals the deal. \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F549154.jpg", "meta": [["prep:", "10 mins"], ["cook:", "15 mins"], ["total:", "25 mins"], ["Servings:", "6"], ["Yield:", "6 servings"]], "ingredients": ["2 heads broccoli, separated into florets", "2 teaspoons extra-virgin olive oil", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 clove garlic, minced", "½ teaspoon lemon juice"], "direction": ["Preheat the oven to 400 degrees F (200 degrees C).", "In a large bowl, toss broccoli florets with the extra virgin olive oil, sea salt, pepper and garlic. Spread the broccoli out in an even layer on a baking sheet.", "Bake in the preheated oven until florets are tender enough to pierce the stems with a fork, 15 to 20 minutes. Remove and transfer to a serving platter. Squeeze lemon juice liberally over the broccoli before serving for a refreshing, tangy finish."], "facts": "49 calories; protein 2.9g 6% DV; carbohydrates 7g 2% DV; fat 1.9g 3% DV; cholesterol 0mg; sodium 326.5mg 13% DV."}, {"type": "By Audience ", "package": "vegan_recipes", "link": "https://www.allrecipes.com/recipe/236564/chana-masala-savory-indian-chick-peas/", "name": "Chana Masala (Savory Indian Chick Peas)", "summary": "\nIndian food is not just curried sauces. It's not too exotic either. Unless 'exotic' is code for 'yummy and full of flavor.' This dish features a healthy mixture of chickpeas, tomatoes, onion, and spices. Both carnivores and vegetarians will enjoy this meal. My kids love it. Leave out the green chile if the kiddies will be eating. Serve over basmati or jasmine rice and enjoy. Namaste y'all! \n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4240620.jpg", "meta": [["prep:", "15 mins"], ["cook:", "15 mins"], ["total:", "30 mins"], ["Servings:", "2"], ["Yield:", "2 cups"]], "ingredients": ["1  onion, chopped", "1  tomato, chopped", "1 (1 inch) piece fresh ginger, peeled and chopped", "4 cloves garlic, chopped, or more to taste", "1  green chile pepper, seeded and chopped  (Optional)", "3 tablespoons olive oil", "2  bay leaves, or more to taste", "1 teaspoon chili powder", "1 teaspoon coriander powder", "1 teaspoon garam masala", "½ teaspoon turmeric powder", "1 pinch salt to taste", "water as needed", "1 (15 ounce) can chickpeas", "1 teaspoon fresh cilantro leaves, for garnish, or more to taste"], "direction": ["Grind onion, tomato, ginger, garlic, and chile pepper together in a food processor into a paste.", "Heat olive oil in a large skillet over medium heat. Fry bay leaves in hot oil until fragrant, about 30 seconds. Pour the paste into the skillet and cook until the oil begins to separate from the mixture and is golden brown in color, 2 to 3 minutes. Season the mixture with chili powder, coriander, powder, gram masala, turmeric, and salt; cook and stir until very hot, 2 to 3 minutes.", "Stir enough water into the mixture to get a thick gravy; bring to a boil and stir chickpeas into the gravy. Reduce heat to medium and cook until the chickpeas are heated through, 5 to 7 minutes. Garnish with cilantro."], "facts": "413 calories; protein 9.4g 19% DV; carbohydrates 46.2g 15% DV; fat 22.8g 35% DV; cholesterol 0mg; sodium 524.9mg 21% DV."}]